{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}G:\Mi unidad\JM\Facultad de Ciencias Económicas (FCE)\Maestría en Econometría\6. Microeconometría I\Examen\Datos\Examen Final.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Mar 2025, 00:48:53
{txt}
{com}. 
. 
. *##############################################################################*
. ***************** PRIMERA PARTE: LOGIT, PROBIT, TOBIT Y HECKMAN ****************
. *##############################################################################*
. 
. 
. use "mroz", clear
{txt}
{com}. describe

{txt}Contains data from {res}mroz.dta
{txt} Observations:{res}           753                  
{txt}    Variables:{res}            19                  19 Sep 2013 15:01
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:lfp            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Dummy for labor force participation = 1{p_end}
{p 0 48}{bind:whrs           }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's hours of work in 1975{p_end}
{p 0 48}{bind:kl6            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Kids less than 6 years old in the houeshold{p_end}
{p 0 48}{bind:k618           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Kids between 6 and 18 years old in the household{p_end}
{p 0 48}{bind:wa             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's age in years{p_end}
{p 0 48}{bind:we             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's educational attainment in years{p_end}
{p 0 48}{bind:ww             }{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's 1975 average hourly earnings{p_end}
{p 0 48}{bind:rpwg           }{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's wage reported in 1976{p_end}
{p 0 48}{bind:hhrs           }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Husband's hours of work in 1975{p_end}
{p 0 48}{bind:ha             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Husband's age in years{p_end}
{p 0 48}{bind:he             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Husband's educational attainment in years{p_end}
{p 0 48}{bind:hw             }{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Husband's 1975 average hourly earnings{p_end}
{p 0 48}{bind:faminc         }{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Family income in 1975 dollars{p_end}
{p 0 48}{bind:mtr            }{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's marginal tax rate{p_end}
{p 0 48}{bind:wmed           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's mother's years of schooling{p_end}
{p 0 48}{bind:wfed           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's father's years of schooling{p_end}
{p 0 48}{bind:un             }{txt}{bind: float   }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Unemployment rate in the county of residence{p_end}
{p 0 48}{bind:cit            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}dummy for living in a large city = 1{p_end}
{p 0 48}{bind:ax             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Wife's previous labor experience{p_end}
{txt}{hline}
Sorted by: 

{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 1 *
. ********************************************************************************
. 
. 
. *INCISO (a)*
. 
. summarize, separator(0)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}lfp {c |}{res}        753    .5683931    .4956295          0          1
{txt}{space 8}whrs {c |}{res}        753    740.5764    871.3142          0       4950
{txt}{space 9}kl6 {c |}{res}        753    .2377158     .523959          0          3
{txt}{space 8}k618 {c |}{res}        753    1.353254    1.319874          0          8
{txt}{space 10}wa {c |}{res}        753    42.53785    8.072574         30         60
{txt}{space 10}we {c |}{res}        753    12.28685    2.280246          5         17
{txt}{space 10}ww {c |}{res}        753    2.374565    3.241829          0         25
{txt}{space 8}rpwg {c |}{res}        753    1.849734    2.419887          0       9.98
{txt}{space 8}hhrs {c |}{res}        753    2267.271    595.5666        175       5010
{txt}{space 10}ha {c |}{res}        753    45.12085    8.058793         30         60
{txt}{space 10}he {c |}{res}        753    12.49137    3.020804          3         17
{txt}{space 10}hw {c |}{res}        753    7.482179    4.230559      .4121     40.509
{txt}{space 6}faminc {c |}{res}        753    23080.59     12190.2       1500      96000
{txt}{space 9}mtr {c |}{res}        753    .6788632    .0834955      .4415      .9415
{txt}{space 8}wmed {c |}{res}        753    9.250996    3.367468          0         17
{txt}{space 8}wfed {c |}{res}        753    8.808765     3.57229          0         17
{txt}{space 10}un {c |}{res}        753    8.623506    3.114934          3         14
{txt}{space 9}cit {c |}{res}        753    .6427623    .4795042          0          1
{txt}{space 10}ax {c |}{res}        753    10.63081     8.06913          0         45
{txt}
{com}. 
. *INCISO (b)*
. 
. summarize if (lfp==1)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}lfp {c |}{res}        428           1           0          1          1
{txt}{space 8}whrs {c |}{res}        428     1302.93    776.2744         12       4950
{txt}{space 9}kl6 {c |}{res}        428    .1401869    .3919231          0          2
{txt}{space 8}k618 {c |}{res}        428    1.350467    1.315935          0          8
{txt}{space 10}wa {c |}{res}        428    41.97196    7.721084         30         60
{txt}{hline 13}{c +}{hline 57}
{space 10}we {c |}{res}        428    12.65888    2.285376          5         17
{txt}{space 10}ww {c |}{res}        428    4.177682    3.310282      .1282         25
{txt}{space 8}rpwg {c |}{res}        428    3.185864     2.43964          0       9.98
{txt}{space 8}hhrs {c |}{res}        428    2233.465    582.9088        175       5010
{txt}{space 10}ha {c |}{res}        428    44.60981    7.950055         30         60
{txt}{hline 13}{c +}{hline 57}
{space 10}he {c |}{res}        428    12.61215    3.035163          4         17
{txt}{space 10}hw {c |}{res}        428    7.226226    3.571217      .5128     26.578
{txt}{space 6}faminc {c |}{res}        428    24130.42    11671.26       2400      91044
{txt}{space 9}mtr {c |}{res}        428    .6683329    .0769364      .4415      .9415
{txt}{space 8}wmed {c |}{res}        428    9.516355      3.3081          0         17
{txt}{hline 13}{c +}{hline 57}
{space 8}wfed {c |}{res}        428    8.988318    3.523405          0         17
{txt}{space 10}un {c |}{res}        428    8.545561    3.033328          3         14
{txt}{space 9}cit {c |}{res}        428    .6401869    .4805071          0          1
{txt}{space 10}ax {c |}{res}        428    13.03738    8.055923          0         38
{txt}
{com}. summarize if (lfp==0)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}lfp {c |}{res}        325           0           0          0          0
{txt}{space 8}whrs {c |}{res}        325           0           0          0          0
{txt}{space 9}kl6 {c |}{res}        325    .3661538    .6368995          0          3
{txt}{space 8}k618 {c |}{res}        325    1.356923    1.327065          0          7
{txt}{space 10}wa {c |}{res}        325    43.28308    8.467796         30         60
{txt}{hline 13}{c +}{hline 57}
{space 10}we {c |}{res}        325    11.79692    2.181995          5         17
{txt}{space 10}ww {c |}{res}        325           0           0          0          0
{txt}{space 8}rpwg {c |}{res}        325    .0901538    .5324022          0        4.8
{txt}{space 8}hhrs {c |}{res}        325    2311.791    609.8817        640       4640
{txt}{space 10}ha {c |}{res}        325    45.79385      8.1633         30         60
{txt}{hline 13}{c +}{hline 57}
{space 10}he {c |}{res}        325    12.33231    2.999028          3         17
{txt}{space 10}hw {c |}{res}        325    7.819248    4.952948      .4121     40.509
{txt}{space 6}faminc {c |}{res}        325    21698.05    12728.15       1500      96000
{txt}{space 9}mtr {c |}{res}        325    .6927308    .0896686      .4415      .9415
{txt}{space 8}wmed {c |}{res}        325    8.901538     3.41784          0         17
{txt}{hline 13}{c +}{hline 57}
{space 8}wfed {c |}{res}        325    8.572308    3.627548          0         17
{txt}{space 10}un {c |}{res}        325    8.726154    3.221086          3         14
{txt}{space 9}cit {c |}{res}        325    .6461538    .4788995          0          1
{txt}{space 10}ax {c |}{res}        325    7.461538    6.918567          0         45
{txt}
{com}. 
. *INCISO (c)*
. 
. generate prin=faminc-whrs*ww
{txt}
{com}. summarize prin

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}prin {c |}{res}        753    20128.96     11634.8  -29.05745      96000
{txt}
{com}. 
. *INCISO (d)*
. 
. generate lww=ln(ww)
{txt}(325 missing values generated)

{com}. summarize lww

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}lww {c |}{res}        428    1.190173    .7231978  -2.054164   3.218876
{txt}
{com}. 
. generate ax2=ax*ax
{txt}
{com}. generate wa2=wa*wa
{txt}
{com}. 
. regres lww wa we cit ax ax2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       428
{txt}{hline 13}{c +}{hline 34}   F(5, 422)       = {res}    15.85
{txt}       Model {c |} {res} 35.3048763         5  7.06097526   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 188.022565       422  .445551101   {txt}R-squared       ={res}    0.1581
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1481
{txt}       Total {c |} {res} 223.327441       427  .523015084   {txt}Root MSE        =   {res}  .6675

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lww{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}wa {c |}{col 14}{res}{space 2}-.0001945{col 26}{space 2} .0048945{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.0098152{col 67}{space 3} .0094263
{txt}{space 10}we {c |}{col 14}{res}{space 2}  .105676{col 26}{space 2} .0143701{col 37}{space 1}    7.35{col 46}{space 3}0.000{col 54}{space 4} .0774302{col 67}{space 3} .1339218
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0545581{col 26}{space 2} .0686923{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4}-.0804637{col 67}{space 3} .1895799
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .0410581{col 26}{space 2} .0132119{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0150888{col 67}{space 3} .0670275
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0007945{col 26}{space 2} .0004006{col 37}{space 1}   -1.98{col 46}{space 3}0.048{col 54}{space 4}-.0015819{col 67}{space 3}-7.14e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5231308{col 26}{space 2} .2782635{col 37}{space 1}   -1.88{col 46}{space 3}0.061{col 54}{space 4}-1.070086{col 67}{space 3} .0238243
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict flww, xb
{txt}
{com}. 
. summarize flww if (lfp==0), separator(0)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}flww {c |}{res}        325    .9745642    .2923664  -.0058352   1.757633
{txt}
{com}. summarize lww if (lfp==1), separator(0)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}lww {c |}{res}        428    1.190173    .7231978  -2.054164   3.218876
{txt}
{com}. 
. generate lww1=.
{txt}(753 missing values generated)

{com}. replace lww1=lww if (lfp==1)
{txt}(428 real changes made)

{com}. replace lww1=flww if (lfp==0)
{txt}(325 real changes made)

{com}. 
. summarize lww1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}lww1 {c |}{res}        753    1.097115    .5875592  -2.054164   3.218876
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 2 *
. ********************************************************************************
. 
. 
. *INCISO (a)*
. 
. summarize whrs if (lfp==0)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}whrs {c |}{res}        325           0           0          0          0
{txt}
{com}. regress whrs kl6 k618 wa we lww1 prin

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(6, 746)       = {res}    17.35
{txt}       Model {c |} {res} 69918508.6         6  11653084.8   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  500991215       746  671569.994   {txt}R-squared       ={res}    0.1225
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1154
{txt}       Total {c |} {res}  570909724       752  759188.463   {txt}Root MSE        =   {res} 819.49

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-497.7525{col 26}{space 2} 63.93751{col 37}{space 1}   -7.78{col 46}{space 3}0.000{col 54}{space 4}-623.2714{col 67}{space 3}-372.2337
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-79.16349{col 26}{space 2} 24.97937{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-128.2017{col 67}{space 3}-30.12527
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-20.31185{col 26}{space 2} 4.535243{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4} -29.2152{col 67}{space 3}-11.40849
{txt}{space 10}we {c |}{col 14}{res}{space 2} 43.65517{col 26}{space 2} 15.42005{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} 13.38332{col 67}{space 3} 73.92703
{txt}{space 8}lww1 {c |}{col 14}{res}{space 2} 111.0774{col 26}{space 2} 57.20935{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-1.233081{col 67}{space 3} 223.3879
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0104968{col 26}{space 2} .0027022{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 54}{space 4}-.0158016{col 67}{space 3} -.005192
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1383.091{col 26}{space 2} 287.1968{col 37}{space 1}    4.82{col 46}{space 3}0.000{col 54}{space 4} 819.2806{col 67}{space 3} 1946.901
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *INCISO (b)*
. 
. display as text "La elasticidad de las horas trabajadas con respecto a los salarios es " as result _b[lww1]/1500
{res}{txt}La elasticidad de las horas trabajadas con respecto a los salarios es {res}.07405159
{txt}
{com}. display as text "La elasticidad de las horas trabajadas con respecto a la renta de la propiedad es " as result _b[prin]*1000/1500
{res}{txt}La elasticidad de las horas trabajadas con respecto a la renta de la propiedad es {res}-.00699786
{txt}
{com}. display as text "La respuesta implícita de las horas trabajadas ante un cambio de 1 dólar en el salario es " as result _b[lww1]/4.5
{res}{txt}La respuesta implícita de las horas trabajadas ante un cambio de 1 dólar en el salario es {res}24.683865
{txt}
{com}. display as text "La respuesta implícita de las horas trabajadas ante un aumento de $1.000 en el ingreso de la propiedad es " as result _b[prin]*1000
{res}{txt}La respuesta implícita de las horas trabajadas ante un aumento de $1.000 en el ingreso de la propiedad es {res}-10.496796
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 3 *
. ********************************************************************************
. 
. 
. local vars="lww1 kl6 k618 wa we un cit prin"
{txt}
{com}. 
. *INCISO (a)*
. 
. regress lfp `vars'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(8, 744)       = {res}    17.28
{txt}       Model {c |} {res} 28.9458948         8  3.61823684   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 155.781861       744  .209384222   {txt}R-squared       ={res}    0.1567
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1476
{txt}       Total {c |} {res} 184.727756       752  .245648611   {txt}Root MSE        =   {res} .45759

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} .0932754{col 26}{space 2} .0319824{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} .0304888{col 67}{space 3} .1560619
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-.2906401{col 26}{space 2} .0357228{col 37}{space 1}   -8.14{col 46}{space 3}0.000{col 54}{space 4}-.3607696{col 67}{space 3}-.2205106
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0083879{col 26}{space 2} .0139698{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 54}{space 4}-.0358129{col 67}{space 3}  .019037
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0116091{col 26}{space 2} .0025492{col 37}{space 1}   -4.55{col 46}{space 3}0.000{col 54}{space 4}-.0166136{col 67}{space 3}-.0066046
{txt}{space 10}we {c |}{col 14}{res}{space 2} .0420989{col 26}{space 2} .0086508{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4}  .025116{col 67}{space 3} .0590817
{txt}{space 10}un {c |}{col 14}{res}{space 2} -.003487{col 26}{space 2} .0054787{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-.0142426{col 67}{space 3} .0072686
{txt}{space 9}cit {c |}{col 14}{res}{space 2} -.004477{col 26}{space 2} .0367137{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-.0765518{col 67}{space 3} .0675978
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-6.77e-06{col 26}{space 2} 1.54e-06{col 37}{space 1}   -4.40{col 46}{space 3}0.000{col 54}{space 4}-9.79e-06{col 67}{space 3}-3.75e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6922918{col 26}{space 2}  .162686{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .3729135{col 67}{space 3}  1.01167
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estimates store est_ols_lfp
{txt}
{com}. predict lfp_ols, xb
{txt}
{com}. summarize lfp_ols

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}lfp_ols {c |}{res}        753    .5683931    .1961935  -.4476629   1.169574
{txt}
{com}. matrix define betas_ols=e(b)
{txt}
{com}. 
. count if (lfp_ols<0)
  {res}7
{txt}
{com}. local obs_menor_0=r(N)
{txt}
{com}. display as text "Observaciones con valores ajustados negativos: " as result `obs_menor_0'
{res}{txt}Observaciones con valores ajustados negativos: {res}7
{txt}
{com}. 
. count if (lfp_ols>1)
  {res}9
{txt}
{com}. local obs_mayor_1=r(N)
{txt}
{com}. display as text "Observaciones con valores ajustados mayores que 1: " as result `obs_mayor_1'
{res}{txt}Observaciones con valores ajustados mayores que 1: {res}9
{txt}
{com}. 
. *INCISO (b)*
. 
. logit lfp `vars'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:  -449.998}  
Iteration 2:{space 3}log likelihood = {res: -449.4765}  
Iteration 3:{space 3}log likelihood = {res:-449.47564}  
Iteration 4:{space 3}log likelihood = {res:-449.47564}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:130.80}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-449.47564}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1270}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} .4644233{col 26}{space 2} .1572362{col 37}{space 1}    2.95{col 46}{space 3}0.003{col 54}{space 4} .1562461{col 67}{space 3} .7726006
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-1.469201{col 26}{space 2} .1985189{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4}-1.858291{col 67}{space 3}-1.080112
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0512143{col 26}{space 2} .0684263{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-.1853275{col 67}{space 3} .0828989
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0582569{col 26}{space 2} .0129069{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4} -.083554{col 67}{space 3}-.0329599
{txt}{space 10}we {c |}{col 14}{res}{space 2} .2119735{col 26}{space 2} .0441121{col 37}{space 1}    4.81{col 46}{space 3}0.000{col 54}{space 4} .1255153{col 67}{space 3} .2984317
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0185696{col 26}{space 2} .0264618{col 37}{space 1}   -0.70{col 46}{space 3}0.483{col 54}{space 4}-.0704337{col 67}{space 3} .0332945
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0127482{col 26}{space 2} .1781669{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.3364525{col 67}{space 3}  .361949
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000353{col 26}{space 2} 8.11e-06{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.0000512{col 67}{space 3}-.0000194
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9510144{col 26}{space 2} .8042517{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 54}{space 4}-.6252899{col 67}{space 3} 2.527319
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_logit_lfp
{txt}
{com}. predict lfp_logit_pr, pr
{txt}
{com}. summarize lfp_logit_pr

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
lfp_logit_pr {c |}{res}        753    .5683931    .1991988   .0072784   .9662621
{txt}
{com}. matrix define betas_logit=e(b)
{txt}
{com}. estat classification

{txt}Logistic model for lfp

{col 15}{hline 8} True {hline 8}
Classified {c |}{col 22}D{col 35}~D  {c |}{col 46}Total
{hline 11}{c +}{hline 26}{c +}{hline 11}
{col 6}+{col 12}{c |} {res}      346{col 28}      161{txt}  {c |}  {res}      507
{txt}{col 6}-{col 12}{c |} {res}       82{col 28}      164{txt}  {c |}  {res}      246
{txt}{hline 11}{c +}{hline 26}{c +}{hline 11}
   Total   {c |} {res}      428{col 28}      325{txt}  {c |}  {res}      753

{txt}Classified + if predicted Pr(D) >= .5
True D defined as lfp != 0
{hline 50}
Sensitivity                     Pr( +| D){res}   80.84%
{txt}Specificity                     Pr( -|~D){res}   50.46%
{txt}Positive predictive value       Pr( D| +){res}   68.24%
{txt}Negative predictive value       Pr(~D| -){res}   66.67%
{txt}{hline 50}
False + rate for true ~D        Pr( +|~D){res}   49.54%
{txt}False - rate for true D         Pr( -| D){res}   19.16%
{txt}False + rate for classified +   Pr(~D| +){res}   31.76%
{txt}False - rate for classified -   Pr( D| -){res}   33.33%
{txt}{hline 50}
Correctly classified                     {res}   67.73%
{txt}{hline 50}

{com}. 
. esttab est_ols_lfp est_logit_lfp, se star(* 0.10 ** 0.05 *** 0.01) r2 pr2 mtitles("OLS" "Logit")
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                      OLS           Logit   
{txt}{hline 44}
{res}main                                        {txt}
{txt}lww1        {res}       0.0933***        0.464***{txt}
            {res} {ralign 12:{txt:(}0.0320{txt:)}}    {ralign 12:{txt:(}0.157{txt:)}}   {txt}

{txt}kl6         {res}       -0.291***       -1.469***{txt}
            {res} {ralign 12:{txt:(}0.0357{txt:)}}    {ralign 12:{txt:(}0.199{txt:)}}   {txt}

{txt}k618        {res}     -0.00839         -0.0512   {txt}
            {res} {ralign 12:{txt:(}0.0140{txt:)}}    {ralign 12:{txt:(}0.0684{txt:)}}   {txt}

{txt}wa          {res}      -0.0116***      -0.0583***{txt}
            {res} {ralign 12:{txt:(}0.00255{txt:)}}    {ralign 12:{txt:(}0.0129{txt:)}}   {txt}

{txt}we          {res}       0.0421***        0.212***{txt}
            {res} {ralign 12:{txt:(}0.00865{txt:)}}    {ralign 12:{txt:(}0.0441{txt:)}}   {txt}

{txt}un          {res}     -0.00349         -0.0186   {txt}
            {res} {ralign 12:{txt:(}0.00548{txt:)}}    {ralign 12:{txt:(}0.0265{txt:)}}   {txt}

{txt}cit         {res}     -0.00448          0.0127   {txt}
            {res} {ralign 12:{txt:(}0.0367{txt:)}}    {ralign 12:{txt:(}0.178{txt:)}}   {txt}

{txt}prin        {res}  -0.00000677***   -0.0000353***{txt}
            {res} {ralign 12:{txt:(}0.00000154{txt:)}}    {ralign 12:{txt:(}0.00000811{txt:)}}   {txt}

{txt}_cons       {res}        0.692***        0.951   {txt}
            {res} {ralign 12:{txt:(}0.163{txt:)}}    {ralign 12:{txt:(}0.804{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}R-sq        {res}        0.157                   {txt}
{txt}pseudo R-sq {res}                        0.127   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. *INCISO (c)*
. 
. probit lfp `vars'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-449.69111}  
Iteration 2:{space 3}log likelihood = {res:-449.39704}  
Iteration 3:{space 3}log likelihood = {res:-449.39696}  
Iteration 4:{space 3}log likelihood = {res:-449.39696}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:130.95}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-449.39696}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1272}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} .2820424{col 26}{space 2}  .092771{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} .1002145{col 67}{space 3} .4638703
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-.8808229{col 26}{space 2} .1146558{col 37}{space 1}   -7.68{col 46}{space 3}0.000{col 54}{space 4}-1.105544{col 67}{space 3}-.6561017
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0297267{col 26}{space 2} .0407748{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-.1096439{col 67}{space 3} .0501904
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0349665{col 26}{space 2} .0076782{col 37}{space 1}   -4.55{col 46}{space 3}0.000{col 54}{space 4}-.0500155{col 67}{space 3}-.0199175
{txt}{space 10}we {c |}{col 14}{res}{space 2} .1277126{col 26}{space 2} .0259654{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .0768214{col 67}{space 3} .1786039
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0110548{col 26}{space 2} .0159776{col 37}{space 1}   -0.69{col 46}{space 3}0.489{col 54}{space 4}-.0423704{col 67}{space 3} .0202607
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0100105{col 26}{space 2} .1076264{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.2009333{col 67}{space 3} .2209543
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000212{col 26}{space 2} 4.71e-06{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-.0000304{col 67}{space 3} -.000012
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5678982{col 26}{space 2} .4820863{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.3769737{col 67}{space 3}  1.51277
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_probit_lfp
{txt}
{com}. predict lfp_probit_pr, pr
{txt}
{com}. summarize lfp_probit_pr

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
lfp_probit~r {c |}{res}        753    .5707308    .1980807   .0016417   .9788364
{txt}
{com}. matrix define betas_probit=e(b)
{txt}
{com}. estat classification

{txt}Probit model for lfp

{col 15}{hline 8} True {hline 8}
Classified {c |}{col 22}D{col 35}~D  {c |}{col 46}Total
{hline 11}{c +}{hline 26}{c +}{hline 11}
{col 6}+{col 12}{c |} {res}      349{col 28}      165{txt}  {c |}  {res}      514
{txt}{col 6}-{col 12}{c |} {res}       79{col 28}      160{txt}  {c |}  {res}      239
{txt}{hline 11}{c +}{hline 26}{c +}{hline 11}
   Total   {c |} {res}      428{col 28}      325{txt}  {c |}  {res}      753

{txt}Classified + if predicted Pr(D) >= .5
True D defined as lfp != 0
{hline 50}
Sensitivity                     Pr( +| D){res}   81.54%
{txt}Specificity                     Pr( -|~D){res}   49.23%
{txt}Positive predictive value       Pr( D| +){res}   67.90%
{txt}Negative predictive value       Pr(~D| -){res}   66.95%
{txt}{hline 50}
False + rate for true ~D        Pr( +|~D){res}   50.77%
{txt}False - rate for true D         Pr( -| D){res}   18.46%
{txt}False + rate for classified +   Pr(~D| +){res}   32.10%
{txt}False - rate for classified -   Pr( D| -){res}   33.05%
{txt}{hline 50}
Correctly classified                     {res}   67.60%
{txt}{hline 50}

{com}. 
. esttab est_logit_lfp est_probit_lfp, se star(* 0.10 ** 0.05 *** 0.01) pr2 mtitles("Logit" "Probit")
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}                    Logit          Probit   
{txt}{hline 44}
{res}lfp                                         {txt}
{txt}lww1        {res}        0.464***        0.282***{txt}
            {res} {ralign 12:{txt:(}0.157{txt:)}}    {ralign 12:{txt:(}0.0928{txt:)}}   {txt}

{txt}kl6         {res}       -1.469***       -0.881***{txt}
            {res} {ralign 12:{txt:(}0.199{txt:)}}    {ralign 12:{txt:(}0.115{txt:)}}   {txt}

{txt}k618        {res}      -0.0512         -0.0297   {txt}
            {res} {ralign 12:{txt:(}0.0684{txt:)}}    {ralign 12:{txt:(}0.0408{txt:)}}   {txt}

{txt}wa          {res}      -0.0583***      -0.0350***{txt}
            {res} {ralign 12:{txt:(}0.0129{txt:)}}    {ralign 12:{txt:(}0.00768{txt:)}}   {txt}

{txt}we          {res}        0.212***        0.128***{txt}
            {res} {ralign 12:{txt:(}0.0441{txt:)}}    {ralign 12:{txt:(}0.0260{txt:)}}   {txt}

{txt}un          {res}      -0.0186         -0.0111   {txt}
            {res} {ralign 12:{txt:(}0.0265{txt:)}}    {ralign 12:{txt:(}0.0160{txt:)}}   {txt}

{txt}cit         {res}       0.0127          0.0100   {txt}
            {res} {ralign 12:{txt:(}0.178{txt:)}}    {ralign 12:{txt:(}0.108{txt:)}}   {txt}

{txt}prin        {res}   -0.0000353***   -0.0000212***{txt}
            {res} {ralign 12:{txt:(}0.00000811{txt:)}}    {ralign 12:{txt:(}0.00000471{txt:)}}   {txt}

{txt}_cons       {res}        0.951           0.568   {txt}
            {res} {ralign 12:{txt:(}0.804{txt:)}}    {ralign 12:{txt:(}0.482{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          753             753   {txt}
{txt}pseudo R-sq {res}        0.127           0.127   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. matrix define prueba_logit=(betas_ols',0.25*betas_logit')
{txt}
{com}. matrix prueba_logit [9,2]=prueba_logit[9,2]+0.5
{txt}
{com}. matrix colnames prueba_logit="Betas OLS" "Prueba Betas Logit"
{txt}
{com}. matrix list prueba_logit
{res}
{txt}prueba_logit[9,2]
          Betas OLS  Prueba Bet~t
 lww1 {res}    .09327537     .11610583
{txt}  kl6 {res}   -.29064009    -.36730036
{txt} k618 {res}   -.00838792    -.01280357
{txt}   wa {res}   -.01160911    -.01456423
{txt}   we {res}    .04209886     .05299337
{txt}   un {res}   -.00348696    -.00464239
{txt}  cit {res}     -.004477     .00318706
{txt} prin {res}   -6.770e-06    -8.829e-06
{txt}_cons {res}    .69229177     .73775359
{reset}
{com}. 
. *INCISO (d)*
. 
. logit lfp `vars'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:  -449.998}  
Iteration 2:{space 3}log likelihood = {res: -449.4765}  
Iteration 3:{space 3}log likelihood = {res:-449.47564}  
Iteration 4:{space 3}log likelihood = {res:-449.47564}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:130.80}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-449.47564}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1270}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} .4644233{col 26}{space 2} .1572362{col 37}{space 1}    2.95{col 46}{space 3}0.003{col 54}{space 4} .1562461{col 67}{space 3} .7726006
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-1.469201{col 26}{space 2} .1985189{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4}-1.858291{col 67}{space 3}-1.080112
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0512143{col 26}{space 2} .0684263{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-.1853275{col 67}{space 3} .0828989
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0582569{col 26}{space 2} .0129069{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4} -.083554{col 67}{space 3}-.0329599
{txt}{space 10}we {c |}{col 14}{res}{space 2} .2119735{col 26}{space 2} .0441121{col 37}{space 1}    4.81{col 46}{space 3}0.000{col 54}{space 4} .1255153{col 67}{space 3} .2984317
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0185696{col 26}{space 2} .0264618{col 37}{space 1}   -0.70{col 46}{space 3}0.483{col 54}{space 4}-.0704337{col 67}{space 3} .0332945
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0127482{col 26}{space 2} .1781669{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.3364525{col 67}{space 3}  .361949
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000353{col 26}{space 2} 8.11e-06{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-.0000512{col 67}{space 3}-.0000194
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9510144{col 26}{space 2} .8042517{col 37}{space 1}    1.18{col 46}{space 3}0.237{col 54}{space 4}-.6252899{col 67}{space 3} 2.527319
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins
{res}
{txt}{col 1}Predictive margins{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:753}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(lfp), predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .5683931{col 26}{space 2} .0165278{col 37}{space 1}   34.39{col 46}{space 3}0.000{col 54}{space 4} .5359993{col 67}{space 3} .6007869
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. display as text "La probabilidad log-likelihood maximizada de la muestra en el modelo Logit es " as result r(b)[1,1]
{res}{txt}La probabilidad log-likelihood maximizada de la muestra en el modelo Logit es {res}.56839309
{txt}
{com}. 
. probit lfp `vars'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res:-449.69111}  
Iteration 2:{space 3}log likelihood = {res:-449.39704}  
Iteration 3:{space 3}log likelihood = {res:-449.39696}  
Iteration 4:{space 3}log likelihood = {res:-449.39696}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:8})}{col 70} = {res}{ralign 6:130.95}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-449.39696}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1272}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} .2820424{col 26}{space 2}  .092771{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} .1002145{col 67}{space 3} .4638703
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-.8808229{col 26}{space 2} .1146558{col 37}{space 1}   -7.68{col 46}{space 3}0.000{col 54}{space 4}-1.105544{col 67}{space 3}-.6561017
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0297267{col 26}{space 2} .0407748{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-.1096439{col 67}{space 3} .0501904
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0349665{col 26}{space 2} .0076782{col 37}{space 1}   -4.55{col 46}{space 3}0.000{col 54}{space 4}-.0500155{col 67}{space 3}-.0199175
{txt}{space 10}we {c |}{col 14}{res}{space 2} .1277126{col 26}{space 2} .0259654{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .0768214{col 67}{space 3} .1786039
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0110548{col 26}{space 2} .0159776{col 37}{space 1}   -0.69{col 46}{space 3}0.489{col 54}{space 4}-.0423704{col 67}{space 3} .0202607
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0100105{col 26}{space 2} .1076264{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.2009333{col 67}{space 3} .2209543
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000212{col 26}{space 2} 4.71e-06{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-.0000304{col 67}{space 3} -.000012
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5678982{col 26}{space 2} .4820863{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.3769737{col 67}{space 3}  1.51277
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins
{res}
{txt}{col 1}Predictive margins{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:753}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(lfp), predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .5707308{col 26}{space 2} .0165232{col 37}{space 1}   34.54{col 46}{space 3}0.000{col 54}{space 4}  .538346{col 67}{space 3} .6031156
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. display as text "La probabilidad log-likelihood maximizada de la muestra en el modelo Probit es " as result r(b)[1,1]
{res}{txt}La probabilidad log-likelihood maximizada de la muestra en el modelo Probit es {res}.57073081
{txt}
{com}. 
. local p1=428/753
{txt}
{com}. local z1=invnormal(`p1')
{txt}
{com}. local fz1=normalden(`z1')
{txt}
{com}. display as text "p1: " as result `p1'
{res}{txt}p1: {res}.56839309
{txt}
{com}. display as text "z1: " as result `z1'
{res}{txt}z1: {res}.17228457
{txt}
{com}. display as text "fz1: " as result `fz1'
{res}{txt}fz1: {res}.3930653
{txt}
{com}. matrix define dp1_logit=`p1'*(1-`p1')*betas_logit
{txt}
{com}. matrix define dp1_probit=`fz1'*betas_probit
{txt}
{com}. matrix define cociente1=J(1,9,.)
{txt}
{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         matrix cociente1 [1,`i']=dp1_logit[1,`i']/dp1_probit[1,`i']
{txt}  3{com}. {c )-}
{txt}
{com}. matrix define dp1=(dp1_logit',dp1_probit',cociente1')
{txt}
{com}. matrix colnames dp1="dP1 Logit" "dP1 Probit" "L/P"
{txt}
{com}. matrix list dp1
{res}
{txt}dp1[9,3]
            dP1 Logit  dP1 Probit         L/P
 lfp:lww1 {res}  .11393344   .11086108   1.0277136
{txt}  lfp:kl6 {res}   -.360428  -.34622093   1.0410347
{txt} lfp:k618 {res} -.01256401  -.01168455   1.0752673
{txt}   lfp:wa {res} -.01429173  -.01374412   1.0398429
{txt}   lfp:we {res}  .05200184   .05019941   1.0359054
{txt}   lfp:un {res} -.00455553  -.00434528   1.0483864
{txt}  lfp:cit {res}  .00312743   .00393478   .79481633
{txt} lfp:prin {res} -8.664e-06  -8.338e-06    1.039114
{txt}lfp:_cons {res}  .23330511   .22322108   1.0451751
{reset}
{com}. 
. local p2=0.9
{txt}
{com}. local z2=invnormal(`p2')
{txt}
{com}. local fz2=normalden(`z2')
{txt}
{com}. display as text "p2: " as result `p2'
{res}{txt}p2: {res}.9
{txt}
{com}. display as text "z2: " as result `z2'
{res}{txt}z2: {res}1.2815516
{txt}
{com}. display as text "fz2: " as result `fz2'
{res}{txt}fz2: {res}.17549833
{txt}
{com}. matrix define dp2_logit=`p2'*(1-`p2')*betas_logit
{txt}
{com}. matrix define dp2_probit=`fz2'*betas_probit
{txt}
{com}. matrix define cociente2=J(1,9,.)
{txt}
{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         matrix cociente2 [1,`i']=dp2_logit[1,`i']/dp2_probit[1,`i']
{txt}  3{com}. {c )-}
{txt}
{com}. matrix define dp2=(dp2_logit',dp2_probit',cociente2')
{txt}
{com}. matrix colnames dp2="dP2 Logit" "dP2 Probit" "L/P"
{txt}
{com}. matrix list dp2
{res}
{txt}dp2[9,3]
            dP2 Logit  dP2 Probit         L/P
 lfp:lww1 {res}   .0417981   .04949797   .84444068
{txt}  lfp:kl6 {res} -.13222813  -.15458295   .85538622
{txt} lfp:k618 {res} -.00460929  -.00521699   .88351411
{txt}   lfp:wa {res} -.00524312  -.00613656   .85440696
{txt}   lfp:we {res}  .01907761   .02241336   .85117163
{txt}   lfp:un {res} -.00167126  -.00194011   .86142688
{txt}  lfp:cit {res}  .00114734   .00175683   .65307616
{txt} lfp:prin {res} -3.179e-06  -3.723e-06   .85380804
{txt}lfp:_cons {res}  .08559129   .09966519   .85878826
{reset}
{com}. 
. *INCISO (e)*
. 
. matrix define betas_logit_prueba1=3^(1/2)/3.14159*betas_logit
{txt}
{com}. matrix define cociente1=J(1,9,.)
{txt}
{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         matrix cociente1 [1,`i']=betas_probit[1,`i']/betas_logit_prueba1[1,`i']
{txt}  3{com}. {c )-}
{txt}
{com}. matrix define prueba1=(betas_probit',betas_logit_prueba1',cociente1')
{txt}
{com}. matrix colnames prueba1="Betas Probit" "Betas Logit Prueba 1" "P/L"
{txt}
{com}. matrix list prueba1
{res}
{txt}prueba1[9,3]
           Betas Probit  Betas Logi~1           P/L
 lfp:lww1 {res}     .2820424     .25605022      1.101512
{txt}  lfp:kl6 {res}   -.88082293    -.81001388     1.0874171
{txt} lfp:k618 {res}   -.02972673    -.02823594     1.0527976
{txt}   lfp:wa {res}   -.03496651    -.03211875     1.0886634
{txt}   lfp:we {res}    .12771264      .1168672     1.0928014
{txt}   lfp:un {res}   -.01105485    -.01023794     1.0797917
{txt}  lfp:cit {res}     .0100105     .00702848     1.4242773
{txt} lfp:prin {res}   -.00002121    -.00001947     1.0894271
{txt}lfp:_cons {res}     .5678982     .52432214     1.0831093
{reset}
{com}. 
. matrix define betas_logit_prueba2=0.625*betas_logit
{txt}
{com}. matrix define cociente2=J(1,9,.)
{txt}
{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         matrix cociente2 [1,`i']=betas_probit[1,`i']/betas_logit_prueba2[1,`i']
{txt}  3{com}. {c )-}
{txt}
{com}. matrix define prueba2=(betas_probit',betas_logit_prueba2',cociente2')
{txt}
{com}. matrix colnames prueba2="Betas Probit" "Betas Logit Prueba 2" "P/L"
{txt}
{com}. matrix list prueba2
{res}
{txt}prueba2[9,3]
           Betas Probit  Betas Logi~2           P/L
 lfp:lww1 {res}     .2820424     .29026458     .97167349
{txt}  lfp:kl6 {res}   -.88082293    -.91825089     .95923993
{txt} lfp:k618 {res}   -.02972673    -.03200893     .92870121
{txt}   lfp:wa {res}   -.03496651    -.03641057     .96033935
{txt}   lfp:we {res}    .12771264     .13248342     .96398963
{txt}   lfp:un {res}   -.01105485    -.01160598     .95251337
{txt}  lfp:cit {res}     .0100105     .00796765     1.2563935
{txt} lfp:prin {res}   -.00002121    -.00002207       .961013
{txt}lfp:_cons {res}     .5678982     .59438397     .95543995
{reset}
{com}. 
. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 4 *
. ********************************************************************************
. 
. 
. local vars="kl6 k618 wa we prin lww1"
{txt}
{com}. 
. *INCISO (a)*
. 
. regress whrs `vars' if (lfp==1)

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       428
{txt}{hline 13}{c +}{hline 34}   F(6, 421)       = {res}     5.04
{txt}       Model {c |} {res} 17228385.5         6  2871397.59   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res}  240082634       421   570267.54   {txt}R-squared       ={res}    0.0670
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0537
{txt}       Total {c |} {res}  257311020       427   602601.92   {txt}Root MSE        =   {res} 755.16

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-342.5048{col 26}{space 2} 100.0059{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4} -539.078{col 67}{space 3}-145.9317
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-115.0205{col 26}{space 2} 30.82925{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-175.6189{col 67}{space 3}-54.42208
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-7.729976{col 26}{space 2}  5.52945{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4}-18.59874{col 67}{space 3} 3.138792
{txt}{space 10}we {c |}{col 14}{res}{space 2}-14.44486{col 26}{space 2} 17.96793{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-49.76289{col 67}{space 3} 20.87317
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0042458{col 26}{space 2} .0036558{col 37}{space 1}   -1.16{col 46}{space 3}0.246{col 54}{space 4}-.0114317{col 67}{space 3} .0029401
{txt}{space 8}lww1 {c |}{col 14}{res}{space 2}-17.40781{col 26}{space 2} 54.21544{col 37}{space 1}   -0.32{col 46}{space 3}0.748{col 54}{space 4}-123.9745{col 67}{space 3} 89.15887
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2114.697{col 26}{space 2} 340.1307{col 37}{space 1}    6.22{col 46}{space 3}0.000{col 54}{space 4} 1446.131{col 67}{space 3} 2783.263
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress whrs `vars' if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(6, 421)         =  {res}     3.93
                                                {txt}Prob > F          = {res}    0.0008
                                                {txt}R-squared         = {res}    0.0670
                                                {txt}Root MSE          =    {res} 755.16

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-342.5048{col 26}{space 2} 131.7733{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-601.5205{col 67}{space 3}-83.48919
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-115.0205{col 26}{space 2} 29.50866{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-173.0232{col 67}{space 3}-57.01786
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-7.729976{col 26}{space 2} 5.849662{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-19.22816{col 67}{space 3} 3.768206
{txt}{space 10}we {c |}{col 14}{res}{space 2}-14.44486{col 26}{space 2} 18.21292{col 37}{space 1}   -0.79{col 46}{space 3}0.428{col 54}{space 4}-50.24445{col 67}{space 3} 21.35473
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0042458{col 26}{space 2} .0032235{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-.0105821{col 67}{space 3} .0020904
{txt}{space 8}lww1 {c |}{col 14}{res}{space 2}-17.40781{col 26}{space 2} 81.37728{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-177.3642{col 67}{space 3} 142.5486
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2114.697{col 26}{space 2} 350.3186{col 37}{space 1}    6.04{col 46}{space 3}0.000{col 54}{space 4} 1426.106{col 67}{space 3} 2803.289
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estimates store est_ols_whrs
{txt}
{com}. matrix define betas_ols_whrs=e(b)
{txt}
{com}. 
. *INCISO (b)*
. 
. local p=428/753
{txt}
{com}. matrix define betas_ols_whrs_trans=betas_ols_whrs/`p'
{txt}
{com}. matlist betas_ols_whrs_trans'
{res}
{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:y1}{space 1}
{space 0}{hline 13}{c   +}{hline 11}
{space 0}{space 0}{ralign 12:kl6}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-602.5844}}}{space 1}
{space 0}{space 0}{ralign 12:k618}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-202.3609}}}{space 1}
{space 0}{space 0}{ralign 12:wa}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -13.5997}}}{space 1}
{space 0}{space 0}{ralign 12:we}{space 1}{c |}{space 1}{ralign 9:{res:{sf: -25.4135}}}{space 1}
{space 0}{space 0}{ralign 12:prin}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-.0074698}}}{space 1}
{space 0}{space 0}{ralign 12:lww1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:-30.62635}}}{space 1}
{space 0}{space 0}{ralign 12:_cons}{space 1}{c |}{space 1}{ralign 9:{res:{sf: 3720.484}}}{space 1}

{com}. 
. *INCISO (c)*
. 
. tobit whrs `vars', ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-4023.9196}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-4023.9196}  
Iteration 1:{space 3}log likelihood = {res: -3908.513}  
Iteration 2:{space 3}log likelihood = {res:-3891.2212}  
Iteration 3:{space 3}log likelihood = {res:-3891.1204}  
Iteration 4:{space 3}log likelihood = {res:-3891.1202}  
{res}
{txt}{col 1}Tobit regression{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 53}{ralign 17:Uncensored}{col 70} = {res}{ralign 6:428}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 53}{ralign 17:Left-censored}{col 70} = {res}{ralign 6:325}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 53}{ralign 17:   Right-censored}{col 70} = {res}{ralign 6:0}

{txt}{col 53}{lalign 17:LR chi2({res:6})}{col 70} = {res}{ralign 6:127.54}
{txt}{col 53}{lalign 17:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-3891.1202}{txt}{col 53}{lalign 17:Pseudo R2}{col 70} = {res}{ralign 6:0.0161}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-1045.188{col 26}{space 2} 125.0131{col 37}{space 1}   -8.36{col 46}{space 3}0.000{col 54}{space 4}-1290.606{col 67}{space 3}-799.7688
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-100.3541{col 26}{space 2} 42.28567{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4} -183.367{col 67}{space 3}-17.34117
{txt}{space 10}wa {c |}{col 14}{res}{space 2} -36.5092{col 26}{space 2} 7.640147{col 37}{space 1}   -4.78{col 46}{space 3}0.000{col 54}{space 4}-51.50792{col 67}{space 3}-21.51049
{txt}{space 10}we {c |}{col 14}{res}{space 2} 104.9165{col 26}{space 2} 25.74198{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} 54.38121{col 67}{space 3} 155.4517
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0222349{col 26}{space 2} .0048942{col 37}{space 1}   -4.54{col 46}{space 3}0.000{col 54}{space 4}-.0318429{col 67}{space 3} -.012627
{txt}{space 8}lww1 {c |}{col 14}{res}{space 2} 199.3924{col 26}{space 2} 88.75162{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} 25.16015{col 67}{space 3} 373.6247
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1172.019{col 26}{space 2} 477.9667{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4} 233.7009{col 67}{space 3} 2110.336
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}var(e.whrs){c |}{col 14}{res}{space 2}  1584438{col 26}{space 2} 118914.7{col 54}{space 4}  1367375{col 67}{space 3}  1835959
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict whrs_tobit1, xb
{txt}
{com}. estimates store est_tobit_whrs1
{txt}
{com}. 
. *INCISO (d)*
. 
. local p=428/753
{txt}
{com}. local z=invnormal(`p')
{txt}
{com}. local fz=normalden(`z')
{txt}
{com}. display as text "p: " as result `p'
{res}{txt}p: {res}.56839309
{txt}
{com}. display as text "z: " as result `z'
{res}{txt}z: {res}.17228457
{txt}
{com}. display as text "fz: " as result `fz'
{res}{txt}fz: {res}.3930653
{txt}
{com}. 
. local beta=_b[lww1]
{txt}
{com}. local A=1-`z'*`fz'/`p'-(`fz'/`p')^2
{txt}
{com}. 
. summarize whrs_tobit if (lfp==1)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}whrs_tobit1 {c |}{res}        428    501.9721    530.9872   -1542.31     2006.2
{txt}
{com}. local EH=r(mean)
{txt}
{com}. local sigma=e(b)[1,8]^(1/2)
{txt}
{com}. 
. margins, dydx(lww1)
{res}
{txt}{col 1}Average marginal effects{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:753}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Linear prediction, predict()}{p_end}
{p2col:dy/dx wrt:}{res:lww1}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}lww1 {c |}{col 14}{res}{space 2} 199.3924{col 26}{space 2} 88.75162{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} 25.16015{col 67}{space 3} 373.6247
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. display as text "Del cambio total en las horas trabajadas debido a un cambio de $1 en el salario, la cantidad que resulta de los cambios en las horas trabajadas de aquellos que ya están trabajando es " as result `p'*`beta'*`A'
{res}{txt}Del cambio total en las horas trabajadas debido a un cambio de $1 en el salario, la cantidad que resulta de los cambios en las horas trabajadas de aquellos que ya están trabajando es {res}45.631857
{txt}
{com}. display as text "Del cambio total en las horas trabajadas debido a un cambio de $1 en el salario, la cantidad que proviene de los nuevos ingresantes a la fuerza laboral es " as result `EH'*`fz'*`beta'/`sigma'
{res}{txt}Del cambio total en las horas trabajadas debido a un cambio de $1 en el salario, la cantidad que proviene de los nuevos ingresantes a la fuerza laboral es {res}31.254698
{txt}
{com}. display as text "La proporción del efecto total sobre las horas trabajadas de un cambio en cualquiera de las variables que se deriva de aquellas mujeres que ya están trabajando es " as result `A'
{res}{txt}La proporción del efecto total sobre las horas trabajadas de un cambio en cualquiera de las variables que se deriva de aquellas mujeres que ya están trabajando es {res}.4026342
{txt}
{com}. 
. *INCISO (e)*
. 
. tobit whrs `vars' if (lfp==1), ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res: -3440.103}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -3440.103}  
Iteration 1:{space 3}log likelihood = {res: -3440.103}  
{res}
{txt}{col 1}Tobit regression{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:428}
{txt}{col 53}{ralign 17:Uncensored}{col 70} = {res}{ralign 6:428}
{txt}{col 1}Limits: Lower = {ralign 4:{res:0}}{col 53}{ralign 17:Left-censored}{col 70} = {res}{ralign 6:0}
{txt}{col 1}        Upper = {ralign 4:{txt:+inf}}{col 53}{ralign 17:   Right-censored}{col 70} = {res}{ralign 6:0}

{txt}{col 53}{lalign 17:LR chi2({res:6})}{col 70} = {res}{ralign 6:29.66}
{txt}{col 53}{lalign 17:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-3440.103}{txt}{col 53}{lalign 17:Pseudo R2}{col 70} = {res}{ralign 6:0.0043}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-342.5048{col 26}{space 2} 99.18476{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-537.4625{col 67}{space 3}-147.5471
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-115.0205{col 26}{space 2} 30.57611{col 37}{space 1}   -3.76{col 46}{space 3}0.000{col 54}{space 4}-175.1209{col 67}{space 3}-54.92008
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-7.729976{col 26}{space 2} 5.484046{col 37}{space 1}   -1.41{col 46}{space 3}0.159{col 54}{space 4}-18.50942{col 67}{space 3} 3.049472
{txt}{space 10}we {c |}{col 14}{res}{space 2}-14.44486{col 26}{space 2} 17.82039{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4}-49.47264{col 67}{space 3} 20.58292
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0042458{col 26}{space 2} .0036258{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-.0113727{col 67}{space 3} .0028811
{txt}{space 8}lww1 {c |}{col 14}{res}{space 2}-17.40781{col 26}{space 2} 53.77026{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-123.0987{col 67}{space 3}  88.2831
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2114.697{col 26}{space 2} 337.3377{col 37}{space 1}    6.27{col 46}{space 3}0.000{col 54}{space 4} 1451.626{col 67}{space 3} 2777.769
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}var(e.whrs){c |}{col 14}{res}{space 2} 560940.7{col 26}{space 2} 38345.12{col 54}{space 4} 490413.8{col 67}{space 3} 641610.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict whrs_tobit2, xb
{txt}
{com}. estimates store est_tobit_whrs2
{txt}
{com}. 
. esttab est_ols_whrs est_tobit_whrs2, se star(* 0.10 ** 0.05 *** 0.01) r2 pr2 mtitles("OLS Condicional" "Tobit Condicional")
{res}
{txt}{hline 44}
{txt}                      (1)             (2)   
{txt}             OLS Condic~l    Tobit Cond~l   
{txt}{hline 44}
{res}main                                        {txt}
{txt}kl6         {res}       -342.5***       -342.5***{txt}
            {res} {ralign 12:{txt:(}131.8{txt:)}}    {ralign 12:{txt:(}99.18{txt:)}}   {txt}

{txt}k618        {res}       -115.0***       -115.0***{txt}
            {res} {ralign 12:{txt:(}29.51{txt:)}}    {ralign 12:{txt:(}30.58{txt:)}}   {txt}

{txt}wa          {res}       -7.730          -7.730   {txt}
            {res} {ralign 12:{txt:(}5.850{txt:)}}    {ralign 12:{txt:(}5.484{txt:)}}   {txt}

{txt}we          {res}       -14.44          -14.44   {txt}
            {res} {ralign 12:{txt:(}18.21{txt:)}}    {ralign 12:{txt:(}17.82{txt:)}}   {txt}

{txt}prin        {res}     -0.00425        -0.00425   {txt}
            {res} {ralign 12:{txt:(}0.00322{txt:)}}    {ralign 12:{txt:(}0.00363{txt:)}}   {txt}

{txt}lww1        {res}       -17.41          -17.41   {txt}
            {res} {ralign 12:{txt:(}81.38{txt:)}}    {ralign 12:{txt:(}53.77{txt:)}}   {txt}

{txt}_cons       {res}       2114.7***       2114.7***{txt}
            {res} {ralign 12:{txt:(}350.3{txt:)}}    {ralign 12:{txt:(}337.3{txt:)}}   {txt}
{hline 44}
{res}/                                           {txt}
{txt}var(e.whrs) {res}                     560940.7***{txt}
            {res}                 {ralign 12:{txt:(}38345.1{txt:)}}   {txt}
{txt}{hline 44}
{txt}N           {res}          428             428   {txt}
{txt}R-sq        {res}        0.067                   {txt}
{txt}pseudo R-sq {res}                        0.004   {txt}
{txt}{hline 44}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 5 *
. ********************************************************************************
. 
. 
. local vars="wa wa2 we cit ax"
{txt}
{com}. 
. *INCISO (a)*
. 
. regress lww1 `vars' if (lfp==1)

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       428
{txt}{hline 13}{c +}{hline 34}   F(5, 422)       = {res}    15.36
{txt}       Model {c |} {res} 34.3816151         5  6.87632302   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 188.945826       422  .447738924   {txt}R-squared       ={res}    0.1540
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1439
{txt}       Total {c |} {res} 223.327441       427  .523015084   {txt}Root MSE        =   {res} .66913

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lww1{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}wa {c |}{col 14}{res}{space 2} .0605336{col 26}{space 2} .0461306{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0301408{col 67}{space 3}  .151208
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0007322{col 26}{space 2} .0005379{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-.0017894{col 67}{space 3} .0003251
{txt}{space 10}we {c |}{col 14}{res}{space 2} .1074434{col 26}{space 2} .0143904{col 37}{space 1}    7.47{col 46}{space 3}0.000{col 54}{space 4} .0791577{col 67}{space 3} .1357291
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0615677{col 26}{space 2} .0687288{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.0735258{col 67}{space 3} .1966612
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .0171097{col 26}{space 2}  .004619{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0080306{col 67}{space 3} .0261889
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.639786{col 26}{space 2} .9901658{col 37}{space 1}   -1.66{col 46}{space 3}0.098{col 54}{space 4}-3.586057{col 67}{space 3} .3064851
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_ols, xb
{txt}
{com}. matrix define betas_ols_lww=e(b)'
{txt}
{com}. matrix list betas_ols_lww
{res}
{txt}betas_ols_lww[6,1]
               y1
   wa {res}  .06053362
{txt}  wa2 {res} -.00073216
{txt}   we {res}  .10744336
{txt}  cit {res}   .0615677
{txt}   ax {res}  .01710972
{txt}_cons {res}  -1.639786
{reset}
{com}. 
. *INCISO (c)*
. 
. matrix define   parametros_a = J(10,2,.)
{txt}
{com}. matrix rownames parametros_a = "d" "a0" "a1" "a2" "a3" "a4" "a5" "a6" "a7" "a8"
{txt}
{com}. matrix colnames parametros_a = "Indirecto" "Directo"
{txt}
{com}. 
. regress whrs `vars' kl6 k618 prin un

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(9, 743)       = {res}    29.92
{txt}       Model {c |} {res}  151856776         9  16872975.1   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  419052948       743  564001.276   {txt}R-squared       ={res}    0.2660
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2571
{txt}       Total {c |} {res}  570909724       752  759188.463   {txt}Root MSE        =   {res}    751

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}wa {c |}{col 14}{res}{space 2}   37.626{col 26}{space 2} 39.75193{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}-40.41347{col 67}{space 3} 115.6655
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.8044637{col 26}{space 2} .4577222{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-1.703046{col 67}{space 3}  .094119
{txt}{space 10}we {c |}{col 14}{res}{space 2} 32.11558{col 26}{space 2} 13.03226{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 6.531139{col 67}{space 3} 57.70002
{txt}{space 9}cit {c |}{col 14}{res}{space 2} -4.59315{col 26}{space 2} 60.20587{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4} -122.787{col 67}{space 3} 113.6007
{txt}{space 10}ax {c |}{col 14}{res}{space 2} 45.57878{col 26}{space 2} 3.807918{col 37}{space 1}   11.97{col 46}{space 3}0.000{col 54}{space 4} 38.10322{col 67}{space 3} 53.05434
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-430.3417{col 26}{space 2} 59.96781{col 37}{space 1}   -7.18{col 46}{space 3}0.000{col 54}{space 4}-548.0682{col 67}{space 3}-312.6151
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-42.28552{col 26}{space 2} 24.01164{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-89.42426{col 67}{space 3} 4.853222
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0035449{col 26}{space 2} .0026007{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-.0086505{col 67}{space 3} .0015607
{txt}{space 10}un {c |}{col 14}{res}{space 2} -12.3488{col 26}{space 2} 8.992357{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-30.00225{col 67}{space 3} 5.304653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 109.2346{col 26}{space 2} 853.3578{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-1566.045{col 67}{space 3} 1784.514
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix define betas_ols_whrs=e(b)'
{txt}
{com}. 
. matrix parametros_a [1,1]=betas_ols_whrs[5,1]/betas_ols_lww[5,1]                                                /*d*/
{txt}
{com}. matrix parametros_a [2,1]=betas_ols_lww[6,1]-betas_ols_whrs[10,1]/parametros_a[1,1]             /*a0*/
{txt}
{com}. matrix parametros_a [3,1]=betas_ols_lww[1,1]-betas_ols_whrs[1,1]/parametros_a[1,1]              /*a1*/
{txt}
{com}. matrix parametros_a [4,1]=betas_ols_lww[2,1]-betas_ols_whrs[2,1]/parametros_a[1,1]              /*a2*/
{txt}
{com}. matrix parametros_a [5,1]=betas_ols_lww[3,1]-betas_ols_whrs[3,1]/parametros_a[1,1]              /*a3*/
{txt}
{com}. matrix parametros_a [6,1]=betas_ols_lww[4,1]-betas_ols_whrs[4,1]/parametros_a[1,1]              /*a4*/
{txt}
{com}. matrix parametros_a [7,1]=-betas_ols_whrs[6,1]/parametros_a[1,1]                                                /*a5*/
{txt}
{com}. matrix parametros_a [8,1]=-betas_ols_whrs[7,1]/parametros_a[1,1]                                                /*a6*/
{txt}
{com}. matrix parametros_a [9,1]=-betas_ols_whrs[8,1]/parametros_a[1,1]                                                /*a7*/
{txt}
{com}. matrix parametros_a [10,1]=-betas_ols_whrs[9,1]/parametros_a[1,1]                                               /*a8*/
{txt}
{com}. 
. generate wa_t=wa*betas_ols_lww[1,1]
{txt}
{com}. generate wa2_t=wa2*betas_ols_lww[2,1]
{txt}
{com}. generate we_t=we*betas_ols_lww[3,1]
{txt}
{com}. generate cit_t=cit*betas_ols_lww[4,1]
{txt}
{com}. generate ax_t=ax*betas_ols_lww[5,1]
{txt}
{com}. 
. regress whrs wa_t wa2_t we_t cit_t ax_t kl6 k618 prin un

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(9, 743)       = {res}    29.92
{txt}       Model {c |} {res}  151856775         9    16872975   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  419052949       743  564001.278   {txt}R-squared       ={res}    0.2660
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2571
{txt}       Total {c |} {res}  570909724       752  759188.463   {txt}Root MSE        =   {res}    751

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}wa_t {c |}{col 14}{res}{space 2} 621.5713{col 26}{space 2} 656.6917{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}-667.6208{col 67}{space 3} 1910.763
{txt}{space 7}wa2_t {c |}{col 14}{res}{space 2} 1098.757{col 26}{space 2} 625.1685{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-128.5505{col 67}{space 3} 2326.064
{txt}{space 8}we_t {c |}{col 14}{res}{space 2} 298.9071{col 26}{space 2} 121.2942{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 60.78682{col 67}{space 3} 537.0273
{txt}{space 7}cit_t {c |}{col 14}{res}{space 2}-74.60328{col 26}{space 2} 977.8808{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-1994.342{col 67}{space 3} 1845.135
{txt}{space 8}ax_t {c |}{col 14}{res}{space 2} 2663.912{col 26}{space 2} 222.5588{col 37}{space 1}   11.97{col 46}{space 3}0.000{col 54}{space 4} 2226.993{col 67}{space 3} 3100.831
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-430.3417{col 26}{space 2} 59.96781{col 37}{space 1}   -7.18{col 46}{space 3}0.000{col 54}{space 4}-548.0682{col 67}{space 3}-312.6152
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-42.28551{col 26}{space 2} 24.01164{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-89.42425{col 67}{space 3} 4.853225
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0035449{col 26}{space 2} .0026007{col 37}{space 1}   -1.36{col 46}{space 3}0.173{col 54}{space 4}-.0086505{col 67}{space 3} .0015607
{txt}{space 10}un {c |}{col 14}{res}{space 2} -12.3488{col 26}{space 2} 8.992357{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-30.00225{col 67}{space 3} 5.304653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 109.2354{col 26}{space 2} 853.3577{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-1566.044{col 67}{space 3} 1784.515
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. matrix define betas_ols_whrs_t=e(b)'
{txt}
{com}. 
. matrix parametros_a [1,2]=betas_ols_whrs_t[5,1]/betas_ols_lww[5,1]                                              /*d*/
{txt}
{com}. matrix parametros_a [2,2]=betas_ols_lww[6,1]-betas_ols_whrs_t[10,1]/parametros_a[1,2]   /*a0*/
{txt}
{com}. matrix parametros_a [3,2]=betas_ols_lww[1,1]-betas_ols_whrs_t[1,1]/parametros_a[1,2]    /*a1*/
{txt}
{com}. matrix parametros_a [4,2]=betas_ols_lww[2,1]-betas_ols_whrs_t[2,1]/parametros_a[1,2]    /*a2*/
{txt}
{com}. matrix parametros_a [5,2]=betas_ols_lww[3,1]-betas_ols_whrs_t[3,1]/parametros_a[1,2]    /*a3*/
{txt}
{com}. matrix parametros_a [6,2]=betas_ols_lww[4,1]-betas_ols_whrs_t[4,1]/parametros_a[1,2]    /*a4*/
{txt}
{com}. matrix parametros_a [7,2]=-betas_ols_whrs_t[6,1]/parametros_a[1,2]                                              /*a5*/
{txt}
{com}. matrix parametros_a [8,2]=-betas_ols_whrs_t[7,1]/parametros_a[1,2]                                              /*a6*/
{txt}
{com}. matrix parametros_a [9,2]=-betas_ols_whrs_t[8,1]/parametros_a[1,2]                                              /*a7*/
{txt}
{com}. matrix parametros_a [10,2]=-betas_ols_whrs_t[9,1]/parametros_a[1,2]                                             /*a8*/
{txt}
{com}. 
. matrix list parametros_a
{res}
{txt}parametros_a[10,2]
     Indirecto     Directo
 d {res}  2663.9123   155695.88
{txt}a0 {res} -1.6807913  -1.6404876
{txt}a1 {res}  .04640928    .0565414
{txt}a2 {res} -.00043017  -.00778923
{txt}a3 {res}  .09538757   .10552355
{txt}a4 {res}  .06329191   .06204686
{txt}a5 {res}  .16154499   .00276399
{txt}a6 {res}  .01587346   .00027159
{txt}a7 {res}  1.331e-06   2.277e-08
{txt}a8 {res}  .00463559   .00007931
{reset}
{com}. 
. *INCISO (d)*
. 
. matrix define   parametros_b = J(9,1,.)
{txt}
{com}. matrix rownames parametros_b = "d" "b0" "b1" "b2" "b3" "b4" "b5" "b6" "b7"
{txt}
{com}. matrix colnames parametros_b = "Indirecto"
{txt}
{com}. 
. matrix parametros_b [1,1]=betas_ols_whrs[5,1]/betas_ols_lww[5,1]                                                /*d*/
{txt}
{com}. matrix parametros_b [2,1]=betas_ols_lww[6,1]-betas_ols_whrs[10,1]/parametros_b[1,1]             /*b0*/
{txt}
{com}. matrix parametros_b [3,1]=betas_ols_lww[1,1]-betas_ols_whrs[1,1]/parametros_b[1,1]              /*b1*/
{txt}
{com}. matrix parametros_b [4,1]=betas_ols_lww[2,1]-betas_ols_whrs[2,1]/parametros_b[1,1]              /*b2*/
{txt}
{com}. matrix parametros_b [5,1]=betas_ols_lww[3,1]-betas_ols_whrs[3,1]/parametros_b[1,1]              /*b3*/
{txt}
{com}. matrix parametros_b [6,1]=-betas_ols_whrs[6,1]/parametros_b[1,1]                                                /*b4*/
{txt}
{com}. matrix parametros_b [7,1]=-betas_ols_whrs[7,1]/parametros_b[1,1]                                                /*b5*/
{txt}
{com}. matrix parametros_b [8,1]=-betas_ols_whrs[8,1]/parametros_b[1,1]                                                /*b6*/
{txt}
{com}. matrix parametros_b [9,1]=-betas_ols_whrs[9,1]/parametros_b[1,1]                                                /*b7*/
{txt}
{com}. 
. matrix list parametros_b
{res}
{txt}parametros_b[9,1]
     Indirecto
 d {res}  2663.9123
{txt}b0 {res} -1.6807913
{txt}b1 {res}  .04640928
{txt}b2 {res} -.00043017
{txt}b3 {res}  .09538757
{txt}b4 {res}  .16154499
{txt}b5 {res}  .01587346
{txt}b6 {res}  1.331e-06
{txt}b7 {res}  .00463559
{reset}
{com}. 
. *INCISO (e)*
. 
. 
. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 6 *
. ********************************************************************************
. 
. 
. local varsA="kl6 k618 wa we wa2 we2 wawe wa3 we3 wa2we wawe2 wfed wmed un cit prin"
{txt}
{com}. local varsB="kl6 k618 wa we prin"
{txt}
{com}. 
. *INCISO (a)*
. 
. *generate ax2=ax*ax
. *generate wa2=wa*wa
. generate we2=we*we
{txt}
{com}. generate wa3=wa2*wa
{txt}
{com}. generate we3=we2*we
{txt}
{com}. generate wawe=wa*we
{txt}
{com}. generate wa2we=wa2*we
{txt}
{com}. generate wawe2=wa*we2
{txt}
{com}. 
. probit lfp `varsA'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res: -450.8853}  
Iteration 2:{space 3}log likelihood = {res: -450.4777}  
Iteration 3:{space 3}log likelihood = {res:-450.47746}  
Iteration 4:{space 3}log likelihood = {res:-450.47746}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:16})}{col 70} = {res}{ralign 6:128.79}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-450.47746}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1251}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.8579509{col 26}{space 2} .1188431{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 54}{space 4}-1.090879{col 67}{space 3}-.6250226
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0603097{col 26}{space 2} .0439087{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-.1463692{col 67}{space 3} .0257497
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .7521026{col 26}{space 2}   .76984{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.7567562{col 67}{space 3} 2.260961
{txt}{space 10}we {c |}{col 14}{res}{space 2}  1.09907{col 26}{space 2} 1.922726{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-2.669404{col 67}{space 3} 4.867544
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0151855{col 26}{space 2} .0145537{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-.0437101{col 67}{space 3} .0133392
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0636591{col 26}{space 2} .1056755{col 37}{space 1}   -0.60{col 46}{space 3}0.547{col 54}{space 4}-.2707794{col 67}{space 3} .1434611
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0154558{col 26}{space 2} .0446633{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.1029943{col 67}{space 3} .0720827
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2}  .000107{col 26}{space 2} .0001011{col 37}{space 1}    1.06{col 46}{space 3}0.290{col 54}{space 4}-.0000911{col 67}{space 3} .0003051
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0012697{col 26}{space 2} .0023487{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.0033336{col 67}{space 3}  .005873
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}-2.10e-06{col 26}{space 2} .0003764{col 37}{space 1}   -0.01{col 46}{space 3}0.996{col 54}{space 4}-.0007399{col 67}{space 3} .0007357
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2} .0006687{col 26}{space 2} .0008759{col 37}{space 1}    0.76{col 46}{space 3}0.445{col 54}{space 4}-.0010481{col 67}{space 3} .0023855
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0125127{col 26}{space 2}  .017534{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4}-.0468787{col 67}{space 3} .0218532
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0026455{col 26}{space 2}  .018479{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.0335726{col 67}{space 3} .0388636
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0102966{col 26}{space 2} .0161046{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4} -.041861{col 67}{space 3} .0212678
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0414417{col 26}{space 2}   .10854{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-.1712928{col 67}{space 3} .2541763
{txt}{space 8}prin {c |}{col 14}{res}{space 2} -.000022{col 26}{space 2} 4.77e-06{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.0000313{col 67}{space 3}-.0000127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-14.06639{col 26}{space 2} 15.98708{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4} -45.4005{col 67}{space 3} 17.26772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict lfp_probit1, xb
{txt}
{com}. generate invr1=normalden(lfp_probit1)/(1-normal(lfp_probit1))
{txt}
{com}. 
. probit lfp `varsA' ax ax2

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res: -399.2231}  
Iteration 2:{space 3}log likelihood = {res:-398.23139}  
Iteration 3:{space 3}log likelihood = {res:-398.23069}  
Iteration 4:{space 3}log likelihood = {res:-398.23069}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:18})}{col 70} = {res}{ralign 6:233.29}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-398.23069}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2265}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.8504688{col 26}{space 2} .1233302{col 37}{space 1}   -6.90{col 46}{space 3}0.000{col 54}{space 4}-1.092192{col 67}{space 3} -.608746
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} .0236102{col 26}{space 2} .0474965{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-.0694813{col 67}{space 3} .1167017
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .4938567{col 26}{space 2} .8053263{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-1.084554{col 67}{space 3} 2.072267
{txt}{space 10}we {c |}{col 14}{res}{space 2} .9622103{col 26}{space 2} 2.002132{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-2.961897{col 67}{space 3} 4.886317
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0115551{col 26}{space 2} .0154034{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.0417453{col 67}{space 3}  .018635
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0723266{col 26}{space 2}  .111544{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4}-.2909488{col 67}{space 3} .1462956
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0055927{col 26}{space 2}  .046395{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4}-.0965252{col 67}{space 3} .0853398
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000949{col 26}{space 2}  .000108{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.0001167{col 67}{space 3} .0003066
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0015105{col 26}{space 2} .0024888{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.0033676{col 67}{space 3} .0063885
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}  -.00012{col 26}{space 2} .0003973{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-.0008988{col 67}{space 3} .0006587
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}  .000672{col 26}{space 2} .0009136{col 37}{space 1}    0.74{col 46}{space 3}0.462{col 54}{space 4}-.0011187{col 67}{space 3} .0024626
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0042132{col 26}{space 2} .0184251{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-.0403257{col 67}{space 3} .0318993
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0103231{col 26}{space 2} .0193464{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-.0275951{col 67}{space 3} .0482413
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0149435{col 26}{space 2}  .017083{col 37}{space 1}   -0.87{col 46}{space 3}0.382{col 54}{space 4}-.0484256{col 67}{space 3} .0185386
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0231706{col 26}{space 2} .1152617{col 37}{space 1}    0.20{col 46}{space 3}0.841{col 54}{space 4}-.2027382{col 67}{space 3} .2490795
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000129{col 26}{space 2} 5.03e-06{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0000228{col 67}{space 3}-3.08e-06
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .1241355{col 26}{space 2} .0193738{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .0861635{col 67}{space 3} .1621075
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0019205{col 26}{space 2} .0006282{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.0031518{col 67}{space 3}-.0006892
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-10.12486{col 26}{space 2} 16.53431{col 37}{space 1}   -0.61{col 46}{space 3}0.540{col 54}{space 4}-42.53151{col 67}{space 3} 22.28179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict lfp_probit2, xb
{txt}
{com}. generate invr2=normalden(lfp_probit2)/(1-normal(lfp_probit2))
{txt}
{com}. 
. *INCISO (b)*
. 
. regress lww `varsA' if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(16, 411)        =  {res}     8.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1772
                                                {txt}Root MSE          =    {res} .66863

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.1266363{col 26}{space 2} .1119148{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-.3466331{col 67}{space 3} .0933605
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0464093{col 26}{space 2} .0302085{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-.1057917{col 67}{space 3}  .012973
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .1113025{col 26}{space 2} .4408207{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4} -.755242{col 67}{space 3} .9778469
{txt}{space 10}we {c |}{col 14}{res}{space 2}-.8514843{col 26}{space 2} 1.147582{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-3.107346{col 67}{space 3} 1.404378
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0060282{col 26}{space 2} .0093899{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-.0244865{col 67}{space 3} .0124301
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0119921{col 26}{space 2} .0675097{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.1207153{col 67}{space 3} .1446994
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0301834{col 26}{space 2} .0240799{col 37}{space 1}    1.25{col 46}{space 3}0.211{col 54}{space 4}-.0171519{col 67}{space 3} .0775186
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000348{col 26}{space 2} .0000707{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4}-.0001042{col 67}{space 3} .0001738
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0017814{col 26}{space 2} .0015375{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0012409{col 67}{space 3} .0048038
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000746{col 26}{space 2} .0002031{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.0003247{col 67}{space 3} .0004738
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0015388{col 26}{space 2} .0005256{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-.0025719{col 67}{space 3}-.0005057
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0168407{col 26}{space 2}  .011106{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-.0386724{col 67}{space 3} .0049909
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0090201{col 26}{space 2} .0124633{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}  -.03352{col 67}{space 3} .0154797
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0015374{col 26}{space 2} .0095299{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.0202708{col 67}{space 3}  .017196
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0789842{col 26}{space 2} .0680702{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0548249{col 67}{space 3} .2127933
{txt}{space 8}prin {c |}{col 14}{res}{space 2} 1.86e-06{col 26}{space 2} 2.88e-06{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-3.79e-06{col 67}{space 3} 7.52e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.668241{col 26}{space 2} 8.681064{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-14.39658{col 67}{space 3} 19.73307
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat1, xb
{txt}
{com}. regress lww `varsA' ax ax2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(18, 409)        =  {res}     8.10
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2100
                                                {txt}Root MSE          =    {res} .65679

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.1055143{col 26}{space 2} .1061322{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.3141469{col 67}{space 3} .1031183
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0171133{col 26}{space 2} .0314647{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4} -.078966{col 67}{space 3} .0447395
{txt}{space 10}wa {c |}{col 14}{res}{space 2}  .021614{col 26}{space 2}  .428565{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4} -.820851{col 67}{space 3}  .864079
{txt}{space 10}we {c |}{col 14}{res}{space 2}-.9660166{col 26}{space 2} 1.109505{col 37}{space 1}   -0.87{col 46}{space 3}0.384{col 54}{space 4}-3.147061{col 67}{space 3} 1.215028
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0047736{col 26}{space 2} .0092678{col 37}{space 1}   -0.52{col 46}{space 3}0.607{col 54}{space 4}-.0229921{col 67}{space 3} .0134449
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0141661{col 26}{space 2} .0666777{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.1169076{col 67}{space 3} .1452399
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0332155{col 26}{space 2} .0228326{col 37}{space 1}    1.45{col 46}{space 3}0.147{col 54}{space 4}-.0116684{col 67}{space 3} .0780994
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000274{col 26}{space 2} .0000702{col 37}{space 1}    0.39{col 46}{space 3}0.696{col 54}{space 4}-.0001106{col 67}{space 3} .0001655
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0018592{col 26}{space 2} .0015278{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4}-.0011441{col 67}{space 3} .0048625
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000709{col 26}{space 2} .0001932{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.0003089{col 67}{space 3} .0004506
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0016391{col 26}{space 2} .0005077{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0026371{col 67}{space 3} -.000641
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0129667{col 26}{space 2} .0108686{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0343321{col 67}{space 3} .0083986
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0104555{col 26}{space 2} .0121778{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-.0343944{col 67}{space 3} .0134834
{txt}{space 10}un {c |}{col 14}{res}{space 2} -.002731{col 26}{space 2} .0093985{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-.0212064{col 67}{space 3} .0157445
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0698902{col 26}{space 2} .0682422{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 54}{space 4}-.0642589{col 67}{space 3} .2040394
{txt}{space 8}prin {c |}{col 14}{res}{space 2} 4.61e-06{col 26}{space 2} 2.92e-06{col 37}{space 1}    1.58{col 46}{space 3}0.116{col 54}{space 4}-1.14e-06{col 67}{space 3} .0000104
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .0398315{col 26}{space 2} .0163393{col 37}{space 1}    2.44{col 46}{space 3}0.015{col 54}{space 4} .0077121{col 67}{space 3} .0719509
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0007028{col 26}{space 2} .0004542{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.0015957{col 67}{space 3} .0001901
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.379425{col 26}{space 2} 8.295024{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-11.92678{col 67}{space 3} 20.68563
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat2, xb
{txt}
{com}. 
. regress lww `varsA' invr1 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(17, 410)        =  {res}     8.52
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1787
                                                {txt}Root MSE          =    {res} .66886

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} .3671854{col 26}{space 2} .5145311{col 37}{space 1}    0.71{col 46}{space 3}0.476{col 54}{space 4}-.6442628{col 67}{space 3} 1.378634
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0125544{col 26}{space 2}  .045542{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4}-.1020794{col 67}{space 3} .0769705
{txt}{space 10}wa {c |}{col 14}{res}{space 2} -.306002{col 26}{space 2} .6007274{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-1.486892{col 67}{space 3}  .874888
{txt}{space 10}we {c |}{col 14}{res}{space 2} -1.52232{col 26}{space 2}  1.36434{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 54}{space 4}-4.204294{col 67}{space 3} 1.159654
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2} .0025341{col 26}{space 2} .0124389{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4} -.021918{col 67}{space 3} .0269861
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0547208{col 26}{space 2} .0819805{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 54}{space 4}-.1064338{col 67}{space 3} .2158753
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0380183{col 26}{space 2} .0256188{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0123423{col 67}{space 3} .0883789
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2}-.0000279{col 26}{space 2} .0000922{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-.0002091{col 67}{space 3} .0001534
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0008792{col 26}{space 2} .0018235{col 37}{space 1}    0.48{col 46}{space 3}0.630{col 54}{space 4}-.0027055{col 67}{space 3} .0044638
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000991{col 26}{space 2} .0002036{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.0003011{col 67}{space 3} .0004993
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0019567{col 26}{space 2} .0006902{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.0033135{col 67}{space 3}-.0005998
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0094517{col 26}{space 2} .0125412{col 37}{space 1}   -0.75{col 46}{space 3}0.451{col 54}{space 4}-.0341047{col 67}{space 3} .0152013
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0096553{col 26}{space 2}  .012468{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}-.0341645{col 67}{space 3}  .014854
{txt}{space 10}un {c |}{col 14}{res}{space 2} .0043358{col 26}{space 2} .0113179{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4}-.0179125{col 67}{space 3} .0265841
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0537633{col 26}{space 2} .0692056{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4}-.0822787{col 67}{space 3} .1898054
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0000146{col 26}{space 2} .0000126{col 37}{space 1}    1.16{col 46}{space 3}0.246{col 54}{space 4}-.0000101{col 67}{space 3} .0000394
{txt}{space 7}invr1 {c |}{col 14}{res}{space 2} .8599341{col 26}{space 2} .8561958{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.8231473{col 67}{space 3} 2.543015
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 9.916658{col 26}{space 2} 11.44322{col 37}{space 1}    0.87{col 46}{space 3}0.387{col 54}{space 4}-12.57804{col 67}{space 3} 32.41135
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat3, xb
{txt}
{com}. regress lww `varsA' ax ax2 invr2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(19, 408)        =  {res}     8.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2112
                                                {txt}Root MSE          =    {res}  .6571

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} .1576996{col 26}{space 2} .5160366{col 37}{space 1}    0.31{col 46}{space 3}0.760{col 54}{space 4}-.8567227{col 67}{space 3} 1.172122
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0245922{col 26}{space 2} .0341721{col 37}{space 1}   -0.72{col 46}{space 3}0.472{col 54}{space 4}-.0917676{col 67}{space 3} .0425831
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.1272606{col 26}{space 2} .4629312{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-1.037289{col 67}{space 3} .7827674
{txt}{space 10}we {c |}{col 14}{res}{space 2}-1.271284{col 26}{space 2} 1.245965{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-3.720596{col 67}{space 3} 1.178028
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0011548{col 26}{space 2} .0100698{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}  -.02095{col 67}{space 3} .0186404
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0391827{col 26}{space 2} .0794751{col 37}{space 1}    0.49{col 46}{space 3}0.622{col 54}{space 4} -.117049{col 67}{space 3} .1954145
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0341165{col 26}{space 2} .0229362{col 37}{space 1}    1.49{col 46}{space 3}0.138{col 54}{space 4}-.0109714{col 67}{space 3} .0792044
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2}-3.37e-06{col 26}{space 2} .0000784{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 54}{space 4}-.0001575{col 67}{space 3} .0001507
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0013101{col 26}{space 2} .0017714{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-.0021721{col 67}{space 3} .0047923
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0001192{col 26}{space 2}  .000208{col 37}{space 1}    0.57{col 46}{space 3}0.567{col 54}{space 4}-.0002898{col 67}{space 3} .0005281
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0018528{col 26}{space 2} .0006669{col 37}{space 1}   -2.78{col 46}{space 3}0.006{col 54}{space 4}-.0031638{col 67}{space 3}-.0005417
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0116572{col 26}{space 2} .0112614{col 37}{space 1}   -1.04{col 46}{space 3}0.301{col 54}{space 4}-.0337948{col 67}{space 3} .0104804
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} -.013424{col 26}{space 2} .0130021{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-.0389835{col 67}{space 3} .0121356
{txt}{space 10}un {c |}{col 14}{res}{space 2} .0021935{col 26}{space 2} .0137871{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-.0249092{col 67}{space 3} .0292962
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0636221{col 26}{space 2}  .068735{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-.0714968{col 67}{space 3} .1987411
{txt}{space 8}prin {c |}{col 14}{res}{space 2} 8.52e-06{col 26}{space 2} 7.59e-06{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-6.40e-06{col 67}{space 3} .0000234
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .0019818{col 26}{space 2} .0744025{col 37}{space 1}    0.03{col 46}{space 3}0.979{col 54}{space 4}-.1442783{col 67}{space 3} .1482418
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0001309{col 26}{space 2} .0012035{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.0024968{col 67}{space 3}  .002235
{txt}{space 7}invr2 {c |}{col 14}{res}{space 2} .4435288{col 26}{space 2} .8038702{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-1.136716{col 67}{space 3} 2.023773
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.073821{col 26}{space 2} 9.126592{col 37}{space 1}    0.78{col 46}{space 3}0.439{col 54}{space 4}-10.86719{col 67}{space 3} 25.01483
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat4, xb
{txt}
{com}. 
. *INCISO (c)*
. 
. regress whrs `varsB' lww_hat1 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(6, 421)         =  {res}     3.89
                                                {txt}Prob > F          = {res}    0.0008
                                                {txt}R-squared         = {res}    0.0668
                                                {txt}Root MSE          =    {res} 755.22

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-337.1825{col 26}{space 2} 132.6914{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-598.0026{col 67}{space 3}-76.36234
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-112.2935{col 26}{space 2} 30.55218{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-172.3474{col 67}{space 3}-52.23972
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-7.853428{col 26}{space 2} 5.836681{col 37}{space 1}   -1.35{col 46}{space 3}0.179{col 54}{space 4}-19.32609{col 67}{space 3} 3.619238
{txt}{space 10}we {c |}{col 14}{res}{space 2}-21.03373{col 26}{space 2} 30.50365{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-80.99215{col 67}{space 3} 38.92469
{txt}{space 8}prin {c |}{col 14}{res}{space 2} -.004448{col 26}{space 2} .0033124{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4} -.010959{col 67}{space 3} .0020629
{txt}{space 4}lww_hat1 {c |}{col 14}{res}{space 2} 45.73968{col 26}{space 2}  222.167{col 37}{space 1}    0.21{col 46}{space 3}0.837{col 54}{space 4}-390.9551{col 67}{space 3} 482.4345
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2127.531{col 26}{space 2} 355.3102{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 54}{space 4} 1429.128{col 67}{space 3} 2825.934
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress whrs `varsB' lww_hat3 invr1 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(7, 420)         =  {res}     3.59
                                                {txt}Prob > F          = {res}    0.0009
                                                {txt}R-squared         = {res}    0.0672
                                                {txt}Root MSE          =    {res} 755.94

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-248.8672{col 26}{space 2} 274.8461{col 37}{space 1}   -0.91{col 46}{space 3}0.366{col 54}{space 4}-789.1125{col 67}{space 3} 291.3781
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-109.3943{col 26}{space 2} 31.59931{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4}-171.5068{col 67}{space 3}-47.28181
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-4.466792{col 26}{space 2} 10.34004{col 37}{space 1}   -0.43{col 46}{space 3}0.666{col 54}{space 4}-24.79146{col 67}{space 3} 15.85788
{txt}{space 10}we {c |}{col 14}{res}{space 2}-37.51752{col 26}{space 2} 48.13674{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-132.1365{col 67}{space 3} 57.10142
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0022882{col 26}{space 2} .0063867{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4} -.014842{col 67}{space 3} .0102657
{txt}{space 4}lww_hat3 {c |}{col 14}{res}{space 2} 26.56777{col 26}{space 2} 228.2598{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-422.1062{col 67}{space 3} 475.2418
{txt}{space 7}invr1 {c |}{col 14}{res}{space 2} 149.9619{col 26}{space 2} 366.4688{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-570.3796{col 67}{space 3} 870.3034
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1996.001{col 26}{space 2} 494.3158{col 37}{space 1}    4.04{col 46}{space 3}0.000{col 54}{space 4}  1024.36{col 67}{space 3} 2967.642
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. regress whrs `varsB' lww_hat2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(6, 421)         =  {res}     7.45
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0976
                                                {txt}Root MSE          =    {res} 742.65

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-284.3733{col 26}{space 2} 132.6096{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-545.0326{col 67}{space 3}-23.71387
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-85.23599{col 26}{space 2} 30.13556{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-144.4709{col 67}{space 3}-26.00109
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-9.078339{col 26}{space 2} 5.708645{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-20.29934{col 67}{space 3} 2.142658
{txt}{space 10}we {c |}{col 14}{res}{space 2}-86.40976{col 26}{space 2} 25.99426{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-137.5045{col 67}{space 3}-35.31505
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0064547{col 26}{space 2} .0032506{col 37}{space 1}   -1.99{col 46}{space 3}0.048{col 54}{space 4}-.0128441{col 67}{space 3}-.0000653
{txt}{space 4}lww_hat2 {c |}{col 14}{res}{space 2} 672.3016{col 26}{space 2}  180.645{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} 317.2231{col 67}{space 3}  1027.38
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2254.871{col 26}{space 2} 347.0666{col 37}{space 1}    6.50{col 46}{space 3}0.000{col 54}{space 4} 1572.672{col 67}{space 3}  2937.07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress whrs `varsB' lww_hat4 invr2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(7, 420)         =  {res}     8.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1296
                                                {txt}Root MSE          =    {res} 730.24

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} 40.71379{col 26}{space 2} 163.0809{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-279.8426{col 67}{space 3} 361.2702
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} -92.2295{col 26}{space 2} 30.60343{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-152.3845{col 67}{space 3}-32.07453
{txt}{space 10}wa {c |}{col 14}{res}{space 2} 3.509587{col 26}{space 2} 6.458685{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-9.185788{col 67}{space 3} 16.20496
{txt}{space 10}we {c |}{col 14}{res}{space 2}  -87.186{col 26}{space 2} 25.53279{col 37}{space 1}   -3.41{col 46}{space 3}0.001{col 54}{space 4} -137.374{col 67}{space 3}-36.99802
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0038183{col 26}{space 2} .0041052{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4} -.004251{col 67}{space 3} .0118877
{txt}{space 4}lww_hat4 {c |}{col 14}{res}{space 2} 50.50553{col 26}{space 2} 210.3807{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-363.0247{col 67}{space 3} 464.0358
{txt}{space 7}invr2 {c |}{col 14}{res}{space 2} 555.0556{col 26}{space 2} 143.8739{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4}  272.253{col 67}{space 3} 837.8582
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1552.281{col 26}{space 2} 398.2029{col 37}{space 1}    3.90{col 46}{space 3}0.000{col 54}{space 4} 769.5618{col 67}{space 3}     2335
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *INCISO (e)*
. 
. regress lfp `varsA'

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(16, 736)      = {res}     8.40
{txt}       Model {c |} {res}  28.538101        16  1.78363131   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 156.189655       736  .212214205   {txt}R-squared       ={res}    0.1545
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1361
{txt}       Total {c |} {res} 184.727756       752  .245648611   {txt}Root MSE        =   {res} .46067

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.2827256{col 26}{space 2} .0370318{col 37}{space 1}   -7.63{col 46}{space 3}0.000{col 54}{space 4}-.3554261{col 67}{space 3}-.2100252
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} -.021229{col 26}{space 2}  .015245{col 37}{space 1}   -1.39{col 46}{space 3}0.164{col 54}{space 4}-.0511578{col 67}{space 3} .0086998
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .2683192{col 26}{space 2} .2575898{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4}-.2373792{col 67}{space 3} .7740175
{txt}{space 10}we {c |}{col 14}{res}{space 2} .3178399{col 26}{space 2} .6224507{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.9041507{col 67}{space 3}  1.53983
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0053161{col 26}{space 2}  .004959{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-.0150516{col 67}{space 3} .0044193
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0144755{col 26}{space 2} .0349922{col 37}{space 1}   -0.41{col 46}{space 3}0.679{col 54}{space 4}-.0831719{col 67}{space 3} .0542209
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0062206{col 26}{space 2} .0143082{col 37}{space 1}   -0.43{col 46}{space 3}0.664{col 54}{space 4}-.0343105{col 67}{space 3} .0218692
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000365{col 26}{space 2} .0000347{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 54}{space 4}-.0000317{col 67}{space 3} .0001046
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0001875{col 26}{space 2} .0007896{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4}-.0013627{col 67}{space 3} .0017377
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} 7.75e-06{col 26}{space 2} .0001221{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-.0002319{col 67}{space 3} .0002474
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2} .0002444{col 26}{space 2} .0002816{col 37}{space 1}    0.87{col 46}{space 3}0.386{col 54}{space 4}-.0003083{col 67}{space 3} .0007972
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0045744{col 26}{space 2} .0060455{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-.0164429{col 67}{space 3}  .007294
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0012567{col 26}{space 2}  .006398{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4}-.0113038{col 67}{space 3} .0138171
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0036522{col 26}{space 2} .0055681{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-.0145834{col 67}{space 3}  .007279
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0062707{col 26}{space 2} .0372976{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4}-.0669516{col 67}{space 3} .0794931
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-6.95e-06{col 26}{space 2} 1.56e-06{col 37}{space 1}   -4.45{col 46}{space 3}0.000{col 54}{space 4}  -.00001{col 67}{space 3}-3.88e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.280411{col 26}{space 2} 5.229769{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-14.54745{col 67}{space 3} 5.986631
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lfp_ols1, xb
{txt}
{com}. replace lfp_ols1=lfp_ols1-1
{txt}(753 real changes made)

{com}. 
. regress lfp `varsA' ax ax2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       753
{txt}{hline 13}{c +}{hline 34}   F(18, 734)      = {res}    15.11
{txt}       Model {c |} {res} 49.9535973        18  2.77519985   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 134.774158       734  .183616019   {txt}R-squared       ={res}    0.2704
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2525
{txt}       Total {c |} {res} 184.727756       752  .245648611   {txt}Root MSE        =   {res}  .4285

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.2557725{col 26}{space 2} .0345565{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4}-.3236138{col 67}{space 3}-.1879312
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} .0092988{col 26}{space 2} .0144604{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.0190899{col 67}{space 3} .0376875
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .1673364{col 26}{space 2} .2406105{col 37}{space 1}    0.70{col 46}{space 3}0.487{col 54}{space 4}-.3050305{col 67}{space 3} .6397032
{txt}{space 10}we {c |}{col 14}{res}{space 2} .3282828{col 26}{space 2} .5791919{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.8087875{col 67}{space 3} 1.465353
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0035549{col 26}{space 2} .0046353{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}-.0126549{col 67}{space 3}  .005545
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0199155{col 26}{space 2} .0325544{col 37}{space 1}   -0.61{col 46}{space 3}0.541{col 54}{space 4}-.0838264{col 67}{space 3} .0439954
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0040563{col 26}{space 2} .0133233{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-.0302126{col 67}{space 3} .0221001
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000278{col 26}{space 2} .0000325{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-.0000359{col 67}{space 3} .0000916
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0003417{col 26}{space 2} .0007346{col 37}{space 1}    0.47{col 46}{space 3}0.642{col 54}{space 4}-.0011005{col 67}{space 3}  .001784
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}-.0000224{col 26}{space 2} .0001137{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-.0002456{col 67}{space 3} .0002008
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}  .000243{col 26}{space 2}  .000262{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}-.0002715{col 67}{space 3} .0007574
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0015455{col 26}{space 2} .0056329{col 37}{space 1}   -0.27{col 46}{space 3}0.784{col 54}{space 4}-.0126041{col 67}{space 3}  .009513
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0032361{col 26}{space 2} .0059542{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.0084533{col 67}{space 3} .0149255
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0043591{col 26}{space 2} .0051998{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-.0145674{col 67}{space 3} .0058492
{txt}{space 9}cit {c |}{col 14}{res}{space 2}-.0034838{col 26}{space 2} .0347366{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.0716787{col 67}{space 3} .0647111
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-3.45e-06{col 26}{space 2} 1.49e-06{col 37}{space 1}   -2.32{col 46}{space 3}0.021{col 54}{space 4}-6.37e-06{col 67}{space 3}-5.27e-07
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .0399087{col 26}{space 2} .0058823{col 37}{space 1}    6.78{col 46}{space 3}0.000{col 54}{space 4} .0283606{col 67}{space 3} .0514567
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0006107{col 26}{space 2} .0001926{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-.0009887{col 67}{space 3}-.0002326
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.038776{col 26}{space 2} 4.877032{col 37}{space 1}   -0.62{col 46}{space 3}0.533{col 54}{space 4}-12.61337{col 67}{space 3}  6.53582
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lfp_ols2, xb
{txt}
{com}. replace lfp_ols2=lfp_ols2-1
{txt}(753 real changes made)

{com}. 
. regress lww `varsA' lfp_ols1 if (lfp==1), robust
{txt}{p 0 6 2}note: {bf:lfp_ols1} omitted because of collinearity.{p_end}

Linear regression                               Number of obs     = {res}       428
                                                {txt}F(16, 411)        =  {res}     8.53
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1772
                                                {txt}Root MSE          =    {res} .66863

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.1266363{col 26}{space 2} .1119148{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-.3466331{col 67}{space 3} .0933605
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0464093{col 26}{space 2} .0302085{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-.1057917{col 67}{space 3}  .012973
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .1113025{col 26}{space 2} .4408207{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4} -.755242{col 67}{space 3} .9778469
{txt}{space 10}we {c |}{col 14}{res}{space 2}-.8514843{col 26}{space 2} 1.147582{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-3.107346{col 67}{space 3} 1.404378
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0060282{col 26}{space 2} .0093899{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-.0244865{col 67}{space 3} .0124301
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0119921{col 26}{space 2} .0675097{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.1207153{col 67}{space 3} .1446994
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0301834{col 26}{space 2} .0240799{col 37}{space 1}    1.25{col 46}{space 3}0.211{col 54}{space 4}-.0171519{col 67}{space 3} .0775186
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000348{col 26}{space 2} .0000707{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4}-.0001042{col 67}{space 3} .0001738
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0017814{col 26}{space 2} .0015375{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0012409{col 67}{space 3} .0048038
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000746{col 26}{space 2} .0002031{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.0003247{col 67}{space 3} .0004738
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0015388{col 26}{space 2} .0005256{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-.0025719{col 67}{space 3}-.0005057
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0168407{col 26}{space 2}  .011106{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-.0386724{col 67}{space 3} .0049909
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0090201{col 26}{space 2} .0124633{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}  -.03352{col 67}{space 3} .0154797
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0015374{col 26}{space 2} .0095299{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.0202708{col 67}{space 3}  .017196
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0789842{col 26}{space 2} .0680702{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0548249{col 67}{space 3} .2127933
{txt}{space 8}prin {c |}{col 14}{res}{space 2} 1.86e-06{col 26}{space 2} 2.88e-06{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-3.79e-06{col 67}{space 3} 7.52e-06
{txt}{space 4}lfp_ols1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} 2.668241{col 26}{space 2} 8.681064{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-14.39658{col 67}{space 3} 19.73307
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat5, xb
{txt}
{com}. regress lww `varsA' lfp_ols2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(17, 410)        =  {res}     8.58
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2097
                                                {txt}Root MSE          =    {res} .65612

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         lww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} .1214642{col 26}{space 2} .1162517{col 37}{space 1}    1.04{col 46}{space 3}0.297{col 54}{space 4}-.1070595{col 67}{space 3} .3499878
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0255716{col 26}{space 2} .0309587{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-.0864292{col 67}{space 3} .0352861
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.1374402{col 26}{space 2} .4334738{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-.9895485{col 67}{space 3} .7146681
{txt}{space 10}we {c |}{col 14}{res}{space 2}-1.243808{col 26}{space 2}  1.10572{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-3.417395{col 67}{space 3} .9297796
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0013154{col 26}{space 2} .0094318{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.0198562{col 67}{space 3} .0172253
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0308125{col 26}{space 2} .0667698{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-.1004413{col 67}{space 3} .1620664
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0368166{col 26}{space 2} .0225809{col 37}{space 1}    1.63{col 46}{space 3}0.104{col 54}{space 4}-.0075722{col 67}{space 3} .0812054
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} 7.10e-08{col 26}{space 2} .0000717{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.0001409{col 67}{space 3} .0001411
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0015779{col 26}{space 2} .0015297{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0014292{col 67}{space 3}  .004585
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000891{col 26}{space 2}  .000192{col 37}{space 1}    0.46{col 46}{space 3}0.643{col 54}{space 4}-.0002883{col 67}{space 3} .0004664
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0018505{col 26}{space 2} .0005069{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.0028469{col 67}{space 3}-.0008541
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0112919{col 26}{space 2} .0108815{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-.0326824{col 67}{space 3} .0100987
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0134199{col 26}{space 2} .0122368{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-.0374746{col 67}{space 3} .0106348
{txt}{space 10}un {c |}{col 14}{res}{space 2} .0013963{col 26}{space 2} .0093948{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-.0170716{col 67}{space 3} .0198642
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0738127{col 26}{space 2} .0677472{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0593626{col 67}{space 3} .2069879
{txt}{space 8}prin {c |}{col 14}{res}{space 2} 7.77e-06{col 26}{space 2} 3.31e-06{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} 1.27e-06{col 67}{space 3} .0000143
{txt}{space 4}lfp_ols2 {c |}{col 14}{res}{space 2} .8905428{col 26}{space 2} .2631087{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 54}{space 4} .3733324{col 67}{space 3} 1.407753
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  8.04383{col 26}{space 2} 8.338772{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-8.348252{col 67}{space 3} 24.43591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict lww_hat6, xb
{txt}
{com}. 
. regress whrs `varsB' lww_hat5 lfp_ols1 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(7, 420)         =  {res}     3.94
                                                {txt}Prob > F          = {res}    0.0003
                                                {txt}R-squared         = {res}    0.0693
                                                {txt}Root MSE          =    {res} 755.13

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-69.06906{col 26}{space 2} 312.0502{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-682.4437{col 67}{space 3} 544.3056
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-103.0086{col 26}{space 2} 32.26865{col 37}{space 1}   -3.19{col 46}{space 3}0.002{col 54}{space 4}-166.4368{col 67}{space 3}-39.58048
{txt}{space 10}wa {c |}{col 14}{res}{space 2} 2.480754{col 26}{space 2} 11.53572{col 37}{space 1}    0.22{col 46}{space 3}0.830{col 54}{space 4}-20.19417{col 67}{space 3} 25.15568
{txt}{space 10}we {c |}{col 14}{res}{space 2}-66.99559{col 26}{space 2} 53.58872{col 37}{space 1}   -1.25{col 46}{space 3}0.212{col 54}{space 4}-172.3311{col 67}{space 3}  38.3399
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0017307{col 26}{space 2}   .00668{col 37}{space 1}    0.26{col 46}{space 3}0.796{col 54}{space 4}-.0113998{col 67}{space 3} .0148612
{txt}{space 4}lww_hat5 {c |}{col 14}{res}{space 2} 5.772107{col 26}{space 2} 220.8881{col 37}{space 1}    0.03{col 46}{space 3}0.979{col 54}{space 4}-428.4119{col 67}{space 3} 439.9561
{txt}{space 4}lfp_ols1 {c |}{col 14}{res}{space 2} 902.7641{col 26}{space 2} 847.5784{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}  -763.26{col 67}{space 3} 2568.788
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2485.489{col 26}{space 2} 473.3136{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} 1555.131{col 67}{space 3} 3415.848
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. regress whrs `varsB' lww_hat6 lfp_ols2 if (lfp==1), robust

{txt}Linear regression                               Number of obs     = {res}       428
                                                {txt}F(7, 420)         =  {res}     9.29
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1360
                                                {txt}Root MSE          =    {res} 727.57

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} 38.56339{col 26}{space 2} 159.7224{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4}-275.3914{col 67}{space 3} 352.5182
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-90.36106{col 26}{space 2} 30.69175{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-150.6896{col 67}{space 3}-30.03248
{txt}{space 10}wa {c |}{col 14}{res}{space 2} 3.143651{col 26}{space 2} 6.363656{col 37}{space 1}    0.49{col 46}{space 3}0.622{col 54}{space 4}-9.364932{col 67}{space 3} 15.65223
{txt}{space 10}we {c |}{col 14}{res}{space 2}-83.95151{col 26}{space 2} 25.90671{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-134.8745{col 67}{space 3}-33.02854
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0035319{col 26}{space 2} .0039723{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-.0042761{col 67}{space 3}   .01134
{txt}{space 4}lww_hat6 {c |}{col 14}{res}{space 2} 88.95557{col 26}{space 2} 209.3017{col 37}{space 1}    0.43{col 46}{space 3}0.671{col 54}{space 4}-322.4538{col 67}{space 3}  500.365
{txt}{space 4}lfp_ols2 {c |}{col 14}{res}{space 2} 1260.458{col 26}{space 2} 314.9426{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} 641.3978{col 67}{space 3} 1879.518
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2574.491{col 26}{space 2} 346.5177{col 37}{space 1}    7.43{col 46}{space 3}0.000{col 54}{space 4} 1893.366{col 67}{space 3} 3255.616
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 7 *
. ********************************************************************************
. 
. 
. local vars="kl6 k618 wa we wa2 we2 wawe wa3 we3 wa2we wawe2 wfed wmed un cit prin"
{txt}
{com}. 
. *INCISO (a)*
. 
. generate vprin=(1-mtr)*prin
{txt}
{com}. generate ltax=ln(1-mtr)
{txt}
{com}. generate ltww=ltax+lww1
{txt}
{com}. 
. *INCISO (b)*
. 
. /*
> generate ax2=ax*ax
> generate wa2=wa*wa
> generate we2=we*we
> generate wa3=wa2*wa
> generate we3=we2*we
> generate wawe=wa*we
> generate wa2we=wa2*we
> generate wawe2=wa*we2
> */
. 
. probit lfp `vars'

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res: -450.8853}  
Iteration 2:{space 3}log likelihood = {res: -450.4777}  
Iteration 3:{space 3}log likelihood = {res:-450.47746}  
Iteration 4:{space 3}log likelihood = {res:-450.47746}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:16})}{col 70} = {res}{ralign 6:128.79}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-450.47746}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.1251}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.8579509{col 26}{space 2} .1188431{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 54}{space 4}-1.090879{col 67}{space 3}-.6250226
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0603097{col 26}{space 2} .0439087{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-.1463692{col 67}{space 3} .0257497
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .7521026{col 26}{space 2}   .76984{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.7567562{col 67}{space 3} 2.260961
{txt}{space 10}we {c |}{col 14}{res}{space 2}  1.09907{col 26}{space 2} 1.922726{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-2.669404{col 67}{space 3} 4.867544
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0151855{col 26}{space 2} .0145537{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-.0437101{col 67}{space 3} .0133392
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0636591{col 26}{space 2} .1056755{col 37}{space 1}   -0.60{col 46}{space 3}0.547{col 54}{space 4}-.2707794{col 67}{space 3} .1434611
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0154558{col 26}{space 2} .0446633{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.1029943{col 67}{space 3} .0720827
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2}  .000107{col 26}{space 2} .0001011{col 37}{space 1}    1.06{col 46}{space 3}0.290{col 54}{space 4}-.0000911{col 67}{space 3} .0003051
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0012697{col 26}{space 2} .0023487{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.0033336{col 67}{space 3}  .005873
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}-2.10e-06{col 26}{space 2} .0003764{col 37}{space 1}   -0.01{col 46}{space 3}0.996{col 54}{space 4}-.0007399{col 67}{space 3} .0007357
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2} .0006687{col 26}{space 2} .0008759{col 37}{space 1}    0.76{col 46}{space 3}0.445{col 54}{space 4}-.0010481{col 67}{space 3} .0023855
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0125127{col 26}{space 2}  .017534{col 37}{space 1}   -0.71{col 46}{space 3}0.475{col 54}{space 4}-.0468787{col 67}{space 3} .0218532
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0026455{col 26}{space 2}  .018479{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.0335726{col 67}{space 3} .0388636
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0102966{col 26}{space 2} .0161046{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4} -.041861{col 67}{space 3} .0212678
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0414417{col 26}{space 2}   .10854{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-.1712928{col 67}{space 3} .2541763
{txt}{space 8}prin {c |}{col 14}{res}{space 2} -.000022{col 26}{space 2} 4.77e-06{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.0000313{col 67}{space 3}-.0000127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-14.06639{col 26}{space 2} 15.98708{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4} -45.4005{col 67}{space 3} 17.26772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict lfp_probit3, xb
{txt}
{com}. generate invr=normalden(lfp_probit3)/(1-normal(lfp_probit3))
{txt}
{com}. 
. *INCISO (c)*
. 
. *ivregress 2sls whrs ltax kl6 k618 wa we prin vprin invr (ltww = `vars' invr), robust
. 
. regress ltww `vars' invr, robust

{txt}Linear regression                               Number of obs     = {res}       753
                                                {txt}F(17, 735)        =  {res}    24.59
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3643
                                                {txt}Root MSE          =    {res} .58808

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        ltww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.0162233{col 26}{space 2} .1144668{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.2409441{col 67}{space 3} .2084976
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0762642{col 26}{space 2} .0221245{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.1196989{col 67}{space 3}-.0328294
{txt}{space 10}wa {c |}{col 14}{res}{space 2}  .083895{col 26}{space 2} .3325856{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4} -.569036{col 67}{space 3}  .736826
{txt}{space 10}we {c |}{col 14}{res}{space 2}-.3682768{col 26}{space 2} .7552909{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4}-1.851061{col 67}{space 3} 1.114508
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0036122{col 26}{space 2} .0065688{col 37}{space 1}   -0.55{col 46}{space 3}0.583{col 54}{space 4}-.0165081{col 67}{space 3} .0092837
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0088989{col 26}{space 2} .0453613{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0801542{col 67}{space 3} .0979519
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0160851{col 26}{space 2} .0161196{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.0155608{col 67}{space 3} .0477311
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000228{col 26}{space 2} .0000459{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-.0000672{col 67}{space 3} .0001128
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0007796{col 26}{space 2} .0010317{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.0012458{col 67}{space 3}  .002805
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2} .0000253{col 26}{space 2} .0001354{col 37}{space 1}    0.19{col 46}{space 3}0.852{col 54}{space 4}-.0002405{col 67}{space 3} .0002911
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0008032{col 26}{space 2} .0003583{col 37}{space 1}   -2.24{col 46}{space 3}0.025{col 54}{space 4}-.0015066{col 67}{space 3}-.0000998
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0038063{col 26}{space 2} .0073297{col 37}{space 1}   -0.52{col 46}{space 3}0.604{col 54}{space 4}-.0181959{col 67}{space 3} .0105833
{txt}{space 8}wmed {c |}{col 14}{res}{space 2}-.0082558{col 26}{space 2} .0080064{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.0239739{col 67}{space 3} .0074622
{txt}{space 10}un {c |}{col 14}{res}{space 2} .0017898{col 26}{space 2} .0062345{col 37}{space 1}    0.29{col 46}{space 3}0.774{col 54}{space 4}-.0104497{col 67}{space 3} .0140293
{txt}{space 9}cit {c |}{col 14}{res}{space 2}  .091784{col 26}{space 2} .0439854{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4}  .005432{col 67}{space 3} .1781359
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0000189{col 26}{space 2} 3.08e-06{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} .0000128{col 67}{space 3} .0000249
{txt}{space 8}invr {c |}{col 14}{res}{space 2} .2500189{col 26}{space 2} .2396889{col 37}{space 1}    1.04{col 46}{space 3}0.297{col 54}{space 4}-.2205376{col 67}{space 3} .7205755
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1.40919{col 26}{space 2} 6.458283{col 37}{space 1}   -0.22{col 46}{space 3}0.827{col 54}{space 4}-14.08807{col 67}{space 3} 11.26969
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict ltww_hat1, xb
{txt}
{com}. regress whrs ltww_hat1 ltax kl6 k618 wa we prin vprin invr, robust

{txt}Linear regression                               Number of obs     = {res}       753
                                                {txt}F(9, 743)         =  {res}    19.56
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2751
                                                {txt}Root MSE          =    {res} 746.32

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ltww_hat1 {c |}{col 14}{res}{space 2}-84.97777{col 26}{space 2}    289.7{col 37}{space 1}   -0.29{col 46}{space 3}0.769{col 54}{space 4}-653.7059{col 67}{space 3} 483.7503
{txt}{space 8}ltax {c |}{col 14}{res}{space 2} 1375.743{col 26}{space 2} 214.4775{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} 954.6887{col 67}{space 3} 1796.797
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-98.85902{col 26}{space 2} 129.4066{col 37}{space 1}   -0.76{col 46}{space 3}0.445{col 54}{space 4}-352.9051{col 67}{space 3}  155.187
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} 15.41402{col 26}{space 2} 34.40144{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-52.12157{col 67}{space 3} 82.94961
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.7300246{col 26}{space 2}  6.28139{col 37}{space 1}   -0.12{col 46}{space 3}0.908{col 54}{space 4}-13.06141{col 67}{space 3} 11.60136
{txt}{space 10}we {c |}{col 14}{res}{space 2}-26.84565{col 26}{space 2} 41.38082{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4}-108.0829{col 67}{space 3} 54.39161
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0880061{col 26}{space 2}  .022341{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4} -.131865{col 67}{space 3}-.0441472
{txt}{space 7}vprin {c |}{col 14}{res}{space 2} .1143824{col 26}{space 2} .0300593{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0553711{col 67}{space 3} .1733938
{txt}{space 8}invr {c |}{col 14}{res}{space 2} 518.5601{col 26}{space 2} 251.0986{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4}  25.6129{col 67}{space 3} 1011.507
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3155.132{col 26}{space 2} 836.0154{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 1513.898{col 67}{space 3} 4796.365
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. test ltax prin

{p 0 7}{space 1}{text:( 1)}{space 1} {res}ltax = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} prin = 0{p_end}

{txt}       F(  2,   743) ={res}   22.26
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test (_b[ltax]=-_b[ltww_hat1]) (_b[vprin]=0)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}ltww_hat1 + ltax = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} vprin = 0{p_end}

{txt}       F(  2,   743) ={res}   10.74
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. testnl (_b[ltax]=-_b[ltww_hat1]) (_b[vprin]=0)

{col 3}{txt}(1){res}{col 8}{bind:_b[ltax] = -_b[ltww_hat1]}
{col 3}{txt}(2){res}{col 8}{bind:_b[vprin] = 0}

{txt}{ralign 22:chi2({res:2})} =  {res}     21.49
{txt}{ralign 22:Prob > chi2} =  {res}      0.0000{txt}

{com}. 
. *INCISO (d)*
. 
. probit lfp `vars' ax ax2

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -514.8732}  
Iteration 1:{space 3}log likelihood = {res: -399.2231}  
Iteration 2:{space 3}log likelihood = {res:-398.23139}  
Iteration 3:{space 3}log likelihood = {res:-398.23069}  
Iteration 4:{space 3}log likelihood = {res:-398.23069}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:753}
{txt}{col 57}{lalign 13:LR chi2({res:18})}{col 70} = {res}{ralign 6:233.29}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-398.23069}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2265}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lfp{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2}-.8504688{col 26}{space 2} .1233302{col 37}{space 1}   -6.90{col 46}{space 3}0.000{col 54}{space 4}-1.092192{col 67}{space 3} -.608746
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} .0236102{col 26}{space 2} .0474965{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-.0694813{col 67}{space 3} .1167017
{txt}{space 10}wa {c |}{col 14}{res}{space 2} .4938567{col 26}{space 2} .8053263{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-1.084554{col 67}{space 3} 2.072267
{txt}{space 10}we {c |}{col 14}{res}{space 2} .9622103{col 26}{space 2} 2.002132{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-2.961897{col 67}{space 3} 4.886317
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0115551{col 26}{space 2} .0154034{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.0417453{col 67}{space 3}  .018635
{txt}{space 9}we2 {c |}{col 14}{res}{space 2}-.0723266{col 26}{space 2}  .111544{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4}-.2909488{col 67}{space 3} .1462956
{txt}{space 8}wawe {c |}{col 14}{res}{space 2}-.0055927{col 26}{space 2}  .046395{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4}-.0965252{col 67}{space 3} .0853398
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2} .0000949{col 26}{space 2}  .000108{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.0001167{col 67}{space 3} .0003066
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0015105{col 26}{space 2} .0024888{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.0033676{col 67}{space 3} .0063885
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}  -.00012{col 26}{space 2} .0003973{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-.0008988{col 67}{space 3} .0006587
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}  .000672{col 26}{space 2} .0009136{col 37}{space 1}    0.74{col 46}{space 3}0.462{col 54}{space 4}-.0011187{col 67}{space 3} .0024626
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0042132{col 26}{space 2} .0184251{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-.0403257{col 67}{space 3} .0318993
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} .0103231{col 26}{space 2} .0193464{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-.0275951{col 67}{space 3} .0482413
{txt}{space 10}un {c |}{col 14}{res}{space 2}-.0149435{col 26}{space 2}  .017083{col 37}{space 1}   -0.87{col 46}{space 3}0.382{col 54}{space 4}-.0484256{col 67}{space 3} .0185386
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0231706{col 26}{space 2} .1152617{col 37}{space 1}    0.20{col 46}{space 3}0.841{col 54}{space 4}-.2027382{col 67}{space 3} .2490795
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0000129{col 26}{space 2} 5.03e-06{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0000228{col 67}{space 3}-3.08e-06
{txt}{space 10}ax {c |}{col 14}{res}{space 2} .1241355{col 26}{space 2} .0193738{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .0861635{col 67}{space 3} .1621075
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.0019205{col 26}{space 2} .0006282{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-.0031518{col 67}{space 3}-.0006892
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-10.12486{col 26}{space 2} 16.53431{col 37}{space 1}   -0.61{col 46}{space 3}0.540{col 54}{space 4}-42.53151{col 67}{space 3} 22.28179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict lfp_probit4, xb
{txt}
{com}. generate invr_new=normalden(lfp_probit4)/(1-normal(lfp_probit4))
{txt}
{com}. 
. regress ltww `vars' invr_new, robust

{txt}Linear regression                               Number of obs     = {res}       753
                                                {txt}F(17, 735)        =  {res}    32.81
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4228
                                                {txt}Root MSE          =    {res} .56039

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        ltww{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}kl6 {c |}{col 14}{res}{space 2} .1420174{col 26}{space 2} .0514009{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4} .0411073{col 67}{space 3} .2429276
{txt}{space 8}k618 {c |}{col 14}{res}{space 2}-.0623344{col 26}{space 2} .0210988{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.1037556{col 67}{space 3}-.0209132
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-.0837052{col 26}{space 2} .2995083{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-.6716989{col 67}{space 3} .5042886
{txt}{space 10}we {c |}{col 14}{res}{space 2}-.6152017{col 26}{space 2} .6914131{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-1.972582{col 67}{space 3} .7421782
{txt}{space 9}wa2 {c |}{col 14}{res}{space 2}-.0001278{col 26}{space 2} .0058732{col 37}{space 1}   -0.02{col 46}{space 3}0.983{col 54}{space 4}-.0116581{col 67}{space 3} .0114025
{txt}{space 9}we2 {c |}{col 14}{res}{space 2} .0247056{col 26}{space 2} .0408328{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 54}{space 4}-.0554572{col 67}{space 3} .1048684
{txt}{space 8}wawe {c |}{col 14}{res}{space 2} .0189426{col 26}{space 2}  .015152{col 37}{space 1}    1.25{col 46}{space 3}0.212{col 54}{space 4}-.0108037{col 67}{space 3} .0486889
{txt}{space 9}wa3 {c |}{col 14}{res}{space 2}-3.40e-06{col 26}{space 2} .0000405{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4} -.000083{col 67}{space 3} .0000762
{txt}{space 9}we3 {c |}{col 14}{res}{space 2} .0005004{col 26}{space 2} .0009302{col 37}{space 1}    0.54{col 46}{space 3}0.591{col 54}{space 4}-.0013258{col 67}{space 3} .0023266
{txt}{space 7}wa2we {c |}{col 14}{res}{space 2}  .000042{col 26}{space 2} .0001261{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.0002056{col 67}{space 3} .0002897
{txt}{space 7}wawe2 {c |}{col 14}{res}{space 2}-.0009919{col 26}{space 2} .0003263{col 37}{space 1}   -3.04{col 46}{space 3}0.002{col 54}{space 4}-.0016325{col 67}{space 3}-.0003513
{txt}{space 8}wfed {c |}{col 14}{res}{space 2}-.0007189{col 26}{space 2} .0068667{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.0141995{col 67}{space 3} .0127617
{txt}{space 8}wmed {c |}{col 14}{res}{space 2} -.009792{col 26}{space 2} .0075529{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-.0246199{col 67}{space 3} .0050358
{txt}{space 10}un {c |}{col 14}{res}{space 2} .0044515{col 26}{space 2} .0059246{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-.0071797{col 67}{space 3} .0160826
{txt}{space 9}cit {c |}{col 14}{res}{space 2} .0896872{col 26}{space 2} .0431576{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0049604{col 67}{space 3} .1744139
{txt}{space 8}prin {c |}{col 14}{res}{space 2} .0000228{col 26}{space 2} 2.17e-06{col 37}{space 1}   10.51{col 46}{space 3}0.000{col 54}{space 4} .0000186{col 67}{space 3} .0000271
{txt}{space 4}invr_new {c |}{col 14}{res}{space 2} .5123496{col 26}{space 2} .0607459{col 37}{space 1}    8.43{col 46}{space 3}0.000{col 54}{space 4} .3930934{col 67}{space 3} .6316057
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.487806{col 26}{space 2} 5.868135{col 37}{space 1}    0.25{col 46}{space 3}0.800{col 54}{space 4} -10.0325{col 67}{space 3} 13.00811
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict ltww_hat2, xb
{txt}
{com}. regress whrs ltww_hat2 ltax kl6 k618 wa we prin vprin ax ax2 invr_new, robust

{txt}Linear regression                               Number of obs     = {res}       753
                                                {txt}F(11, 741)        =  {res}    32.64
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3661
                                                {txt}Root MSE          =    {res} 698.87

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        whrs{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}ltww_hat2 {c |}{col 14}{res}{space 2}-134.8892{col 26}{space 2} 258.2309{col 37}{space 1}   -0.52{col 46}{space 3}0.602{col 54}{space 4}-641.8405{col 67}{space 3} 372.0622
{txt}{space 8}ltax {c |}{col 14}{res}{space 2} 1159.754{col 26}{space 2} 197.8351{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} 771.3694{col 67}{space 3} 1548.138
{txt}{space 9}kl6 {c |}{col 14}{res}{space 2}-114.8352{col 26}{space 2} 98.13238{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-307.4858{col 67}{space 3} 77.81541
{txt}{space 8}k618 {c |}{col 14}{res}{space 2} 15.88057{col 26}{space 2} 30.18826{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-43.38414{col 67}{space 3} 75.14527
{txt}{space 10}wa {c |}{col 14}{res}{space 2}-7.524676{col 26}{space 2}  6.36223{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-20.01482{col 67}{space 3} 4.965467
{txt}{space 10}we {c |}{col 14}{res}{space 2}-21.45393{col 26}{space 2} 31.13736{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-82.58187{col 67}{space 3} 39.67402
{txt}{space 8}prin {c |}{col 14}{res}{space 2}-.0649567{col 26}{space 2} .0193054{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.1028566{col 67}{space 3}-.0270569
{txt}{space 7}vprin {c |}{col 14}{res}{space 2} .0853239{col 26}{space 2}  .026976{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .0323653{col 67}{space 3} .1382825
{txt}{space 10}ax {c |}{col 14}{res}{space 2} 29.64786{col 26}{space 2} 16.11428{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4} -1.98721{col 67}{space 3} 61.28293
{txt}{space 9}ax2 {c |}{col 14}{res}{space 2}-.3491333{col 26}{space 2} .3805019{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-1.096123{col 67}{space 3} .3978567
{txt}{space 4}invr_new {c |}{col 14}{res}{space 2} 450.7461{col 26}{space 2} 202.7755{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} 52.66327{col 67}{space 3}  848.829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2661.194{col 26}{space 2} 763.8603{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} 1161.606{col 67}{space 3} 4160.782
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. test ltax prin

{p 0 7}{space 1}{text:( 1)}{space 1} {res}ltax = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} prin = 0{p_end}

{txt}       F(  2,   741) ={res}   17.79
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test (_b[ltax]=-_b[ltww_hat2]) (_b[vprin]=0)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}ltww_hat2 + ltax = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} vprin = 0{p_end}

{txt}       F(  2,   741) ={res}    8.33
{txt}{col 13}Prob > F ={res}    0.0003
{txt}
{com}. testnl (_b[ltax]=-_b[ltww_hat2]) (_b[vprin]=0)

{col 3}{txt}(1){res}{col 8}{bind:_b[ltax] = -_b[ltww_hat2]}
{col 3}{txt}(2){res}{col 8}{bind:_b[vprin] = 0}

{txt}{ralign 22:chi2({res:2})} =  {res}     16.65
{txt}{ralign 22:Prob > chi2} =  {res}      0.0002{txt}

{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 8 *
. ********************************************************************************
. 
. 
. *INCISO (c)*
. 
. 
. 
. *INCISO (d)*
. 
. 
. 
. 
. *##############################################################################*
. ******************* SEGUNDA PARTE: ANÁLISIS DE SUPERVIVENCIA *******************
. *##############################################################################*
. 
. 
. use "linfosarcoma", clear
{txt}
{com}. describe

{txt}Contains data from {res}linfosarcoma.dta
{txt} Observations:{res}           300                  
{txt}    Variables:{res}             8                  26 Dec 2020 10:29
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:clinic         }{txt}{bind: float   }{bind:{txt}%5.0f     }{space 1}{bind:         }{bind:  }{res}{res}Clinic ID (1 to 7){p_end}
{p 0 48}{bind:dog            }{txt}{bind: float   }{bind:{txt}%5.0f     }{space 1}{bind:         }{bind:  }{res}{res}Dog ID (1 to 300){p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:{txt}%5.2f     }{space 1}{bind:         }{bind:  }{res}{res}Age at lympho diagnosis{p_end}
{p 0 48}{bind:rad            }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:therlbl  }{bind:  }{res}{res}radiation therapy{p_end}
{p 0 48}{bind:chemo          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:therlbl  }{bind:  }{res}{res}chemotherapy{p_end}
{p 0 48}{bind:died           }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:diedlbl  }{bind:  }{res}{res}died or lost to follow-up{p_end}
{p 0 48}{bind:months         }{txt}{bind: float   }{bind:{txt}%5.2f     }{space 1}{bind:         }{bind:  }{res}{res}# of months after start of therapy before death or lost to follow-up{p_end}
{p 0 48}{bind:days           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. 
. 
. ********************************************************************************
.                                 * INTRODUCIÓN AL ANÁLISIS DE SUPERVIVENCIA *
. ********************************************************************************
. 
. 
. *EJERCICIO 1*
. 
. stset months, fail(died=1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(0, months]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}        300{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}        300{txt}  observations remaining, representing
{res}        207{txt}  failures in single-record/single-failure data
{res}  4,263.336{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 45.45747
{txt}
{com}. stdescribe

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}       300   
{txt}Number of records     {res}       300           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res} 14.21112    .2546768   13.39561   45.45747

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res} 4263.3359    14.21112    .2546768   13.39561   45.45747

{txt}Failures              {res}       207         .69           0          1          1
{txt}{hline 78}

{com}. stsum

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res} 4,263.33587   .0485535{col 40}      300   10.72203  16.14084  23.51119
{txt}
{com}. 
. sts list, survival

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months

{txt}Kaplan–Meier survivor function

{col 14}At{col 27}{col 34}Survivor{col 48}Std.
  Time     risk   Fail   Lost  {col 34}function     error     [95% conf. int.]
{hline 72}
 .2547 {res}     300      1      0      0.9967    0.0033     0.9766    0.9995
{txt} .6313 {res}     299      1      0      0.9933    0.0047     0.9736    0.9983
{txt} .6501 {res}     298      0      1      0.9933    0.0047     0.9736    0.9983
{txt} .7086 {res}     297      1      0      0.9900    0.0058     0.9693    0.9968
{txt} .7373 {res}     296      1      0      0.9866    0.0066     0.9648    0.9950
{txt} .8599 {res}     295      0      1      0.9866    0.0066     0.9648    0.9950
{txt} 1.374 {res}     294      1      0      0.9833    0.0074     0.9603    0.9930
{txt} 1.412 {res}     293      1      0      0.9799    0.0081     0.9559    0.9909
{txt} 1.864 {res}     292      1      0      0.9766    0.0087     0.9515    0.9888
{txt} 1.881 {res}     291      1      0      0.9732    0.0093     0.9472    0.9865
{txt} 2.003 {res}     290      1      0      0.9699    0.0099     0.9429    0.9842
{txt} 2.392 {res}     289      0      1      0.9699    0.0099     0.9429    0.9842
{txt} 2.497 {res}     288      1      0      0.9665    0.0104     0.9386    0.9818
{txt} 2.776 {res}     287      0      1      0.9665    0.0104     0.9386    0.9818
{txt} 2.862 {res}     286      0      1      0.9665    0.0104     0.9386    0.9818
{txt} 2.899 {res}     285      0      1      0.9665    0.0104     0.9386    0.9818
{txt} 3.072 {res}     284      0      1      0.9665    0.0104     0.9386    0.9818
{txt} 3.148 {res}     283      1      0      0.9631    0.0109     0.9343    0.9794
{txt} 3.199 {res}     282      1      0      0.9597    0.0114     0.9301    0.9769
{txt} 3.212 {res}     281      1      0      0.9563    0.0119     0.9258    0.9744
{txt} 3.353 {res}     280      0      1      0.9563    0.0119     0.9258    0.9744
{txt} 3.396 {res}     279      0      1      0.9563    0.0119     0.9258    0.9744
{txt} 3.456 {res}     278      1      0      0.9528    0.0123     0.9216    0.9718
{txt} 3.474 {res}     277      0      1      0.9528    0.0123     0.9216    0.9718
{txt} 3.616 {res}     276      1      0      0.9494    0.0127     0.9174    0.9692
{txt} 3.704 {res}     275      1      0      0.9459    0.0132     0.9132    0.9665
{txt}  3.79 {res}     274      0      1      0.9459    0.0132     0.9132    0.9665
{txt} 3.901 {res}     273      1      0      0.9424    0.0136     0.9090    0.9638
{txt} 3.989 {res}     272      1      0      0.9390    0.0139     0.9049    0.9611
{txt}  4.01 {res}     271      1      0      0.9355    0.0143     0.9007    0.9584
{txt} 4.051 {res}     270      0      1      0.9355    0.0143     0.9007    0.9584
{txt} 4.138 {res}     269      0      1      0.9355    0.0143     0.9007    0.9584
{txt} 4.196 {res}     268      0      1      0.9355    0.0143     0.9007    0.9584
{txt} 4.221 {res}     267      1      0      0.9320    0.0147     0.8966    0.9556
{txt} 4.346 {res}     266      1      0      0.9285    0.0150     0.8924    0.9528
{txt} 4.504 {res}     265      0      1      0.9285    0.0150     0.8924    0.9528
{txt} 4.831 {res}     264      1      0      0.9250    0.0154     0.8883    0.9500
{txt} 4.894 {res}     263      1      0      0.9215    0.0157     0.8842    0.9471
{txt} 4.912 {res}     262      1      0      0.9180    0.0161     0.8801    0.9443
{txt}  4.99 {res}     261      1      0      0.9144    0.0164     0.8760    0.9414
{txt}  5.03 {res}     260      0      1      0.9144    0.0164     0.8760    0.9414
{txt} 5.176 {res}     259      1      0      0.9109    0.0167     0.8719    0.9385
{txt} 5.393 {res}     258      1      0      0.9074    0.0170     0.8678    0.9355
{txt} 5.806 {res}     257      1      0      0.9038    0.0173     0.8637    0.9326
{txt} 5.826 {res}     256      0      1      0.9038    0.0173     0.8637    0.9326
{txt} 5.899 {res}     255      1      0      0.9003    0.0176     0.8597    0.9296
{txt} 5.908 {res}     254      0      1      0.9003    0.0176     0.8597    0.9296
{txt} 6.089 {res}     253      1      0      0.8967    0.0179     0.8556    0.9267
{txt} 6.272 {res}     252      1      0      0.8932    0.0181     0.8515    0.9237
{txt} 6.423 {res}     251      1      0      0.8896    0.0184     0.8475    0.9207
{txt} 6.441 {res}     250      1      0      0.8861    0.0187     0.8435    0.9176
{txt} 6.517 {res}     249      1      0      0.8825    0.0189     0.8394    0.9146
{txt} 6.869 {res}     248      0      1      0.8825    0.0189     0.8394    0.9146
{txt} 6.884 {res}     247      1      0      0.8789    0.0192     0.8354    0.9116
{txt} 6.907 {res}     246      1      0      0.8754    0.0195     0.8314    0.9085
{txt} 6.919 {res}     245      1      0      0.8718    0.0197     0.8274    0.9054
{txt} 6.951 {res}     244      1      0      0.8682    0.0199     0.8234    0.9023
{txt} 7.273 {res}     243      1      0      0.8646    0.0202     0.8194    0.8993
{txt} 7.295 {res}     242      1      0      0.8611    0.0204     0.8154    0.8962
{txt} 7.295 {res}     241      1      0      0.8575    0.0206     0.8114    0.8930
{txt} 7.441 {res}     240      1      0      0.8539    0.0209     0.8075    0.8899
{txt} 7.508 {res}     239      1      0      0.8504    0.0211     0.8035    0.8868
{txt} 7.523 {res}     238      1      0      0.8468    0.0213     0.7996    0.8837
{txt} 7.536 {res}     237      0      1      0.8468    0.0213     0.7996    0.8837
{txt} 7.566 {res}     236      0      1      0.8468    0.0213     0.7996    0.8837
{txt} 7.821 {res}     235      1      0      0.8432    0.0215     0.7956    0.8805
{txt} 7.914 {res}     234      1      0      0.8396    0.0217     0.7916    0.8773
{txt} 7.962 {res}     233      1      0      0.8360    0.0219     0.7877    0.8741
{txt} 8.119 {res}     232      1      0      0.8324    0.0221     0.7837    0.8710
{txt} 8.238 {res}     231      1      0      0.8288    0.0223     0.7798    0.8678
{txt} 8.238 {res}     230      1      0      0.8252    0.0225     0.7759    0.8646
{txt}  8.32 {res}     229      1      0      0.8216    0.0227     0.7719    0.8614
{txt} 8.372 {res}     228      1      0      0.8180    0.0229     0.7680    0.8581
{txt}  8.39 {res}     227      1      0      0.8143    0.0231     0.7641    0.8549
{txt} 8.481 {res}     226      0      1      0.8143    0.0231     0.7641    0.8549
{txt} 8.599 {res}     225      0      1      0.8143    0.0231     0.7641    0.8549
{txt} 8.603 {res}     224      1      0      0.8107    0.0232     0.7601    0.8517
{txt} 8.638 {res}     223      1      0      0.8071    0.0234     0.7562    0.8484
{txt} 8.732 {res}     222      1      0      0.8034    0.0236     0.7523    0.8451
{txt} 8.787 {res}     221      0      1      0.8034    0.0236     0.7523    0.8451
{txt} 8.842 {res}     220      0      1      0.8034    0.0236     0.7523    0.8451
{txt} 8.926 {res}     219      1      0      0.7998    0.0238     0.7483    0.8418
{txt} 8.951 {res}     218      1      0      0.7961    0.0239     0.7443    0.8385
{txt} 9.139 {res}     217      1      0      0.7924    0.0241     0.7404    0.8352
{txt} 9.181 {res}     216      1      0      0.7888    0.0243     0.7364    0.8319
{txt} 9.487 {res}     215      1      0      0.7851    0.0244     0.7325    0.8286
{txt} 9.566 {res}     214      0      1      0.7851    0.0244     0.7325    0.8286
{txt} 9.705 {res}     213      0      1      0.7851    0.0244     0.7325    0.8286
{txt} 9.904 {res}     212      1      0      0.7814    0.0246     0.7285    0.8252
{txt} 10.01 {res}     211      0      1      0.7814    0.0246     0.7285    0.8252
{txt} 10.01 {res}     210      1      0      0.7777    0.0248     0.7245    0.8219
{txt} 10.17 {res}     209      1      0      0.7740    0.0249     0.7205    0.8185
{txt} 10.22 {res}     208      0      1      0.7740    0.0249     0.7205    0.8185
{txt} 10.25 {res}     207      1      0      0.7702    0.0251     0.7165    0.8151
{txt} 10.27 {res}     206      0      1      0.7702    0.0251     0.7165    0.8151
{txt}  10.3 {res}     205      0      1      0.7702    0.0251     0.7165    0.8151
{txt} 10.31 {res}     204      1      0      0.7664    0.0252     0.7125    0.8116
{txt} 10.33 {res}     203      0      1      0.7664    0.0252     0.7125    0.8116
{txt} 10.51 {res}     202      1      0      0.7626    0.0254     0.7084    0.8082
{txt} 10.54 {res}     201      1      0      0.7589    0.0256     0.7043    0.8047
{txt} 10.56 {res}     200      1      0      0.7551    0.0257     0.7003    0.8013
{txt} 10.67 {res}     199      0      1      0.7551    0.0257     0.7003    0.8013
{txt} 10.68 {res}     198      1      0      0.7512    0.0259     0.6962    0.7978
{txt} 10.72 {res}     197      1      0      0.7474    0.0260     0.6921    0.7943
{txt} 10.74 {res}     196      0      1      0.7474    0.0260     0.6921    0.7943
{txt} 10.79 {res}     195      0      1      0.7474    0.0260     0.6921    0.7943
{txt} 10.83 {res}     194      0      1      0.7474    0.0260     0.6921    0.7943
{txt} 10.84 {res}     193      0      1      0.7474    0.0260     0.6921    0.7943
{txt} 10.91 {res}     192      1      0      0.7435    0.0262     0.6880    0.7907
{txt} 10.93 {res}     191      1      0      0.7396    0.0263     0.6838    0.7871
{txt} 11.05 {res}     190      1      0      0.7358    0.0265     0.6797    0.7836
{txt} 11.07 {res}     189      1      0      0.7319    0.0266     0.6756    0.7800
{txt} 11.07 {res}     188      1      0      0.7280    0.0267     0.6714    0.7764
{txt} 11.08 {res}     187      0      1      0.7280    0.0267     0.6714    0.7764
{txt} 11.15 {res}     186      1      0      0.7241    0.0269     0.6673    0.7728
{txt} 11.28 {res}     185      0      1      0.7241    0.0269     0.6673    0.7728
{txt} 11.29 {res}     184      0      1      0.7241    0.0269     0.6673    0.7728
{txt} 11.36 {res}     183      1      0      0.7201    0.0270     0.6631    0.7692
{txt} 11.46 {res}     182      0      1      0.7201    0.0270     0.6631    0.7692
{txt} 11.61 {res}     181      1      0      0.7161    0.0272     0.6589    0.7655
{txt} 11.63 {res}     180      1      0      0.7121    0.0273     0.6547    0.7618
{txt} 11.69 {res}     179      1      0      0.7082    0.0274     0.6505    0.7581
{txt} 11.71 {res}     178      1      0      0.7042    0.0276     0.6463    0.7544
{txt} 11.79 {res}     177      1      0      0.7002    0.0277     0.6421    0.7507
{txt}  11.8 {res}     176      1      0      0.6962    0.0278     0.6379    0.7470
{txt} 11.99 {res}     175      1      0      0.6922    0.0280     0.6337    0.7433
{txt} 12.04 {res}     174      1      0      0.6883    0.0281     0.6296    0.7396
{txt} 12.11 {res}     173      0      1      0.6883    0.0281     0.6296    0.7396
{txt} 12.11 {res}     172      0      1      0.6883    0.0281     0.6296    0.7396
{txt} 12.21 {res}     171      0      1      0.6883    0.0281     0.6296    0.7396
{txt}  12.3 {res}     170      1      0      0.6842    0.0282     0.6253    0.7359
{txt} 12.43 {res}     169      1      0      0.6802    0.0283     0.6211    0.7321
{txt} 12.44 {res}     168      1      0      0.6761    0.0284     0.6168    0.7283
{txt} 12.46 {res}     167      1      0      0.6721    0.0286     0.6126    0.7245
{txt} 12.61 {res}     166      0      1      0.6721    0.0286     0.6126    0.7245
{txt} 12.63 {res}     165      1      0      0.6680    0.0287     0.6083    0.7207
{txt} 12.63 {res}     164      1      0      0.6639    0.0288     0.6041    0.7169
{txt} 12.78 {res}     163      1      0      0.6599    0.0289     0.5998    0.7131
{txt} 12.79 {res}     162      0      1      0.6599    0.0289     0.5998    0.7131
{txt} 12.79 {res}     161      1      0      0.6558    0.0290     0.5956    0.7092
{txt} 12.86 {res}     160      0      1      0.6558    0.0290     0.5956    0.7092
{txt} 12.88 {res}     159      1      0      0.6516    0.0291     0.5913    0.7053
{txt} 12.91 {res}     158      1      0      0.6475    0.0292     0.5870    0.7015
{txt} 12.98 {res}     157      1      0      0.6434    0.0293     0.5827    0.6976
{txt} 13.11 {res}     156      1      0      0.6393    0.0294     0.5784    0.6937
{txt} 13.15 {res}     155      1      0      0.6351    0.0295     0.5742    0.6898
{txt} 13.17 {res}     154      0      1      0.6351    0.0295     0.5742    0.6898
{txt} 13.23 {res}     153      1      0      0.6310    0.0296     0.5699    0.6859
{txt} 13.24 {res}     152      0      1      0.6310    0.0296     0.5699    0.6859
{txt} 13.26 {res}     151      1      0      0.6268    0.0297     0.5656    0.6819
{txt} 13.53 {res}     150      1      0      0.6226    0.0298     0.5612    0.6780
{txt}  13.7 {res}     149      0      1      0.6226    0.0298     0.5612    0.6780
{txt} 13.74 {res}     148      1      0      0.6184    0.0299     0.5569    0.6740
{txt} 13.75 {res}     147      1      0      0.6142    0.0300     0.5526    0.6700
{txt}  13.8 {res}     146      1      0      0.6100    0.0301     0.5482    0.6660
{txt}  13.8 {res}     145      1      0      0.6058    0.0302     0.5439    0.6620
{txt} 13.88 {res}     144      1      0      0.6016    0.0303     0.5396    0.6580
{txt}  13.9 {res}     143      1      0      0.5974    0.0303     0.5353    0.6540
{txt} 13.95 {res}     142      1      0      0.5932    0.0304     0.5310    0.6500
{txt} 14.07 {res}     141      1      0      0.5890    0.0305     0.5267    0.6459
{txt} 14.16 {res}     140      0      1      0.5890    0.0305     0.5267    0.6459
{txt} 14.19 {res}     139      1      0      0.5847    0.0306     0.5223    0.6419
{txt} 14.25 {res}     138      1      0      0.5805    0.0306     0.5180    0.6378
{txt}  14.3 {res}     137      0      1      0.5805    0.0306     0.5180    0.6378
{txt} 14.32 {res}     136      1      0      0.5762    0.0307     0.5136    0.6337
{txt} 14.44 {res}     135      1      0      0.5720    0.0308     0.5093    0.6296
{txt} 14.57 {res}     134      1      0      0.5677    0.0308     0.5049    0.6255
{txt}  14.6 {res}     133      0      1      0.5677    0.0308     0.5049    0.6255
{txt} 14.65 {res}     132      1      0      0.5634    0.0309     0.5006    0.6214
{txt} 14.68 {res}     131      1      0      0.5591    0.0310     0.4962    0.6173
{txt} 14.75 {res}     130      1      0      0.5548    0.0310     0.4918    0.6131
{txt} 14.75 {res}     129      0      1      0.5548    0.0310     0.4918    0.6131
{txt} 14.87 {res}     128      1      0      0.5505    0.0311     0.4874    0.6090
{txt} 14.93 {res}     127      0      1      0.5505    0.0311     0.4874    0.6090
{txt} 14.95 {res}     126      1      0      0.5461    0.0311     0.4830    0.6048
{txt} 15.02 {res}     125      1      0      0.5417    0.0312     0.4786    0.6005
{txt} 15.06 {res}     124      0      1      0.5417    0.0312     0.4786    0.6005
{txt} 15.13 {res}     123      1      0      0.5373    0.0313     0.4741    0.5963
{txt} 15.19 {res}     122      0      1      0.5373    0.0313     0.4741    0.5963
{txt}  15.2 {res}     121      1      0      0.5329    0.0313     0.4696    0.5920
{txt} 15.28 {res}     120      1      0      0.5284    0.0314     0.4651    0.5877
{txt} 15.33 {res}     119      1      0      0.5240    0.0314     0.4607    0.5834
{txt} 15.36 {res}     118      1      0      0.5196    0.0315     0.4562    0.5791
{txt} 15.38 {res}     117      1      0      0.5151    0.0315     0.4517    0.5748
{txt} 15.62 {res}     116      1      0      0.5107    0.0315     0.4472    0.5705
{txt} 15.93 {res}     115      0      1      0.5107    0.0315     0.4472    0.5705
{txt}    16 {res}     114      0      1      0.5107    0.0315     0.4472    0.5705
{txt}    16 {res}     113      1      0      0.5061    0.0316     0.4427    0.5661
{txt} 16.06 {res}     112      1      0      0.5016    0.0316     0.4382    0.5617
{txt} 16.14 {res}     111      1      0      0.4971    0.0317     0.4336    0.5573
{txt} 16.14 {res}     110      1      0      0.4926    0.0317     0.4291    0.5529
{txt} 16.16 {res}     109      0      1      0.4926    0.0317     0.4291    0.5529
{txt} 16.16 {res}     108      1      0      0.4880    0.0317     0.4245    0.5485
{txt} 16.17 {res}     107      1      0      0.4835    0.0318     0.4200    0.5440
{txt} 16.22 {res}     106      1      0      0.4789    0.0318     0.4154    0.5395
{txt} 16.23 {res}     105      0      1      0.4789    0.0318     0.4154    0.5395
{txt} 16.27 {res}     104      1      0      0.4743    0.0318     0.4108    0.5350
{txt} 16.39 {res}     103      0      1      0.4743    0.0318     0.4108    0.5350
{txt}  16.4 {res}     102      1      0      0.4697    0.0318     0.4062    0.5305
{txt} 16.46 {res}     101      1      0      0.4650    0.0319     0.4015    0.5259
{txt} 16.52 {res}     100      1      0      0.4604    0.0319     0.3969    0.5214
{txt} 16.61 {res}      99      1      0      0.4557    0.0319     0.3923    0.5168
{txt} 16.86 {res}      98      1      0      0.4511    0.0319     0.3877    0.5122
{txt}  16.9 {res}      97      1      0      0.4464    0.0319     0.3831    0.5077
{txt}  16.9 {res}      96      1      0      0.4418    0.0319     0.3785    0.5031
{txt} 16.96 {res}      95      1      0      0.4371    0.0319     0.3739    0.4985
{txt} 17.07 {res}      94      1      0      0.4325    0.0319     0.3693    0.4939
{txt} 17.15 {res}      93      1      0      0.4278    0.0319     0.3647    0.4893
{txt} 17.17 {res}      92      0      1      0.4278    0.0319     0.3647    0.4893
{txt} 17.21 {res}      91      1      0      0.4231    0.0319     0.3601    0.4846
{txt} 17.27 {res}      90      1      0      0.4184    0.0319     0.3555    0.4800
{txt} 17.27 {res}      89      1      0      0.4137    0.0319     0.3509    0.4753
{txt} 17.33 {res}      88      0      1      0.4137    0.0319     0.3509    0.4753
{txt} 17.42 {res}      87      0      1      0.4137    0.0319     0.3509    0.4753
{txt} 17.42 {res}      86      1      0      0.4089    0.0319     0.3462    0.4705
{txt} 17.43 {res}      85      0      1      0.4089    0.0319     0.3462    0.4705
{txt} 17.45 {res}      84      0      1      0.4089    0.0319     0.3462    0.4705
{txt}  17.7 {res}      83      1      0      0.4040    0.0319     0.3413    0.4657
{txt} 17.74 {res}      82      1      0      0.3990    0.0319     0.3365    0.4608
{txt} 17.87 {res}      81      0      1      0.3990    0.0319     0.3365    0.4608
{txt} 17.91 {res}      80      1      0      0.3940    0.0318     0.3316    0.4558
{txt} 18.16 {res}      79      1      0      0.3891    0.0318     0.3267    0.4509
{txt} 18.35 {res}      78      0      1      0.3891    0.0318     0.3267    0.4509
{txt} 18.48 {res}      77      1      0      0.3840    0.0318     0.3217    0.4459
{txt} 18.59 {res}      76      0      1      0.3840    0.0318     0.3217    0.4459
{txt} 18.63 {res}      75      1      0      0.3789    0.0318     0.3167    0.4408
{txt} 18.65 {res}      74      1      0      0.3738    0.0318     0.3117    0.4357
{txt} 18.72 {res}      73      0      1      0.3738    0.0318     0.3117    0.4357
{txt} 18.76 {res}      72      1      0      0.3686    0.0318     0.3066    0.4305
{txt} 18.88 {res}      71      0      1      0.3686    0.0318     0.3066    0.4305
{txt} 18.91 {res}      70      1      0      0.3633    0.0317     0.3015    0.4253
{txt} 18.92 {res}      69      1      0      0.3580    0.0317     0.2964    0.4200
{txt} 18.95 {res}      68      0      1      0.3580    0.0317     0.2964    0.4200
{txt} 19.23 {res}      67      0      1      0.3580    0.0317     0.2964    0.4200
{txt} 19.27 {res}      66      1      0      0.3526    0.0317     0.2911    0.4147
{txt} 19.28 {res}      65      1      0      0.3472    0.0317     0.2858    0.4093
{txt} 19.44 {res}      64      0      1      0.3472    0.0317     0.2858    0.4093
{txt} 19.62 {res}      63      0      1      0.3472    0.0317     0.2858    0.4093
{txt} 19.71 {res}      62      0      1      0.3472    0.0317     0.2858    0.4093
{txt}    20 {res}      61      1      0      0.3415    0.0317     0.2802    0.4036
{txt} 20.11 {res}      60      1      0      0.3358    0.0316     0.2746    0.3980
{txt} 20.26 {res}      59      1      0      0.3301    0.0316     0.2691    0.3923
{txt} 20.54 {res}      58      1      0      0.3244    0.0316     0.2636    0.3866
{txt} 20.73 {res}      57      0      1      0.3244    0.0316     0.2636    0.3866
{txt} 20.84 {res}      56      1      0      0.3186    0.0315     0.2579    0.3809
{txt} 20.86 {res}      55      1      0      0.3128    0.0315     0.2523    0.3751
{txt} 20.92 {res}      54      0      1      0.3128    0.0315     0.2523    0.3751
{txt} 21.18 {res}      53      1      0      0.3069    0.0314     0.2466    0.3692
{txt} 21.28 {res}      52      0      1      0.3069    0.0314     0.2466    0.3692
{txt} 21.32 {res}      51      1      0      0.3009    0.0314     0.2408    0.3632
{txt} 21.49 {res}      50      1      0      0.2949    0.0313     0.2350    0.3571
{txt}  21.5 {res}      49      1      0      0.2889    0.0313     0.2292    0.3511
{txt} 21.58 {res}      48      1      0      0.2829    0.0312     0.2235    0.3450
{txt} 21.77 {res}      47      1      0      0.2768    0.0311     0.2177    0.3389
{txt} 22.07 {res}      46      1      0      0.2708    0.0310     0.2120    0.3328
{txt} 22.35 {res}      45      0      1      0.2708    0.0310     0.2120    0.3328
{txt}  22.4 {res}      44      0      1      0.2708    0.0310     0.2120    0.3328
{txt} 22.58 {res}      43      0      1      0.2708    0.0310     0.2120    0.3328
{txt} 22.61 {res}      42      1      0      0.2644    0.0309     0.2059    0.3264
{txt} 22.95 {res}      41      1      0      0.2579    0.0308     0.1997    0.3199
{txt} 23.36 {res}      40      1      0      0.2515    0.0307     0.1936    0.3133
{txt} 23.43 {res}      39      0      1      0.2515    0.0307     0.1936    0.3133
{txt} 23.51 {res}      38      1      0      0.2449    0.0306     0.1873    0.3067
{txt} 23.58 {res}      37      0      1      0.2449    0.0306     0.1873    0.3067
{txt} 23.62 {res}      36      1      0      0.2381    0.0305     0.1809    0.2998
{txt} 23.76 {res}      35      0      1      0.2381    0.0305     0.1809    0.2998
{txt}  23.9 {res}      34      1      0      0.2311    0.0304     0.1743    0.2927
{txt} 24.22 {res}      33      1      0      0.2241    0.0303     0.1677    0.2857
{txt} 24.55 {res}      32      0      1      0.2241    0.0303     0.1677    0.2857
{txt} 25.07 {res}      31      0      1      0.2241    0.0303     0.1677    0.2857
{txt} 25.18 {res}      30      0      1      0.2241    0.0303     0.1677    0.2857
{txt} 25.32 {res}      29      1      0      0.2163    0.0302     0.1603    0.2780
{txt} 25.67 {res}      28      1      0      0.2086    0.0301     0.1530    0.2702
{txt} 26.39 {res}      27      1      0      0.2009    0.0300     0.1458    0.2624
{txt} 26.57 {res}      26      1      0      0.1932    0.0298     0.1386    0.2546
{txt} 26.59 {res}      25      0      1      0.1932    0.0298     0.1386    0.2546
{txt} 26.59 {res}      24      1      0      0.1851    0.0296     0.1311    0.2464
{txt} 26.84 {res}      23      1      0      0.1771    0.0294     0.1238    0.2382
{txt} 26.89 {res}      22      1      0      0.1690    0.0292     0.1165    0.2299
{txt} 27.17 {res}      21      1      0      0.1610    0.0289     0.1093    0.2216
{txt} 27.27 {res}      20      1      0      0.1529    0.0285     0.1022    0.2131
{txt} 27.47 {res}      19      1      0      0.1449    0.0281     0.0951    0.2046
{txt} 27.55 {res}      18      1      0      0.1368    0.0277     0.0882    0.1960
{txt} 27.88 {res}      17      1      0      0.1288    0.0272     0.0814    0.1873
{txt} 28.64 {res}      16      0      1      0.1288    0.0272     0.0814    0.1873
{txt} 28.64 {res}      15      1      0      0.1202    0.0267     0.0741    0.1782
{txt} 28.98 {res}      14      0      1      0.1202    0.0267     0.0741    0.1782
{txt} 29.53 {res}      13      1      0      0.1109    0.0262     0.0663    0.1684
{txt}  30.2 {res}      12      1      0      0.1017    0.0256     0.0586    0.1585
{txt}  30.2 {res}      11      1      0      0.0925    0.0249     0.0512    0.1484
{txt} 30.21 {res}      10      1      0      0.0832    0.0241     0.0440    0.1381
{txt} 30.56 {res}       9      0      1      0.0832    0.0241     0.0440    0.1381
{txt} 30.81 {res}       8      1      0      0.0728    0.0232     0.0360    0.1269
{txt} 35.89 {res}       7      1      0      0.0624    0.0221     0.0284    0.1153
{txt} 36.96 {res}       6      1      0      0.0520    0.0207     0.0213    0.1033
{txt} 37.88 {res}       5      1      0      0.0416    0.0190     0.0148    0.0908
{txt} 39.12 {res}       4      1      0      0.0312    0.0169     0.0090    0.0777
{txt}  39.4 {res}       3      1      0      0.0208    0.0141     0.0043    0.0640
{txt} 41.99 {res}       2      1      0      0.0104    0.0102     0.0010    0.0498
{txt} 45.46 {res}       1      1      0      0.0000         .          .         .
{txt}{hline 72}

{com}. sts graph, survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. 
. *EJERCICIO 2*
. 
. sts list, cumhaz

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months

{txt}Nelson–Aalen cumulative hazard function

{col 14}At{col 27}{col 32}Cumulative{col 48}Std.
  Time     risk   Fail   Lost  {col 34}  hazard     error     [95% conf. int.]
{hline 72}
 .2547 {res}     300      1      0      0.0033    0.0033     0.0005    0.0237
{txt} .6313 {res}     299      1      0      0.0067    0.0047     0.0017    0.0267
{txt} .6501 {res}     298      0      1      0.0067    0.0047     0.0017    0.0267
{txt} .7086 {res}     297      1      0      0.0100    0.0058     0.0032    0.0311
{txt} .7373 {res}     296      1      0      0.0134    0.0067     0.0050    0.0358
{txt} .8599 {res}     295      0      1      0.0134    0.0067     0.0050    0.0358
{txt} 1.374 {res}     294      1      0      0.0168    0.0075     0.0070    0.0404
{txt} 1.412 {res}     293      1      0      0.0202    0.0083     0.0091    0.0450
{txt} 1.864 {res}     292      1      0      0.0237    0.0089     0.0113    0.0496
{txt} 1.881 {res}     291      1      0      0.0271    0.0096     0.0136    0.0542
{txt} 2.003 {res}     290      1      0      0.0305    0.0102     0.0159    0.0587
{txt} 2.392 {res}     289      0      1      0.0305    0.0102     0.0159    0.0587
{txt} 2.497 {res}     288      1      0      0.0340    0.0108     0.0183    0.0632
{txt} 2.776 {res}     287      0      1      0.0340    0.0108     0.0183    0.0632
{txt} 2.862 {res}     286      0      1      0.0340    0.0108     0.0183    0.0632
{txt} 2.899 {res}     285      0      1      0.0340    0.0108     0.0183    0.0632
{txt} 3.072 {res}     284      0      1      0.0340    0.0108     0.0183    0.0632
{txt} 3.148 {res}     283      1      0      0.0376    0.0113     0.0208    0.0678
{txt} 3.199 {res}     282      1      0      0.0411    0.0119     0.0233    0.0724
{txt} 3.212 {res}     281      1      0      0.0447    0.0124     0.0259    0.0769
{txt} 3.353 {res}     280      0      1      0.0447    0.0124     0.0259    0.0769
{txt} 3.396 {res}     279      0      1      0.0447    0.0124     0.0259    0.0769
{txt} 3.456 {res}     278      1      0      0.0483    0.0129     0.0286    0.0815
{txt} 3.474 {res}     277      0      1      0.0483    0.0129     0.0286    0.0815
{txt} 3.616 {res}     276      1      0      0.0519    0.0134     0.0313    0.0861
{txt} 3.704 {res}     275      1      0      0.0555    0.0139     0.0340    0.0906
{txt}  3.79 {res}     274      0      1      0.0555    0.0139     0.0340    0.0906
{txt} 3.901 {res}     273      1      0      0.0592    0.0144     0.0368    0.0952
{txt} 3.989 {res}     272      1      0      0.0629    0.0148     0.0396    0.0998
{txt}  4.01 {res}     271      1      0      0.0665    0.0153     0.0424    0.1044
{txt} 4.051 {res}     270      0      1      0.0665    0.0153     0.0424    0.1044
{txt} 4.138 {res}     269      0      1      0.0665    0.0153     0.0424    0.1044
{txt} 4.196 {res}     268      0      1      0.0665    0.0153     0.0424    0.1044
{txt} 4.221 {res}     267      1      0      0.0703    0.0157     0.0453    0.1090
{txt} 4.346 {res}     266      1      0      0.0740    0.0162     0.0483    0.1136
{txt} 4.504 {res}     265      0      1      0.0740    0.0162     0.0483    0.1136
{txt} 4.831 {res}     264      1      0      0.0778    0.0166     0.0512    0.1183
{txt} 4.894 {res}     263      1      0      0.0816    0.0170     0.0542    0.1229
{txt} 4.912 {res}     262      1      0      0.0855    0.0175     0.0573    0.1275
{txt}  4.99 {res}     261      1      0      0.0893    0.0179     0.0603    0.1322
{txt}  5.03 {res}     260      0      1      0.0893    0.0179     0.0603    0.1322
{txt} 5.176 {res}     259      1      0      0.0931    0.0183     0.0634    0.1369
{txt} 5.393 {res}     258      1      0      0.0970    0.0187     0.0665    0.1415
{txt} 5.806 {res}     257      1      0      0.1009    0.0191     0.0696    0.1462
{txt} 5.826 {res}     256      0      1      0.1009    0.0191     0.0696    0.1462
{txt} 5.899 {res}     255      1      0      0.1048    0.0195     0.0728    0.1509
{txt} 5.908 {res}     254      0      1      0.1048    0.0195     0.0728    0.1509
{txt} 6.089 {res}     253      1      0      0.1088    0.0199     0.0760    0.1557
{txt} 6.272 {res}     252      1      0      0.1128    0.0203     0.0793    0.1604
{txt} 6.423 {res}     251      1      0      0.1167    0.0207     0.0825    0.1652
{txt} 6.441 {res}     250      1      0      0.1207    0.0211     0.0858    0.1699
{txt} 6.517 {res}     249      1      0      0.1248    0.0214     0.0891    0.1747
{txt} 6.869 {res}     248      0      1      0.1248    0.0214     0.0891    0.1747
{txt} 6.884 {res}     247      1      0      0.1288    0.0218     0.0924    0.1795
{txt} 6.907 {res}     246      1      0      0.1329    0.0222     0.0958    0.1843
{txt} 6.919 {res}     245      1      0      0.1370    0.0226     0.0992    0.1891
{txt} 6.951 {res}     244      1      0      0.1411    0.0229     0.1026    0.1940
{txt} 7.273 {res}     243      1      0      0.1452    0.0233     0.1060    0.1988
{txt} 7.295 {res}     242      1      0      0.1493    0.0237     0.1094    0.2037
{txt} 7.295 {res}     241      1      0      0.1534    0.0240     0.1129    0.2085
{txt} 7.441 {res}     240      1      0      0.1576    0.0244     0.1164    0.2134
{txt} 7.508 {res}     239      1      0      0.1618    0.0247     0.1199    0.2183
{txt} 7.523 {res}     238      1      0      0.1660    0.0251     0.1234    0.2232
{txt} 7.536 {res}     237      0      1      0.1660    0.0251     0.1234    0.2232
{txt} 7.566 {res}     236      0      1      0.1660    0.0251     0.1234    0.2232
{txt} 7.821 {res}     235      1      0      0.1703    0.0254     0.1270    0.2282
{txt} 7.914 {res}     234      1      0      0.1745    0.0258     0.1306    0.2332
{txt} 7.962 {res}     233      1      0      0.1788    0.0262     0.1342    0.2382
{txt} 8.119 {res}     232      1      0      0.1831    0.0265     0.1379    0.2432
{txt} 8.238 {res}     231      1      0      0.1875    0.0269     0.1416    0.2482
{txt} 8.238 {res}     230      1      0      0.1918    0.0272     0.1452    0.2533
{txt}  8.32 {res}     229      1      0      0.1962    0.0276     0.1490    0.2584
{txt} 8.372 {res}     228      1      0      0.2006    0.0279     0.1527    0.2634
{txt}  8.39 {res}     227      1      0      0.2050    0.0283     0.1564    0.2685
{txt} 8.481 {res}     226      0      1      0.2050    0.0283     0.1564    0.2685
{txt} 8.599 {res}     225      0      1      0.2050    0.0283     0.1564    0.2685
{txt} 8.603 {res}     224      1      0      0.2094    0.0286     0.1602    0.2737
{txt} 8.638 {res}     223      1      0      0.2139    0.0290     0.1641    0.2789
{txt} 8.732 {res}     222      1      0      0.2184    0.0293     0.1679    0.2841
{txt} 8.787 {res}     221      0      1      0.2184    0.0293     0.1679    0.2841
{txt} 8.842 {res}     220      0      1      0.2184    0.0293     0.1679    0.2841
{txt} 8.926 {res}     219      1      0      0.2230    0.0297     0.1718    0.2894
{txt} 8.951 {res}     218      1      0      0.2276    0.0300     0.1757    0.2947
{txt} 9.139 {res}     217      1      0      0.2322    0.0304     0.1797    0.3000
{txt} 9.181 {res}     216      1      0      0.2368    0.0307     0.1837    0.3053
{txt} 9.487 {res}     215      1      0      0.2415    0.0311     0.1877    0.3107
{txt} 9.566 {res}     214      0      1      0.2415    0.0311     0.1877    0.3107
{txt} 9.705 {res}     213      0      1      0.2415    0.0311     0.1877    0.3107
{txt} 9.904 {res}     212      1      0      0.2462    0.0314     0.1917    0.3161
{txt} 10.01 {res}     211      0      1      0.2462    0.0314     0.1917    0.3161
{txt} 10.01 {res}     210      1      0      0.2509    0.0318     0.1958    0.3216
{txt} 10.17 {res}     209      1      0      0.2557    0.0321     0.1999    0.3271
{txt} 10.22 {res}     208      0      1      0.2557    0.0321     0.1999    0.3271
{txt} 10.25 {res}     207      1      0      0.2606    0.0325     0.2041    0.3327
{txt} 10.27 {res}     206      0      1      0.2606    0.0325     0.2041    0.3327
{txt}  10.3 {res}     205      0      1      0.2606    0.0325     0.2041    0.3327
{txt} 10.31 {res}     204      1      0      0.2655    0.0329     0.2083    0.3384
{txt} 10.33 {res}     203      0      1      0.2655    0.0329     0.2083    0.3384
{txt} 10.51 {res}     202      1      0      0.2704    0.0332     0.2125    0.3441
{txt} 10.54 {res}     201      1      0      0.2754    0.0336     0.2168    0.3498
{txt} 10.56 {res}     200      1      0      0.2804    0.0340     0.2211    0.3555
{txt} 10.67 {res}     199      0      1      0.2804    0.0340     0.2211    0.3555
{txt} 10.68 {res}     198      1      0      0.2854    0.0343     0.2255    0.3614
{txt} 10.72 {res}     197      1      0      0.2905    0.0347     0.2298    0.3672
{txt} 10.74 {res}     196      0      1      0.2905    0.0347     0.2298    0.3672
{txt} 10.79 {res}     195      0      1      0.2905    0.0347     0.2298    0.3672
{txt} 10.83 {res}     194      0      1      0.2905    0.0347     0.2298    0.3672
{txt} 10.84 {res}     193      0      1      0.2905    0.0347     0.2298    0.3672
{txt} 10.91 {res}     192      1      0      0.2957    0.0351     0.2343    0.3732
{txt} 10.93 {res}     191      1      0      0.3010    0.0355     0.2388    0.3792
{txt} 11.05 {res}     190      1      0      0.3062    0.0359     0.2434    0.3853
{txt} 11.07 {res}     189      1      0      0.3115    0.0363     0.2479    0.3914
{txt} 11.07 {res}     188      1      0      0.3168    0.0367     0.2525    0.3975
{txt} 11.08 {res}     187      0      1      0.3168    0.0367     0.2525    0.3975
{txt} 11.15 {res}     186      1      0      0.3222    0.0371     0.2572    0.4037
{txt} 11.28 {res}     185      0      1      0.3222    0.0371     0.2572    0.4037
{txt} 11.29 {res}     184      0      1      0.3222    0.0371     0.2572    0.4037
{txt} 11.36 {res}     183      1      0      0.3277    0.0375     0.2619    0.4099
{txt} 11.46 {res}     182      0      1      0.3277    0.0375     0.2619    0.4099
{txt} 11.61 {res}     181      1      0      0.3332    0.0379     0.2667    0.4163
{txt} 11.63 {res}     180      1      0      0.3387    0.0383     0.2715    0.4227
{txt} 11.69 {res}     179      1      0      0.3443    0.0387     0.2763    0.4291
{txt} 11.71 {res}     178      1      0      0.3500    0.0391     0.2812    0.4356
{txt} 11.79 {res}     177      1      0      0.3556    0.0395     0.2861    0.4421
{txt}  11.8 {res}     176      1      0      0.3613    0.0399     0.2910    0.4486
{txt} 11.99 {res}     175      1      0      0.3670    0.0403     0.2959    0.4551
{txt} 12.04 {res}     174      1      0      0.3727    0.0407     0.3009    0.4617
{txt} 12.11 {res}     173      0      1      0.3727    0.0407     0.3009    0.4617
{txt} 12.11 {res}     172      0      1      0.3727    0.0407     0.3009    0.4617
{txt} 12.21 {res}     171      0      1      0.3727    0.0407     0.3009    0.4617
{txt}  12.3 {res}     170      1      0      0.3786    0.0411     0.3060    0.4685
{txt} 12.43 {res}     169      1      0      0.3845    0.0415     0.3112    0.4752
{txt} 12.44 {res}     168      1      0      0.3905    0.0420     0.3163    0.4821
{txt} 12.46 {res}     167      1      0      0.3965    0.0424     0.3215    0.4889
{txt} 12.61 {res}     166      0      1      0.3965    0.0424     0.3215    0.4889
{txt} 12.63 {res}     165      1      0      0.4025    0.0428     0.3268    0.4959
{txt} 12.63 {res}     164      1      0      0.4086    0.0433     0.3321    0.5029
{txt} 12.78 {res}     163      1      0      0.4148    0.0437     0.3374    0.5099
{txt} 12.79 {res}     162      0      1      0.4148    0.0437     0.3374    0.5099
{txt} 12.79 {res}     161      1      0      0.4210    0.0441     0.3428    0.5170
{txt} 12.86 {res}     160      0      1      0.4210    0.0441     0.3428    0.5170
{txt} 12.88 {res}     159      1      0      0.4273    0.0446     0.3483    0.5242
{txt} 12.91 {res}     158      1      0      0.4336    0.0450     0.3538    0.5315
{txt} 12.98 {res}     157      1      0      0.4400    0.0455     0.3593    0.5388
{txt} 13.11 {res}     156      1      0      0.4464    0.0459     0.3649    0.5461
{txt} 13.15 {res}     155      1      0      0.4528    0.0464     0.3705    0.5535
{txt} 13.17 {res}     154      0      1      0.4528    0.0464     0.3705    0.5535
{txt} 13.23 {res}     153      1      0      0.4594    0.0468     0.3762    0.5610
{txt} 13.24 {res}     152      0      1      0.4594    0.0468     0.3762    0.5610
{txt} 13.26 {res}     151      1      0      0.4660    0.0473     0.3819    0.5686
{txt} 13.53 {res}     150      1      0      0.4727    0.0478     0.3877    0.5762
{txt}  13.7 {res}     149      0      1      0.4727    0.0478     0.3877    0.5762
{txt} 13.74 {res}     148      1      0      0.4794    0.0482     0.3936    0.5839
{txt} 13.75 {res}     147      1      0      0.4862    0.0487     0.3995    0.5917
{txt}  13.8 {res}     146      1      0      0.4931    0.0492     0.4055    0.5996
{txt}  13.8 {res}     145      1      0      0.5000    0.0497     0.4115    0.6075
{txt} 13.88 {res}     144      1      0      0.5069    0.0502     0.4175    0.6154
{txt}  13.9 {res}     143      1      0      0.5139    0.0506     0.4236    0.6234
{txt} 13.95 {res}     142      1      0      0.5210    0.0511     0.4298    0.6315
{txt} 14.07 {res}     141      1      0      0.5280    0.0516     0.4360    0.6396
{txt} 14.16 {res}     140      0      1      0.5280    0.0516     0.4360    0.6396
{txt} 14.19 {res}     139      1      0      0.5352    0.0521     0.4422    0.6478
{txt} 14.25 {res}     138      1      0      0.5425    0.0526     0.4486    0.6561
{txt}  14.3 {res}     137      0      1      0.5425    0.0526     0.4486    0.6561
{txt} 14.32 {res}     136      1      0      0.5498    0.0531     0.4550    0.6645
{txt} 14.44 {res}     135      1      0      0.5572    0.0537     0.4614    0.6730
{txt} 14.57 {res}     134      1      0      0.5647    0.0542     0.4679    0.6815
{txt}  14.6 {res}     133      0      1      0.5647    0.0542     0.4679    0.6815
{txt} 14.65 {res}     132      1      0      0.5723    0.0547     0.4745    0.6902
{txt} 14.68 {res}     131      1      0      0.5799    0.0552     0.4812    0.6989
{txt} 14.75 {res}     130      1      0      0.5876    0.0558     0.4879    0.7077
{txt} 14.75 {res}     129      0      1      0.5876    0.0558     0.4879    0.7077
{txt} 14.87 {res}     128      1      0      0.5954    0.0563     0.4947    0.7167
{txt} 14.93 {res}     127      0      1      0.5954    0.0563     0.4947    0.7167
{txt} 14.95 {res}     126      1      0      0.6034    0.0569     0.5016    0.7258
{txt} 15.02 {res}     125      1      0      0.6114    0.0574     0.5086    0.7349
{txt} 15.06 {res}     124      0      1      0.6114    0.0574     0.5086    0.7349
{txt} 15.13 {res}     123      1      0      0.6195    0.0580     0.5156    0.7442
{txt} 15.19 {res}     122      0      1      0.6195    0.0580     0.5156    0.7442
{txt}  15.2 {res}     121      1      0      0.6278    0.0586     0.5228    0.7537
{txt} 15.28 {res}     120      1      0      0.6361    0.0592     0.5301    0.7633
{txt} 15.33 {res}     119      1      0      0.6445    0.0598     0.5374    0.7729
{txt} 15.36 {res}     118      1      0      0.6530    0.0604     0.5448    0.7827
{txt} 15.38 {res}     117      1      0      0.6615    0.0610     0.5522    0.7925
{txt} 15.62 {res}     116      1      0      0.6701    0.0616     0.5597    0.8023
{txt} 15.93 {res}     115      0      1      0.6701    0.0616     0.5597    0.8023
{txt}    16 {res}     114      0      1      0.6701    0.0616     0.5597    0.8023
{txt}    16 {res}     113      1      0      0.6790    0.0622     0.5674    0.8125
{txt} 16.06 {res}     112      1      0      0.6879    0.0628     0.5751    0.8228
{txt} 16.14 {res}     111      1      0      0.6969    0.0635     0.5830    0.8331
{txt} 16.14 {res}     110      1      0      0.7060    0.0641     0.5909    0.8436
{txt} 16.16 {res}     109      0      1      0.7060    0.0641     0.5909    0.8436
{txt} 16.16 {res}     108      1      0      0.7153    0.0648     0.5989    0.8542
{txt} 16.17 {res}     107      1      0      0.7246    0.0655     0.6070    0.8650
{txt} 16.22 {res}     106      1      0      0.7340    0.0661     0.6152    0.8758
{txt} 16.23 {res}     105      0      1      0.7340    0.0661     0.6152    0.8758
{txt} 16.27 {res}     104      1      0      0.7437    0.0668     0.6236    0.8869
{txt} 16.39 {res}     103      0      1      0.7437    0.0668     0.6236    0.8869
{txt}  16.4 {res}     102      1      0      0.7535    0.0676     0.6321    0.8982
{txt} 16.46 {res}     101      1      0      0.7634    0.0683     0.6406    0.9096
{txt} 16.52 {res}     100      1      0      0.7734    0.0690     0.6493    0.9212
{txt} 16.61 {res}      99      1      0      0.7835    0.0697     0.6580    0.9328
{txt} 16.86 {res}      98      1      0      0.7937    0.0705     0.6669    0.9446
{txt}  16.9 {res}      97      1      0      0.8040    0.0712     0.6758    0.9564
{txt}  16.9 {res}      96      1      0      0.8144    0.0720     0.6849    0.9684
{txt} 16.96 {res}      95      1      0      0.8249    0.0728     0.6940    0.9806
{txt} 17.07 {res}      94      1      0      0.8356    0.0735     0.7032    0.9928
{txt} 17.15 {res}      93      1      0      0.8463    0.0743     0.7125    1.0052
{txt} 17.17 {res}      92      0      1      0.8463    0.0743     0.7125    1.0052
{txt} 17.21 {res}      91      1      0      0.8573    0.0751     0.7220    1.0179
{txt} 17.27 {res}      90      1      0      0.8684    0.0759     0.7316    1.0308
{txt} 17.27 {res}      89      1      0      0.8797    0.0768     0.7414    1.0437
{txt} 17.33 {res}      88      0      1      0.8797    0.0768     0.7414    1.0437
{txt} 17.42 {res}      87      0      1      0.8797    0.0768     0.7414    1.0437
{txt} 17.42 {res}      86      1      0      0.8913    0.0776     0.7514    1.0572
{txt} 17.43 {res}      85      0      1      0.8913    0.0776     0.7514    1.0572
{txt} 17.45 {res}      84      0      1      0.8913    0.0776     0.7514    1.0572
{txt}  17.7 {res}      83      1      0      0.9033    0.0786     0.7618    1.0712
{txt} 17.74 {res}      82      1      0      0.9155    0.0795     0.7722    1.0854
{txt} 17.87 {res}      81      0      1      0.9155    0.0795     0.7722    1.0854
{txt} 17.91 {res}      80      1      0      0.9280    0.0805     0.7830    1.1000
{txt} 18.16 {res}      79      1      0      0.9407    0.0815     0.7938    1.1147
{txt} 18.35 {res}      78      0      1      0.9407    0.0815     0.7938    1.1147
{txt} 18.48 {res}      77      1      0      0.9537    0.0825     0.8049    1.1299
{txt} 18.59 {res}      76      0      1      0.9537    0.0825     0.8049    1.1299
{txt} 18.63 {res}      75      1      0      0.9670    0.0836     0.8163    1.1455
{txt} 18.65 {res}      74      1      0      0.9805    0.0847     0.8279    1.1613
{txt} 18.72 {res}      73      0      1      0.9805    0.0847     0.8279    1.1613
{txt} 18.76 {res}      72      1      0      0.9944    0.0858     0.8397    1.1776
{txt} 18.88 {res}      71      0      1      0.9944    0.0858     0.8397    1.1776
{txt} 18.91 {res}      70      1      0      1.0087    0.0870     0.8519    1.1944
{txt} 18.92 {res}      69      1      0      1.0232    0.0882     0.8642    1.2114
{txt} 18.95 {res}      68      0      1      1.0232    0.0882     0.8642    1.2114
{txt} 19.23 {res}      67      0      1      1.0232    0.0882     0.8642    1.2114
{txt} 19.27 {res}      66      1      0      1.0383    0.0895     0.8770    1.2293
{txt} 19.28 {res}      65      1      0      1.0537    0.0908     0.8900    1.2475
{txt} 19.44 {res}      64      0      1      1.0537    0.0908     0.8900    1.2475
{txt} 19.62 {res}      63      0      1      1.0537    0.0908     0.8900    1.2475
{txt} 19.71 {res}      62      0      1      1.0537    0.0908     0.8900    1.2475
{txt}    20 {res}      61      1      0      1.0701    0.0922     0.9038    1.2671
{txt} 20.11 {res}      60      1      0      1.0868    0.0937     0.9177    1.2869
{txt} 20.26 {res}      59      1      0      1.1037    0.0953     0.9320    1.3071
{txt} 20.54 {res}      58      1      0      1.1210    0.0968     0.9464    1.3277
{txt} 20.73 {res}      57      0      1      1.1210    0.0968     0.9464    1.3277
{txt} 20.84 {res}      56      1      0      1.1388    0.0984     0.9614    1.3491
{txt} 20.86 {res}      55      1      0      1.1570    0.1001     0.9765    1.3708
{txt} 20.92 {res}      54      0      1      1.1570    0.1001     0.9765    1.3708
{txt} 21.18 {res}      53      1      0      1.1759    0.1019     0.9923    1.3935
{txt} 21.28 {res}      52      0      1      1.1759    0.1019     0.9923    1.3935
{txt} 21.32 {res}      51      1      0      1.1955    0.1037     1.0085    1.4171
{txt} 21.49 {res}      50      1      0      1.2155    0.1056     1.0251    1.4412
{txt}  21.5 {res}      49      1      0      1.2359    0.1076     1.0420    1.4658
{txt} 21.58 {res}      48      1      0      1.2567    0.1096     1.0593    1.4910
{txt} 21.77 {res}      47      1      0      1.2780    0.1116     1.0769    1.5167
{txt} 22.07 {res}      46      1      0      1.2997    0.1137     1.0949    1.5429
{txt} 22.35 {res}      45      0      1      1.2997    0.1137     1.0949    1.5429
{txt}  22.4 {res}      44      0      1      1.2997    0.1137     1.0949    1.5429
{txt} 22.58 {res}      43      0      1      1.2997    0.1137     1.0949    1.5429
{txt} 22.61 {res}      42      1      0      1.3236    0.1162     1.1143    1.5721
{txt} 22.95 {res}      41      1      0      1.3479    0.1187     1.1342    1.6020
{txt} 23.36 {res}      40      1      0      1.3729    0.1213     1.1546    1.6326
{txt} 23.43 {res}      39      0      1      1.3729    0.1213     1.1546    1.6326
{txt} 23.51 {res}      38      1      0      1.3993    0.1242     1.1759    1.6651
{txt} 23.58 {res}      37      0      1      1.3993    0.1242     1.1759    1.6651
{txt} 23.62 {res}      36      1      0      1.4270    0.1272     1.1982    1.6995
{txt} 23.76 {res}      35      0      1      1.4270    0.1272     1.1982    1.6995
{txt}  23.9 {res}      34      1      0      1.4564    0.1306     1.2217    1.7363
{txt} 24.22 {res}      33      1      0      1.4867    0.1341     1.2459    1.7741
{txt} 24.55 {res}      32      0      1      1.4867    0.1341     1.2459    1.7741
{txt} 25.07 {res}      31      0      1      1.4867    0.1341     1.2459    1.7741
{txt} 25.18 {res}      30      0      1      1.4867    0.1341     1.2459    1.7741
{txt} 25.32 {res}      29      1      0      1.5212    0.1384     1.2728    1.8182
{txt} 25.67 {res}      28      1      0      1.5569    0.1430     1.3005    1.8639
{txt} 26.39 {res}      27      1      0      1.5940    0.1477     1.3293    1.9114
{txt} 26.57 {res}      26      1      0      1.6324    0.1526     1.3592    1.9607
{txt} 26.59 {res}      25      0      1      1.6324    0.1526     1.3592    1.9607
{txt} 26.59 {res}      24      1      0      1.6741    0.1582     1.3911    2.0147
{txt} 26.84 {res}      23      1      0      1.7176    0.1641     1.4244    2.0712
{txt} 26.89 {res}      22      1      0      1.7630    0.1702     1.4591    2.1304
{txt} 27.17 {res}      21      1      0      1.8107    0.1768     1.4953    2.1925
{txt} 27.27 {res}      20      1      0      1.8607    0.1837     1.5333    2.2579
{txt} 27.47 {res}      19      1      0      1.9133    0.1911     1.5731    2.3270
{txt} 27.55 {res}      18      1      0      1.9689    0.1990     1.6150    2.4002
{txt} 27.88 {res}      17      1      0      2.0277    0.2075     1.6591    2.4781
{txt} 28.64 {res}      16      0      1      2.0277    0.2075     1.6591    2.4781
{txt} 28.64 {res}      15      1      0      2.0943    0.2180     1.7079    2.5682
{txt} 28.98 {res}      14      0      1      2.0943    0.2180     1.7079    2.5682
{txt} 29.53 {res}      13      1      0      2.1713    0.2311     1.7624    2.6750
{txt}  30.2 {res}      12      1      0      2.2546    0.2457     1.8210    2.7915
{txt}  30.2 {res}      11      1      0      2.3455    0.2620     1.8844    2.9195
{txt} 30.21 {res}      10      1      0      2.4455    0.2804     1.9533    3.0618
{txt} 30.56 {res}       9      0      1      2.4455    0.2804     1.9533    3.0618
{txt} 30.81 {res}       8      1      0      2.5705    0.3070     2.0340    3.2485
{txt} 35.89 {res}       7      1      0      2.7134    0.3386     2.1246    3.4653
{txt} 36.96 {res}       6      1      0      2.8800    0.3774     2.2277    3.7234
{txt} 37.88 {res}       5      1      0      3.0800    0.4271     2.3470    4.0420
{txt} 39.12 {res}       4      1      0      3.3300    0.4949     2.4885    4.4561
{txt}  39.4 {res}       3      1      0      3.6634    0.5967     2.6622    5.0411
{txt} 41.99 {res}       2      1      0      4.1634    0.7785     2.8859    6.0063
{txt} 45.46 {res}       1      1      0      5.1634    1.2673     3.1916    8.3532
{txt}{hline 72}

{com}. sts graph, cumhaz ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph, hazard ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. 
. *EJERCICIO 3*
. 
. sts graph if (rad==1), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph if (rad==0), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. 
. sts graph if (chemo==1), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph if (chemo==0), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. 
. *EJERCICIO 4*
. 
. generate terapy=.
{txt}(300 missing values generated)

{com}. replace terapy=1 if (rad==0 & chemo==0)
{txt}(71 real changes made)

{com}. replace terapy=2 if (rad==0 & chemo==1)
{txt}(77 real changes made)

{com}. replace terapy=3 if (rad==1 & chemo==0)
{txt}(64 real changes made)

{com}. replace terapy=4 if (rad==1 & chemo==1)
{txt}(88 real changes made)

{com}. 
. sts graph if (terapy==1), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph if (terapy==2), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph if (terapy==3), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. sts graph if (terapy==4), survival ci

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}months
{txt}
{com}. 
. *EJERCICIO 5*
. 
. sts generate surv=s
{txt}
{com}. *ranksum s, by(terapy)
. ranksum s, by(rad)

{txt}Two-sample Wilcoxon rank-sum (Mann–Whitney) test

         rad {c |}      Obs    Rank sum    Expected
{hline 13}{c +}{hline 33}
          no {c |}{res}{col 17}    148{col 26}   24781.5{col 38}     22274
         {txt}yes {c |}{res}{col 17}    152{col 26}   20368.5{col 38}     22876
{txt}{hline 13}{c +}{hline 33}
    Combined {c |}{res}{col 17}    300{col 26}     45150{col 38}     45150

{txt}Unadjusted variance{col 22}{res} 564274.67
{txt}Adjustment for ties{col 22}{res}    -22.82
{txt}{col 22}{hline 10}
Adjusted variance{col 22}{res} 564251.84

{txt}H0: surv(rad==no) = surv(rad==yes)
{col 10}z = {res}{ralign 6:3.338}
{txt}{col 1}Prob > |z| = {res}{ralign 6:0.0008}

{txt}Note: Exact p-value is not computed by default for sample sizes > 200.
      Use option {bf:exact} to compute it.

{com}. ranksum s, by(chemo)

{txt}Two-sample Wilcoxon rank-sum (Mann–Whitney) test

       chemo {c |}      Obs    Rank sum    Expected
{hline 13}{c +}{hline 33}
          no {c |}{res}{col 17}    135{col 26}     27241{col 38}   20317.5
         {txt}yes {c |}{res}{col 17}    165{col 26}     17909{col 38}   24832.5
{txt}{hline 13}{c +}{hline 33}
    Combined {c |}{res}{col 17}    300{col 26}     45150{col 38}     45150

{txt}Unadjusted variance{col 22}{res} 558731.25
{txt}Adjustment for ties{col 22}{res}    -22.60
{txt}{col 22}{hline 10}
Adjusted variance{col 22}{res} 558708.65

{txt}H0: surv(chemo==no) = surv(chemo==yes)
{col 10}z = {res}{ralign 6:9.263}
{txt}{col 1}Prob > |z| = {res}{ralign 6:0.0000}

{txt}Note: Exact p-value is not computed by default for sample sizes > 200.
      Use option {bf:exact} to compute it.

{com}. 
. 
. ********************************************************************************
.                 * ESTIMANDO UN MODELO DE COX (COX PROPORTIONAL HAZARD MODEL) *
. ********************************************************************************
. 
. 
. local vars="age rad chemo"
{txt}
{com}. 
. *EJERCICIO 1*
. 
. stset days, fail(died=1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(0, days]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}        300{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}        300{txt}  observations remaining, representing
{res}        207{txt}  failures in single-record/single-failure data
{res}    127,744{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}    1,363
{txt}
{com}. stdescribe

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}       300   
{txt}Number of records     {res}       300           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res} 425.8133           7        401       1363

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res}    127744    425.8133           7        401       1363

{txt}Failures              {res}       207         .69           0          1          1
{txt}{hline 78}

{com}. stsum

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res}     127,744   .0016204{col 40}      300        321       484       705
{txt}
{com}. 
. stcox `vars', nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-932.64981
{txt}Iteration 2:   log likelihood = {res}-931.61152
{txt}Iteration 3:   log likelihood = {res} -931.6115
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -931.6115

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:3})} = {res}{ralign 6:72.93}
{txt}Log likelihood = {res}-931.6115{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1045706{col 26}{space 2} .0273839{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .0508991{col 67}{space 3} .1582422
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.2917368{col 26}{space 2} .1466947{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.5792531{col 67}{space 3}-.0042204
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-1.233281{col 26}{space 2} .1649521{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4}-1.556581{col 67}{space 3}-.9099809
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcox `vars'

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-932.64981
{txt}Iteration 2:   log likelihood = {res}-931.61152
{txt}Iteration 3:   log likelihood = {res} -931.6115
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -931.6115

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:3})} = {res}{ralign 6:72.93}
{txt}Log likelihood = {res}-931.6115{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.110234{col 26}{space 2} .0304026{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} 1.052217{col 67}{space 3}  1.17145
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .7469651{col 26}{space 2} .1095758{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4} .5603167{col 67}{space 3} .9957885
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .2913351{col 26}{space 2} .0480563{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4} .2108557{col 67}{space 3} .4025319
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_cox1
{txt}
{com}. 
. *EJERCICIO 2*
. 
. xi: stcox `vars' i.clinic, nohr
{txt}i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-926.47226
{txt}Iteration 2:   log likelihood = {res}-925.31362
{txt}Iteration 3:   log likelihood = {res} -925.3136
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -925.3136

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:9})} = {res}{ralign 6:85.52}
{txt}Log likelihood = {res}-925.3136{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1156871{col 26}{space 2} .0280631{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4} .0606844{col 67}{space 3} .1706899
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.2796114{col 26}{space 2}  .148758{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.5711717{col 67}{space 3} .0119488
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-1.254296{col 26}{space 2} .1675252{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-1.582639{col 67}{space 3}-.9259523
{txt}{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2}-.4824995{col 26}{space 2} .2881326{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4}-1.047229{col 67}{space 3} .0822301
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}-.0506161{col 26}{space 2} .2554809{col 37}{space 1}   -0.20{col 46}{space 3}0.843{col 54}{space 4}-.5513494{col 67}{space 3} .4501171
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2}-.2359797{col 26}{space 2} .2552263{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-.7362141{col 67}{space 3} .2642547
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2}-.0951635{col 26}{space 2} .2496705{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-.5845086{col 67}{space 3} .3941817
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2}-.3706164{col 26}{space 2}  .267898{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-.8956869{col 67}{space 3} .1544541
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2}-.7563722{col 26}{space 2} .2692629{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-1.284118{col 67}{space 3}-.2286267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. xi: stcox `vars' i.clinic
{txt}i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-926.47226
{txt}Iteration 2:   log likelihood = {res}-925.31362
{txt}Iteration 3:   log likelihood = {res} -925.3136
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -925.3136

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:9})} = {res}{ralign 6:85.52}
{txt}Log likelihood = {res}-925.3136{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.122645{col 26}{space 2} .0315049{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4} 1.062564{col 67}{space 3} 1.186123
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .7560775{col 26}{space 2} .1124726{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4} .5648632{col 67}{space 3} 1.012021
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .2852767{col 26}{space 2}  .047791{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4} .2054322{col 67}{space 3}  .396154
{txt}{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2} .6172387{col 26}{space 2} .1778466{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4} .3509087{col 67}{space 3} 1.085706
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2} .9506435{col 26}{space 2} .2428712{col 37}{space 1}   -0.20{col 46}{space 3}0.843{col 54}{space 4} .5761718{col 67}{space 3} 1.568496
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2} .7897967{col 26}{space 2} .2015769{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4} .4789236{col 67}{space 3}  1.30246
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2} .9092243{col 26}{space 2} .2270065{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4} .5573797{col 67}{space 3}  1.48317
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2} .6903087{col 26}{space 2} .1849323{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}  .408327{col 67}{space 3} 1.167021
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2} .4693661{col 26}{space 2} .1263829{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4} .2768947{col 67}{space 3} .7956255
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_cox2
{txt}
{com}. 
. *EJERCICIO 3*
. 
. test _Iclinic_2 _Iclinic_3 _Iclinic_4 _Iclinic_5 _Iclinic_6 _Iclinic_7

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_Iclinic_2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} _Iclinic_3 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} _Iclinic_4 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} _Iclinic_5 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} _Iclinic_6 = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} _Iclinic_7 = 0{p_end}

{txt}{col 12}chi2(  6) ={res}   11.85
{txt}{col 10}Prob > chi2 =  {res}  0.0654
{txt}
{com}. lrtest est_cox1 est_cox2

{txt}Likelihood-ratio test
Assumption: {res}{stata est replay est_cox1:est_cox1}{txt} nested within {res}{stata est replay est_cox2:est_cox2}

{txt}{ralign 11:LR chi2({res:6})} = {res}{ralign 6:12.60}
{txt}{ralign 11:Prob > chi2} = {res}{ralign 6:0.0499}
{txt}
{com}. 
. stcox `vars', nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-932.64981
{txt}Iteration 2:   log likelihood = {res}-931.61152
{txt}Iteration 3:   log likelihood = {res} -931.6115
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -931.6115

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:3})} = {res}{ralign 6:72.93}
{txt}Log likelihood = {res}-931.6115{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1045706{col 26}{space 2} .0273839{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} .0508991{col 67}{space 3} .1582422
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.2917368{col 26}{space 2} .1466947{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.5792531{col 67}{space 3}-.0042204
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-1.233281{col 26}{space 2} .1649521{col 37}{space 1}   -7.48{col 46}{space 3}0.000{col 54}{space 4}-1.556581{col 67}{space 3}-.9099809
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-968.0752{col 39}-931.6115{col 50}     3{col 58} 1869.223{col 69} 1880.334
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. local aic_s=r(S)[1,5]
{txt}
{com}. xi: stcox `vars' i.clinic, nohr
{txt}i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-926.47226
{txt}Iteration 2:   log likelihood = {res}-925.31362
{txt}Iteration 3:   log likelihood = {res} -925.3136
{txt}Refining estimates:
Iteration 0:   log likelihood = {res} -925.3136

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:9})} = {res}{ralign 6:85.52}
{txt}Log likelihood = {res}-925.3136{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1156871{col 26}{space 2} .0280631{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4} .0606844{col 67}{space 3} .1706899
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.2796114{col 26}{space 2}  .148758{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.5711717{col 67}{space 3} .0119488
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-1.254296{col 26}{space 2} .1675252{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-1.582639{col 67}{space 3}-.9259523
{txt}{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2}-.4824995{col 26}{space 2} .2881326{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4}-1.047229{col 67}{space 3} .0822301
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}-.0506161{col 26}{space 2} .2554809{col 37}{space 1}   -0.20{col 46}{space 3}0.843{col 54}{space 4}-.5513494{col 67}{space 3} .4501171
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2}-.2359797{col 26}{space 2} .2552263{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-.7362141{col 67}{space 3} .2642547
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2}-.0951635{col 26}{space 2} .2496705{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-.5845086{col 67}{space 3} .3941817
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2}-.3706164{col 26}{space 2}  .267898{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-.8956869{col 67}{space 3} .1544541
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2}-.7563722{col 26}{space 2} .2692629{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-1.284118{col 67}{space 3}-.2286267
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-968.0752{col 39}-925.3136{col 50}     9{col 58} 1868.627{col 69} 1901.961
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. local aic_c=r(S)[1,5]
{txt}
{com}. 
. display as text "El AIC del modelo más simple (sin clinic) es " as result `aic_s'
{res}{txt}El AIC del modelo más simple (sin clinic) es {res}1869.223
{txt}
{com}. display as text "El AIC del modelo más completo (con clinic) es " as result `aic_c'
{res}{txt}El AIC del modelo más completo (con clinic) es {res}1868.6272
{txt}
{com}. 
. *EJERCICIO 4*
. 
. xi: stcox age rad#chemo i.clinic, nohr
{txt}i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.62277
{txt}Iteration 2:   log likelihood = {res}-920.29293
{txt}Iteration 3:   log likelihood = {res}-920.29014
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-920.29014

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:10})} = {res}{ralign 6:95.57}
{txt}Log likelihood = {res}-920.29014{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1252957{col 26}{space 2}  .028208{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} .0700091{col 67}{space 3} .1805824
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2}-.8118311{col 26}{space 2}  .218913{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-1.240893{col 67}{space 3}-.3827696
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2} .2554841{col 26}{space 2} .2232517{col 37}{space 1}    1.14{col 46}{space 3}0.252{col 54}{space 4}-.1820812{col 67}{space 3} .6930493
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2} -1.51176{col 26}{space 2} .2268242{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-1.956327{col 67}{space 3}-1.067193
{txt}{space 12} {c |}
{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2}-.5079383{col 26}{space 2} .2887136{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-1.073807{col 67}{space 3} .0579301
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}-.1381408{col 26}{space 2} .2576148{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.6430565{col 67}{space 3} .3667748
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2}-.3703841{col 26}{space 2} .2603957{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-.8807502{col 67}{space 3} .1399821
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2}-.1969114{col 26}{space 2}  .252787{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.6923647{col 67}{space 3}  .298542
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2}-.4020562{col 26}{space 2} .2680656{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4} -.927455{col 67}{space 3} .1233427
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2}-.9039418{col 26}{space 2} .2735173{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4}-1.440026{col 67}{space 3}-.3678576
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. xi: stcox age rad#chemo i.clinic
{txt}i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.62277
{txt}Iteration 2:   log likelihood = {res}-920.29293
{txt}Iteration 3:   log likelihood = {res}-920.29014
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-920.29014

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:10})} = {res}{ralign 6:95.57}
{txt}Log likelihood = {res}-920.29014{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.133484{col 26}{space 2} .0319733{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} 1.072518{col 67}{space 3} 1.197915
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2} .4440442{col 26}{space 2}  .097207{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}  .289126{col 67}{space 3}   .68197
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2} 1.291086{col 26}{space 2} .2882372{col 37}{space 1}    1.14{col 46}{space 3}0.252{col 54}{space 4} .8335337{col 67}{space 3} 1.999804
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2} .2205216{col 26}{space 2} .0500196{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4} .1413767{col 67}{space 3} .3439728
{txt}{space 12} {c |}
{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2} .6017349{col 26}{space 2} .1737291{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4} .3417053{col 67}{space 3} 1.059641
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}  .870976{col 26}{space 2} .2243763{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4} .5256832{col 67}{space 3} 1.443073
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2} .6904691{col 26}{space 2} .1797952{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4} .4144719{col 67}{space 3} 1.150253
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2} .8212634{col 26}{space 2} .2076047{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4} .5003914{col 67}{space 3} 1.347892
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2} .6689432{col 26}{space 2} .1793206{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4} .3955591{col 67}{space 3} 1.131272
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2} .4049702{col 26}{space 2} .1107664{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4} .2369216{col 67}{space 3} .6922157
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_cox3
{txt}
{com}. 
. *EJERCICIO 5*
. 
. stcurve, hazard
{res}{txt}
{com}. 
. *EJERCICIO 6*
. 
. stcox age rad#chemo, strata(clinic) nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-580.02141
{txt}Iteration 1:   log likelihood = {res}-542.34702
{txt}Iteration 2:   log likelihood = {res}-541.46877
{txt}Iteration 3:   log likelihood = {res}-541.46723
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-541.46723

{txt}Stratified Cox regression with Breslow method for ties
Strata variable: {res:clinic}

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:4})} = {res}{ralign 6:77.11}
{txt}Log likelihood = {res}-541.46723{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}  .110702{col 26}{space 2} .0290864{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0536938{col 67}{space 3} .1677102
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2}-.8747791{col 26}{space 2} .2255114{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 54}{space 4}-1.316773{col 67}{space 3}-.4327849
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2} .1865514{col 26}{space 2} .2313938{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4} -.266972{col 67}{space 3} .6400749
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2}-1.508527{col 26}{space 2} .2349946{col 37}{space 1}   -6.42{col 46}{space 3}0.000{col 54}{space 4}-1.969108{col 67}{space 3}-1.047947
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcox age rad#chemo, strata(clinic)

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-580.02141
{txt}Iteration 1:   log likelihood = {res}-542.34702
{txt}Iteration 2:   log likelihood = {res}-541.46877
{txt}Iteration 3:   log likelihood = {res}-541.46723
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-541.46723

{txt}Stratified Cox regression with Breslow method for ties
Strata variable: {res:clinic}

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:4})} = {res}{ralign 6:77.11}
{txt}Log likelihood = {res}-541.46723{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.117062{col 26}{space 2} .0324913{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} 1.055161{col 67}{space 3} 1.182594
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2} .4169541{col 26}{space 2} .0940279{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 54}{space 4} .2679987{col 67}{space 3}    .6487
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2} 1.205087{col 26}{space 2} .2788496{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4} .7656945{col 67}{space 3} 1.896623
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2} .2212355{col 26}{space 2} .0519891{col 37}{space 1}   -6.42{col 46}{space 3}0.000{col 54}{space 4} .1395813{col 67}{space 3} .3506571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_cox4
{txt}
{com}. 
. stcox age rad#chemo chemo#clinic, nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}note: {bf:1.chemo#7.clinic} omitted because of collinearity.
Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.63079
{txt}Iteration 2:   log likelihood = {res}-918.60574
{txt}Iteration 3:   log likelihood = {res}-918.59407
{txt}Iteration 4:   log likelihood = {res}-918.59407
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-918.59407

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:16})} = {res}{ralign 6:98.96}
{txt}Log likelihood = {res}-918.59407{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1256619{col 26}{space 2} .0294777{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .0678867{col 67}{space 3} .1834371
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2}-1.769954{col 26}{space 2} .4163616{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-2.586008{col 67}{space 3}-.9539003
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2} .3499103{col 26}{space 2}  .236425{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.1134742{col 67}{space 3} .8132948
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2}-2.450626{col 26}{space 2}  .430462{col 37}{space 1}   -5.69{col 46}{space 3}0.000{col 54}{space 4}-3.294316{col 67}{space 3}-1.606936
{txt}{space 12} {c |}
chemo#clinic {c |}
{space 7}no#2  {c |}{col 14}{res}{space 2}-.4072162{col 26}{space 2} .4230318{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4}-1.236343{col 67}{space 3} .4219109
{txt}{space 7}no#3  {c |}{col 14}{res}{space 2}-.3877265{col 26}{space 2} .4126055{col 37}{space 1}   -0.94{col 46}{space 3}0.347{col 54}{space 4}-1.196418{col 67}{space 3} .4209654
{txt}{space 7}no#4  {c |}{col 14}{res}{space 2}-.6833391{col 26}{space 2} .4369149{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4}-1.539677{col 67}{space 3} .1729984
{txt}{space 7}no#5  {c |}{col 14}{res}{space 2}-.3144385{col 26}{space 2} .4064653{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}-1.111096{col 67}{space 3} .4822188
{txt}{space 7}no#6  {c |}{col 14}{res}{space 2}-.2561675{col 26}{space 2} .4422568{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-1.122975{col 67}{space 3} .6106399
{txt}{space 7}no#7  {c |}{col 14}{res}{space 2}-1.121181{col 26}{space 2} .4751976{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-2.052551{col 67}{space 3}-.1898104
{txt}{space 6}yes#1  {c |}{col 14}{res}{space 2} .8234076{col 26}{space 2} .3352236{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} .1663813{col 67}{space 3} 1.480434
{txt}{space 6}yes#2  {c |}{col 14}{res}{space 2} .1344455{col 26}{space 2} .4162758{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.6814401{col 67}{space 3}  .950331
{txt}{space 6}yes#3  {c |}{col 14}{res}{space 2} .8558539{col 26}{space 2} .3416664{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4}    .1862{col 67}{space 3} 1.525508
{txt}{space 6}yes#4  {c |}{col 14}{res}{space 2}  .641404{col 26}{space 2} .3314385{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-.0082036{col 67}{space 3} 1.291012
{txt}{space 6}yes#5  {c |}{col 14}{res}{space 2} .6625776{col 26}{space 2} .3404581{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0047081{col 67}{space 3} 1.329863
{txt}{space 6}yes#6  {c |}{col 14}{res}{space 2} .3410004{col 26}{space 2} .3441839{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4}-.3335876{col 67}{space 3} 1.015588
{txt}{space 6}yes#7  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcox age rad#chemo chemo#clinic

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}note: {bf:1.chemo#7.clinic} omitted because of collinearity.
Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.63079
{txt}Iteration 2:   log likelihood = {res}-918.60574
{txt}Iteration 3:   log likelihood = {res}-918.59407
{txt}Iteration 4:   log likelihood = {res}-918.59407
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-918.59407

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:16})} = {res}{ralign 6:98.96}
{txt}Log likelihood = {res}-918.59407{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.133899{col 26}{space 2} .0334247{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} 1.070244{col 67}{space 3} 1.201339
{txt}{space 12} {c |}
{space 3}rad#chemo {c |}
{space 5}no#yes  {c |}{col 14}{res}{space 2} .1703408{col 26}{space 2} .0709234{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4} .0753201{col 67}{space 3} .3852356
{txt}{space 5}yes#no  {c |}{col 14}{res}{space 2}  1.41894{col 26}{space 2}  .335473{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4} .8927272{col 67}{space 3} 2.255327
{txt}{space 4}yes#yes  {c |}{col 14}{res}{space 2} .0862395{col 26}{space 2} .0371228{col 37}{space 1}   -5.69{col 46}{space 3}0.000{col 54}{space 4} .0370934{col 67}{space 3} .2005009
{txt}{space 12} {c |}
chemo#clinic {c |}
{space 7}no#2  {c |}{col 14}{res}{space 2} .6655003{col 26}{space 2} .2815278{col 37}{space 1}   -0.96{col 46}{space 3}0.336{col 54}{space 4} .2904443{col 67}{space 3} 1.524873
{txt}{space 7}no#3  {c |}{col 14}{res}{space 2} .6785979{col 26}{space 2} .2799932{col 37}{space 1}   -0.94{col 46}{space 3}0.347{col 54}{space 4} .3022749{col 67}{space 3} 1.523432
{txt}{space 7}no#4  {c |}{col 14}{res}{space 2} .5049281{col 26}{space 2} .2206107{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4} .2144504{col 67}{space 3} 1.188864
{txt}{space 7}no#5  {c |}{col 14}{res}{space 2} .7301987{col 26}{space 2} .2968005{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}  .329198{col 67}{space 3} 1.619664
{txt}{space 7}no#6  {c |}{col 14}{res}{space 2} .7740123{col 26}{space 2} .3423122{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4} .3253106{col 67}{space 3} 1.841609
{txt}{space 7}no#7  {c |}{col 14}{res}{space 2} .3258948{col 26}{space 2} .1548644{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}  .128407{col 67}{space 3} .8271159
{txt}{space 6}yes#1  {c |}{col 14}{res}{space 2}  2.27825{col 26}{space 2} .7637232{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 1.181023{col 67}{space 3} 4.394852
{txt}{space 6}yes#2  {c |}{col 14}{res}{space 2} 1.143902{col 26}{space 2} .4761788{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4} .5058879{col 67}{space 3} 2.586566
{txt}{space 6}yes#3  {c |}{col 14}{res}{space 2} 2.353383{col 26}{space 2}  .804072{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} 1.204663{col 67}{space 3} 4.597478
{txt}{space 6}yes#4  {c |}{col 14}{res}{space 2} 1.899145{col 26}{space 2}   .62945{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}   .99183{col 67}{space 3} 3.636463
{txt}{space 6}yes#5  {c |}{col 14}{res}{space 2} 1.939786{col 26}{space 2} .6604159{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}  .995303{col 67}{space 3} 3.780527
{txt}{space 6}yes#6  {c |}{col 14}{res}{space 2} 1.406354{col 26}{space 2} .4840443{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4} .7163491{col 67}{space 3} 2.760987
{txt}{space 6}yes#7  {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_cox5
{txt}
{com}. 
. *EJERCICIO 7*
. 
. xi: stcox age i.terapy i.clinic, nohr
{txt}i.terapy{col 19}_Iterapy_1-4{col 39}(naturally coded; _Iterapy_1 omitted)
i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.62277
{txt}Iteration 2:   log likelihood = {res}-920.29293
{txt}Iteration 3:   log likelihood = {res}-920.29014
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-920.29014

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:10})} = {res}{ralign 6:95.57}
{txt}Log likelihood = {res}-920.29014{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .1252957{col 26}{space 2}  .028208{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} .0700091{col 67}{space 3} .1805824
{txt}{space 2}_Iterapy_2 {c |}{col 14}{res}{space 2}-.8118311{col 26}{space 2}  .218913{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-1.240893{col 67}{space 3}-.3827696
{txt}{space 2}_Iterapy_3 {c |}{col 14}{res}{space 2} .2554841{col 26}{space 2} .2232517{col 37}{space 1}    1.14{col 46}{space 3}0.252{col 54}{space 4}-.1820812{col 67}{space 3} .6930493
{txt}{space 2}_Iterapy_4 {c |}{col 14}{res}{space 2} -1.51176{col 26}{space 2} .2268242{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-1.956327{col 67}{space 3}-1.067193
{txt}{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2}-.5079383{col 26}{space 2} .2887136{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-1.073807{col 67}{space 3} .0579301
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}-.1381408{col 26}{space 2} .2576148{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.6430565{col 67}{space 3} .3667748
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2}-.3703841{col 26}{space 2} .2603957{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4}-.8807502{col 67}{space 3} .1399821
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2}-.1969114{col 26}{space 2}  .252787{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.6923647{col 67}{space 3}  .298542
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2}-.4020562{col 26}{space 2} .2680656{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4} -.927455{col 67}{space 3} .1233427
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2}-.9039418{col 26}{space 2} .2735173{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4}-1.440026{col 67}{space 3}-.3678576
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. xi: stcox age i.terapy i.clinic
{txt}i.terapy{col 19}_Iterapy_1-4{col 39}(naturally coded; _Iterapy_1 omitted)
i.clinic{col 19}_Iclinic_1-7{col 39}(naturally coded; _Iclinic_1 omitted)

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:   log likelihood = {res}-968.07525
{txt}Iteration 1:   log likelihood = {res}-921.62277
{txt}Iteration 2:   log likelihood = {res}-920.29293
{txt}Iteration 3:   log likelihood = {res}-920.29014
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-920.29014

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:LR chi2({res:10})} = {res}{ralign 6:95.57}
{txt}Log likelihood = {res}-920.29014{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.133484{col 26}{space 2} .0319733{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} 1.072518{col 67}{space 3} 1.197915
{txt}{space 2}_Iterapy_2 {c |}{col 14}{res}{space 2} .4440442{col 26}{space 2}  .097207{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}  .289126{col 67}{space 3}   .68197
{txt}{space 2}_Iterapy_3 {c |}{col 14}{res}{space 2} 1.291086{col 26}{space 2} .2882372{col 37}{space 1}    1.14{col 46}{space 3}0.252{col 54}{space 4} .8335337{col 67}{space 3} 1.999804
{txt}{space 2}_Iterapy_4 {c |}{col 14}{res}{space 2} .2205216{col 26}{space 2} .0500196{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4} .1413767{col 67}{space 3} .3439728
{txt}{space 2}_Iclinic_2 {c |}{col 14}{res}{space 2} .6017349{col 26}{space 2} .1737291{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4} .3417053{col 67}{space 3} 1.059641
{txt}{space 2}_Iclinic_3 {c |}{col 14}{res}{space 2}  .870976{col 26}{space 2} .2243763{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4} .5256832{col 67}{space 3} 1.443073
{txt}{space 2}_Iclinic_4 {c |}{col 14}{res}{space 2} .6904691{col 26}{space 2} .1797952{col 37}{space 1}   -1.42{col 46}{space 3}0.155{col 54}{space 4} .4144719{col 67}{space 3} 1.150253
{txt}{space 2}_Iclinic_5 {c |}{col 14}{res}{space 2} .8212634{col 26}{space 2} .2076047{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4} .5003914{col 67}{space 3} 1.347892
{txt}{space 2}_Iclinic_6 {c |}{col 14}{res}{space 2} .6689432{col 26}{space 2} .1793206{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4} .3955591{col 67}{space 3} 1.131272
{txt}{space 2}_Iclinic_7 {c |}{col 14}{res}{space 2} .4049702{col 26}{space 2} .1107664{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4} .2369216{col 67}{space 3} .6922157
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimate store est_cox6
{txt}
{com}. 
. sts graph, cumhaz by(terapy)

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days
{txt}
{com}. 
. *EJERCICIO 8*
. 
. stphplot, by(terapy)

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days
{txt}
{com}. estat phtest

{txt}Test of proportional-hazards assumption

Time function: Analysis time
{hline 13}{c TT}{hline 34}
             {c |}     chi2       df       Prob>chi2
{hline 13}{c +}{hline 34}
 Global test {c |}{res}{col 15}     4.66{col 28}   10{col 43}0.9128
{txt}{hline 13}{c BT}{hline 34}

{com}. 
. 
. ********************************************************************************
.                                                         * MODELOS PARAMÉTRICOS *
. ********************************************************************************
. 
. 
. local vars="age age2 rad chemo rad_chemo"
{txt}
{com}. 
. generate age2=age*age
{txt}
{com}. generate rad_chemo=rad*chemo
{txt}
{com}. 
. *EJERCICIO 1*
. 
. stset days, fail(died=1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(0, days]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}        300{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}        300{txt}  observations remaining, representing
{res}        207{txt}  failures in single-record/single-failure data
{res}    127,744{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}    1,363
{txt}
{com}. stdescribe

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}       300   
{txt}Number of records     {res}       300           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res} 425.8133           7        401       1363

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res}    127744    425.8133           7        401       1363

{txt}Failures              {res}       207         .69           0          1          1
{txt}{hline 78}

{com}. stsum

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res}     127,744   .0016204{col 40}      300        321       484       705
{txt}
{com}. 
. streg `vars', distribution(exponential) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -324.8636}  
Iteration 1:{space 3}log pseudolikelihood = {res:-316.09533}  
Iteration 2:{space 3}log pseudolikelihood = {res:-315.62534}  
Iteration 3:{space 3}log pseudolikelihood = {res:-315.62373}  
Iteration 4:{space 3}log pseudolikelihood = {res:-315.62373}  
{res}
{txt}Exponential PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:41.98}
{txt}Log pseudolikelihood = {res}-315.62373{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0337868{col 26}{space 2} .0900661{col 37}{space 1}   -0.38{col 46}{space 3}0.708{col 54}{space 4} -.210313{col 67}{space 3} .1427394
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0066531{col 26}{space 2} .0058958{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.0049024{col 67}{space 3} .0182086
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1583477{col 26}{space 2}  .159347{col 37}{space 1}    0.99{col 46}{space 3}0.320{col 54}{space 4}-.1539666{col 67}{space 3} .4706621
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.2735383{col 26}{space 2} .1530009{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-.5734146{col 67}{space 3}  .026338
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} -.349043{col 26}{space 2} .1979503{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.7370185{col 67}{space 3} .0389325
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.345979{col 26}{space 2} .3360271{col 37}{space 1}  -18.89{col 46}{space 3}0.000{col 54}{space 4} -7.00458{col 67}{space 3}-5.687378
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_param_expo
{txt}
{com}. streg `vars', distribution(weibull) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:
Iteration 0:   log pseudolikelihood = {res} -324.8636
{txt}Iteration 1:   log pseudolikelihood = {res}-280.19171
{txt}Iteration 2:   log pseudolikelihood = {res}-278.62459
{txt}Iteration 3:   log pseudolikelihood = {res}-278.62385
{txt}Iteration 4:   log pseudolikelihood = {res}-278.62385

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-278.62385}  
Iteration 1:{space 3}log pseudolikelihood = {res:-250.79007}  
Iteration 2:{space 3}log pseudolikelihood = {res: -243.5274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-243.48757}  
Iteration 4:{space 3}log pseudolikelihood = {res:-243.48756}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:78.17}
{txt}Log pseudolikelihood = {res}-243.48756{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0437837{col 26}{space 2}  .134874{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4} -.308132{col 67}{space 3} .2205645
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0098644{col 26}{space 2} .0090807{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0079335{col 67}{space 3} .0276623
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1379884{col 26}{space 2} .2168381{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2870064{col 67}{space 3} .5629832
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.7562293{col 26}{space 2} .2126099{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-1.172937{col 67}{space 3}-.3395216
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2}-.6779556{col 26}{space 2} .2786234{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.224047{col 67}{space 3}-.1318637
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.78937{col 26}{space 2} 1.018176{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-15.78496{col 67}{space 3}-11.79379
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/ln_p {c |}{col 14}{res}{space 2} .8068914{col 26}{space 2} .0672935{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .6749986{col 67}{space 3} .9387842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.240931{col 26}{space 2}    .1508{col 54}{space 4}  1.96403{col 67}{space 3} 2.556871
{txt}         1/p {c |}{col 14}{res}{space 2} .4462431{col 26}{space 2} .0300292{col 54}{space 4} .3911031{col 67}{space 3} .5091571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_param_weib
{txt}
{com}. streg `vars', distribution(lognormal) robust

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:{res}
{txt}{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-732.02965}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: -326.8693}  
Iteration 2:{space 3}log pseudolikelihood = {res: -320.9769}  
Iteration 3:{space 3}log pseudolikelihood = {res:-309.66159}  
Iteration 4:{space 3}log pseudolikelihood = {res:-309.58877}  
Iteration 5:{space 3}log pseudolikelihood = {res:-309.58875}  
{res}
{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-309.58875}  
Iteration 1:{space 3}log pseudolikelihood = {res:-283.09614}  
Iteration 2:{space 3}log pseudolikelihood = {res:-280.49855}  
Iteration 3:{space 3}log pseudolikelihood = {res:-280.49695}  
Iteration 4:{space 3}log pseudolikelihood = {res:-280.49695}  
{res}
{txt}Lognormal AFT regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:64.04}
{txt}Log pseudolikelihood = {res}-280.49695{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0665496{col 26}{space 2}  .079323{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0889206{col 67}{space 3} .2220198
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0091573{col 26}{space 2} .0054042{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.0197494{col 67}{space 3} .0014347
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.0304744{col 26}{space 2} .1575335{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.3392344{col 67}{space 3} .2782855
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .4473685{col 26}{space 2} .1372041{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .1784533{col 67}{space 3} .7162837
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} .2797488{col 26}{space 2} .1875355{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4} -.087814{col 67}{space 3} .6473115
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.811232{col 26}{space 2} .2803129{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 5.261829{col 67}{space 3} 6.360635
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}/lnsigma {c |}{col 14}{res}{space 2}-.3324743{col 26}{space 2} .0923369{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.5134513{col 67}{space 3}-.1514973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma {c |}{col 14}{res}{space 2} .7171471{col 26}{space 2} .0662191{col 54}{space 4} .5984267{col 67}{space 3} .8594202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store est_param_logn
{txt}
{com}. 
. esttab est_param_expo est_param_weib est_param_logn, se mtitles("Exponencial" "Weibull" "Lognormal")
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}              Exponencial         Weibull       Lognormal   
{txt}{hline 60}
{res}_t                                                          {txt}
{txt}age         {res}      -0.0338         -0.0438          0.0665   {txt}
            {res} {ralign 12:{txt:(}0.0901{txt:)}}    {ralign 12:{txt:(}0.135{txt:)}}    {ralign 12:{txt:(}0.0793{txt:)}}   {txt}

{txt}age2        {res}      0.00665         0.00986        -0.00916   {txt}
            {res} {ralign 12:{txt:(}0.00590{txt:)}}    {ralign 12:{txt:(}0.00908{txt:)}}    {ralign 12:{txt:(}0.00540{txt:)}}   {txt}

{txt}rad         {res}        0.158           0.138         -0.0305   {txt}
            {res} {ralign 12:{txt:(}0.159{txt:)}}    {ralign 12:{txt:(}0.217{txt:)}}    {ralign 12:{txt:(}0.158{txt:)}}   {txt}

{txt}chemo       {res}       -0.274          -0.756***        0.447** {txt}
            {res} {ralign 12:{txt:(}0.153{txt:)}}    {ralign 12:{txt:(}0.213{txt:)}}    {ralign 12:{txt:(}0.137{txt:)}}   {txt}

{txt}rad_chemo   {res}       -0.349          -0.678*          0.280   {txt}
            {res} {ralign 12:{txt:(}0.198{txt:)}}    {ralign 12:{txt:(}0.279{txt:)}}    {ralign 12:{txt:(}0.188{txt:)}}   {txt}

{txt}_cons       {res}       -6.346***       -13.79***        5.811***{txt}
            {res} {ralign 12:{txt:(}0.336{txt:)}}    {ralign 12:{txt:(}1.018{txt:)}}    {ralign 12:{txt:(}0.280{txt:)}}   {txt}
{hline 60}
{res}/                                                           {txt}
{txt}ln_p        {res}                        0.807***                {txt}
            {res}                 {ralign 12:{txt:(}0.0673{txt:)}}                   {txt}

{txt}lnsigma     {res}                                       -0.332***{txt}
            {res}                                 {ralign 12:{txt:(}0.0923{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}          300             300             300   {txt}
{txt}{hline 60}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *EJERCICIO 3*
. 
. streg `vars', distribution(exponential) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Iteration 0:{space 3}log pseudolikelihood = {res: -324.8636}  
Iteration 1:{space 3}log pseudolikelihood = {res:-316.09533}  
Iteration 2:{space 3}log pseudolikelihood = {res:-315.62534}  
Iteration 3:{space 3}log pseudolikelihood = {res:-315.62373}  
Iteration 4:{space 3}log pseudolikelihood = {res:-315.62373}  
{res}
{txt}Exponential PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:41.98}
{txt}Log pseudolikelihood = {res}-315.62373{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0337868{col 26}{space 2} .0900661{col 37}{space 1}   -0.38{col 46}{space 3}0.708{col 54}{space 4} -.210313{col 67}{space 3} .1427394
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0066531{col 26}{space 2} .0058958{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.0049024{col 67}{space 3} .0182086
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1583477{col 26}{space 2}  .159347{col 37}{space 1}    0.99{col 46}{space 3}0.320{col 54}{space 4}-.1539666{col 67}{space 3} .4706621
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.2735383{col 26}{space 2} .1530009{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-.5734146{col 67}{space 3}  .026338
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} -.349043{col 26}{space 2} .1979503{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.7370185{col 67}{space 3} .0389325
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.345979{col 26}{space 2} .3360271{col 37}{space 1}  -18.89{col 46}{space 3}0.000{col 54}{space 4} -7.00458{col 67}{space 3}-5.687378
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-324.8636{col 39}-315.6237{col 50}     6{col 58} 643.2475{col 69} 665.4702
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. local aic_e=r(S)[1,5]
{txt}
{com}. local bic_e=r(S)[1,6]
{txt}
{com}. streg `vars', distribution(weibull) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:
Iteration 0:   log pseudolikelihood = {res} -324.8636
{txt}Iteration 1:   log pseudolikelihood = {res}-280.19171
{txt}Iteration 2:   log pseudolikelihood = {res}-278.62459
{txt}Iteration 3:   log pseudolikelihood = {res}-278.62385
{txt}Iteration 4:   log pseudolikelihood = {res}-278.62385

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-278.62385}  
Iteration 1:{space 3}log pseudolikelihood = {res:-250.79007}  
Iteration 2:{space 3}log pseudolikelihood = {res: -243.5274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-243.48757}  
Iteration 4:{space 3}log pseudolikelihood = {res:-243.48756}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:78.17}
{txt}Log pseudolikelihood = {res}-243.48756{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0437837{col 26}{space 2}  .134874{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4} -.308132{col 67}{space 3} .2205645
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0098644{col 26}{space 2} .0090807{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0079335{col 67}{space 3} .0276623
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1379884{col 26}{space 2} .2168381{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2870064{col 67}{space 3} .5629832
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.7562293{col 26}{space 2} .2126099{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-1.172937{col 67}{space 3}-.3395216
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2}-.6779556{col 26}{space 2} .2786234{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.224047{col 67}{space 3}-.1318637
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.78937{col 26}{space 2} 1.018176{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-15.78496{col 67}{space 3}-11.79379
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/ln_p {c |}{col 14}{res}{space 2} .8068914{col 26}{space 2} .0672935{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .6749986{col 67}{space 3} .9387842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.240931{col 26}{space 2}    .1508{col 54}{space 4}  1.96403{col 67}{space 3} 2.556871
{txt}         1/p {c |}{col 14}{res}{space 2} .4462431{col 26}{space 2} .0300292{col 54}{space 4} .3911031{col 67}{space 3} .5091571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-278.6239{col 39}-243.4876{col 50}     7{col 58} 500.9751{col 69} 526.9016
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. local aic_w=r(S)[1,5]
{txt}
{com}. local bic_w=r(S)[1,6]
{txt}
{com}. streg `vars', distribution(lognormal) robust

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:{res}
{txt}{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-732.02965}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: -326.8693}  
Iteration 2:{space 3}log pseudolikelihood = {res: -320.9769}  
Iteration 3:{space 3}log pseudolikelihood = {res:-309.66159}  
Iteration 4:{space 3}log pseudolikelihood = {res:-309.58877}  
Iteration 5:{space 3}log pseudolikelihood = {res:-309.58875}  
{res}
{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-309.58875}  
Iteration 1:{space 3}log pseudolikelihood = {res:-283.09614}  
Iteration 2:{space 3}log pseudolikelihood = {res:-280.49855}  
Iteration 3:{space 3}log pseudolikelihood = {res:-280.49695}  
Iteration 4:{space 3}log pseudolikelihood = {res:-280.49695}  
{res}
{txt}Lognormal AFT regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:64.04}
{txt}Log pseudolikelihood = {res}-280.49695{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0665496{col 26}{space 2}  .079323{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0889206{col 67}{space 3} .2220198
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0091573{col 26}{space 2} .0054042{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.0197494{col 67}{space 3} .0014347
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.0304744{col 26}{space 2} .1575335{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.3392344{col 67}{space 3} .2782855
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .4473685{col 26}{space 2} .1372041{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .1784533{col 67}{space 3} .7162837
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} .2797488{col 26}{space 2} .1875355{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4} -.087814{col 67}{space 3} .6473115
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.811232{col 26}{space 2} .2803129{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 5.261829{col 67}{space 3} 6.360635
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}/lnsigma {c |}{col 14}{res}{space 2}-.3324743{col 26}{space 2} .0923369{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.5134513{col 67}{space 3}-.1514973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma {c |}{col 14}{res}{space 2} .7171471{col 26}{space 2} .0662191{col 54}{space 4} .5984267{col 67}{space 3} .8594202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-309.5887{col 39}-280.4969{col 50}     7{col 58} 574.9939{col 69} 600.9204
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. local aic_l=r(S)[1,5]
{txt}
{com}. local bic_l=r(S)[1,6]
{txt}
{com}. 
. display as text "El AIC del modelo con distribución exponencial es " as result `aic_e'
{res}{txt}El AIC del modelo con distribución exponencial es {res}643.24747
{txt}
{com}. display as text "El AIC del modelo con distribución Weibull es " as result `aic_w'
{res}{txt}El AIC del modelo con distribución Weibull es {res}500.97512
{txt}
{com}. display as text "El AIC del modelo con distribución lognormal es " as result `aic_l'
{res}{txt}El AIC del modelo con distribución lognormal es {res}574.99389
{txt}
{com}. 
. display as text "El BIC del modelo con distribución exponencial es " as result `bic_e'
{res}{txt}El BIC del modelo con distribución exponencial es {res}665.47016
{txt}
{com}. display as text "El BIC del modelo con distribución Weibull es " as result `bic_w'
{res}{txt}El BIC del modelo con distribución Weibull es {res}526.9016
{txt}
{com}. display as text "El BIC del modelo con distribución lognormal es " as result `bic_l'
{res}{txt}El BIC del modelo con distribución lognormal es {res}600.92037
{txt}
{com}. 
. *EJERCICIO 4*
. 
. streg `vars', distribution(weibull) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:
Iteration 0:   log pseudolikelihood = {res} -324.8636
{txt}Iteration 1:   log pseudolikelihood = {res}-280.19171
{txt}Iteration 2:   log pseudolikelihood = {res}-278.62459
{txt}Iteration 3:   log pseudolikelihood = {res}-278.62385
{txt}Iteration 4:   log pseudolikelihood = {res}-278.62385

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-278.62385}  
Iteration 1:{space 3}log pseudolikelihood = {res:-250.79007}  
Iteration 2:{space 3}log pseudolikelihood = {res: -243.5274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-243.48757}  
Iteration 4:{space 3}log pseudolikelihood = {res:-243.48756}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:78.17}
{txt}Log pseudolikelihood = {res}-243.48756{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0437837{col 26}{space 2}  .134874{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4} -.308132{col 67}{space 3} .2205645
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0098644{col 26}{space 2} .0090807{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0079335{col 67}{space 3} .0276623
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1379884{col 26}{space 2} .2168381{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2870064{col 67}{space 3} .5629832
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.7562293{col 26}{space 2} .2126099{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-1.172937{col 67}{space 3}-.3395216
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2}-.6779556{col 26}{space 2} .2786234{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.224047{col 67}{space 3}-.1318637
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.78937{col 26}{space 2} 1.018176{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-15.78496{col 67}{space 3}-11.79379
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/ln_p {c |}{col 14}{res}{space 2} .8068914{col 26}{space 2} .0672935{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .6749986{col 67}{space 3} .9387842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.240931{col 26}{space 2}    .1508{col 54}{space 4}  1.96403{col 67}{space 3} 2.556871
{txt}         1/p {c |}{col 14}{res}{space 2} .4462431{col 26}{space 2} .0300292{col 54}{space 4} .3911031{col 67}{space 3} .5091571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, survival at(chemo==1)
{res}{txt}
{com}. stcurve, survival at(chemo==0)
{res}{txt}
{com}. 
. streg `vars', distribution(lognormal) robust

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:{res}
{txt}{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-732.02965}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: -326.8693}  
Iteration 2:{space 3}log pseudolikelihood = {res: -320.9769}  
Iteration 3:{space 3}log pseudolikelihood = {res:-309.66159}  
Iteration 4:{space 3}log pseudolikelihood = {res:-309.58877}  
Iteration 5:{space 3}log pseudolikelihood = {res:-309.58875}  
{res}
{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-309.58875}  
Iteration 1:{space 3}log pseudolikelihood = {res:-283.09614}  
Iteration 2:{space 3}log pseudolikelihood = {res:-280.49855}  
Iteration 3:{space 3}log pseudolikelihood = {res:-280.49695}  
Iteration 4:{space 3}log pseudolikelihood = {res:-280.49695}  
{res}
{txt}Lognormal AFT regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:64.04}
{txt}Log pseudolikelihood = {res}-280.49695{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0665496{col 26}{space 2}  .079323{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0889206{col 67}{space 3} .2220198
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0091573{col 26}{space 2} .0054042{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.0197494{col 67}{space 3} .0014347
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.0304744{col 26}{space 2} .1575335{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.3392344{col 67}{space 3} .2782855
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .4473685{col 26}{space 2} .1372041{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .1784533{col 67}{space 3} .7162837
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} .2797488{col 26}{space 2} .1875355{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4} -.087814{col 67}{space 3} .6473115
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.811232{col 26}{space 2} .2803129{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 5.261829{col 67}{space 3} 6.360635
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}/lnsigma {c |}{col 14}{res}{space 2}-.3324743{col 26}{space 2} .0923369{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.5134513{col 67}{space 3}-.1514973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma {c |}{col 14}{res}{space 2} .7171471{col 26}{space 2} .0662191{col 54}{space 4} .5984267{col 67}{space 3} .8594202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, survival at(chemo==1)
{res}{txt}
{com}. stcurve, survival at(chemo==0)
{res}{txt}
{com}. 
. *EJERCICIO 5*
. 
. streg `vars', distribution(weibull) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:
Iteration 0:   log pseudolikelihood = {res} -324.8636
{txt}Iteration 1:   log pseudolikelihood = {res}-280.19171
{txt}Iteration 2:   log pseudolikelihood = {res}-278.62459
{txt}Iteration 3:   log pseudolikelihood = {res}-278.62385
{txt}Iteration 4:   log pseudolikelihood = {res}-278.62385

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-278.62385}  
Iteration 1:{space 3}log pseudolikelihood = {res:-250.79007}  
Iteration 2:{space 3}log pseudolikelihood = {res: -243.5274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-243.48757}  
Iteration 4:{space 3}log pseudolikelihood = {res:-243.48756}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:78.17}
{txt}Log pseudolikelihood = {res}-243.48756{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0437837{col 26}{space 2}  .134874{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4} -.308132{col 67}{space 3} .2205645
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0098644{col 26}{space 2} .0090807{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0079335{col 67}{space 3} .0276623
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1379884{col 26}{space 2} .2168381{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2870064{col 67}{space 3} .5629832
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.7562293{col 26}{space 2} .2126099{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-1.172937{col 67}{space 3}-.3395216
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2}-.6779556{col 26}{space 2} .2786234{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.224047{col 67}{space 3}-.1318637
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.78937{col 26}{space 2} 1.018176{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-15.78496{col 67}{space 3}-11.79379
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/ln_p {c |}{col 14}{res}{space 2} .8068914{col 26}{space 2} .0672935{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .6749986{col 67}{space 3} .9387842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.240931{col 26}{space 2}    .1508{col 54}{space 4}  1.96403{col 67}{space 3} 2.556871
{txt}         1/p {c |}{col 14}{res}{space 2} .4462431{col 26}{space 2} .0300292{col 54}{space 4} .3911031{col 67}{space 3} .5091571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, hazard at(rad==1)
{res}{txt}
{com}. stcurve, hazard at(rad==0)
{res}{txt}
{com}. 
. streg `vars', distribution(lognormal) robust

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:{res}
{txt}{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-732.02965}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: -326.8693}  
Iteration 2:{space 3}log pseudolikelihood = {res: -320.9769}  
Iteration 3:{space 3}log pseudolikelihood = {res:-309.66159}  
Iteration 4:{space 3}log pseudolikelihood = {res:-309.58877}  
Iteration 5:{space 3}log pseudolikelihood = {res:-309.58875}  
{res}
{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-309.58875}  
Iteration 1:{space 3}log pseudolikelihood = {res:-283.09614}  
Iteration 2:{space 3}log pseudolikelihood = {res:-280.49855}  
Iteration 3:{space 3}log pseudolikelihood = {res:-280.49695}  
Iteration 4:{space 3}log pseudolikelihood = {res:-280.49695}  
{res}
{txt}Lognormal AFT regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:64.04}
{txt}Log pseudolikelihood = {res}-280.49695{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0665496{col 26}{space 2}  .079323{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0889206{col 67}{space 3} .2220198
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0091573{col 26}{space 2} .0054042{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.0197494{col 67}{space 3} .0014347
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.0304744{col 26}{space 2} .1575335{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.3392344{col 67}{space 3} .2782855
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .4473685{col 26}{space 2} .1372041{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .1784533{col 67}{space 3} .7162837
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} .2797488{col 26}{space 2} .1875355{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4} -.087814{col 67}{space 3} .6473115
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.811232{col 26}{space 2} .2803129{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 5.261829{col 67}{space 3} 6.360635
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}/lnsigma {c |}{col 14}{res}{space 2}-.3324743{col 26}{space 2} .0923369{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.5134513{col 67}{space 3}-.1514973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma {c |}{col 14}{res}{space 2} .7171471{col 26}{space 2} .0662191{col 54}{space 4} .5984267{col 67}{space 3} .8594202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, hazard at(rad==1)
{res}{txt}
{com}. stcurve, hazard at(rad==0)
{res}{txt}
{com}. 
. *EJERCICIO 6*
. 
. streg `vars', distribution(weibull) robust nohr

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:
Iteration 0:   log pseudolikelihood = {res} -324.8636
{txt}Iteration 1:   log pseudolikelihood = {res}-280.19171
{txt}Iteration 2:   log pseudolikelihood = {res}-278.62459
{txt}Iteration 3:   log pseudolikelihood = {res}-278.62385
{txt}Iteration 4:   log pseudolikelihood = {res}-278.62385

{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-278.62385}  
Iteration 1:{space 3}log pseudolikelihood = {res:-250.79007}  
Iteration 2:{space 3}log pseudolikelihood = {res: -243.5274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-243.48757}  
Iteration 4:{space 3}log pseudolikelihood = {res:-243.48756}  
{res}
{txt}Weibull PH regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:78.17}
{txt}Log pseudolikelihood = {res}-243.48756{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2}-.0437837{col 26}{space 2}  .134874{col 37}{space 1}   -0.32{col 46}{space 3}0.745{col 54}{space 4} -.308132{col 67}{space 3} .2205645
{txt}{space 8}age2 {c |}{col 14}{res}{space 2} .0098644{col 26}{space 2} .0090807{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0079335{col 67}{space 3} .0276623
{txt}{space 9}rad {c |}{col 14}{res}{space 2} .1379884{col 26}{space 2} .2168381{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-.2870064{col 67}{space 3} .5629832
{txt}{space 7}chemo {c |}{col 14}{res}{space 2}-.7562293{col 26}{space 2} .2126099{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-1.172937{col 67}{space 3}-.3395216
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2}-.6779556{col 26}{space 2} .2786234{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-1.224047{col 67}{space 3}-.1318637
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.78937{col 26}{space 2} 1.018176{col 37}{space 1}  -13.54{col 46}{space 3}0.000{col 54}{space 4}-15.78496{col 67}{space 3}-11.79379
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/ln_p {c |}{col 14}{res}{space 2} .8068914{col 26}{space 2} .0672935{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} .6749986{col 67}{space 3} .9387842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           p {c |}{col 14}{res}{space 2} 2.240931{col 26}{space 2}    .1508{col 54}{space 4}  1.96403{col 67}{space 3} 2.556871
{txt}         1/p {c |}{col 14}{res}{space 2} .4462431{col 26}{space 2} .0300292{col 54}{space 4} .3911031{col 67}{space 3} .5091571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, survival
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-278.6239{col 39}-243.4876{col 50}     7{col 58} 500.9751{col 69} 526.9016
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. 
. streg `vars', distribution(lognormal) robust

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days

{txt}Fitting constant-only model:{res}
{txt}{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-732.02965}  (not concave)
Iteration 1:{space 3}log pseudolikelihood = {res: -326.8693}  
Iteration 2:{space 3}log pseudolikelihood = {res: -320.9769}  
Iteration 3:{space 3}log pseudolikelihood = {res:-309.66159}  
Iteration 4:{space 3}log pseudolikelihood = {res:-309.58877}  
Iteration 5:{space 3}log pseudolikelihood = {res:-309.58875}  
{res}
{txt}Fitting full model:{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-309.58875}  
Iteration 1:{space 3}log pseudolikelihood = {res:-283.09614}  
Iteration 2:{space 3}log pseudolikelihood = {res:-280.49855}  
Iteration 3:{space 3}log pseudolikelihood = {res:-280.49695}  
Iteration 4:{space 3}log pseudolikelihood = {res:-280.49695}  
{res}
{txt}Lognormal AFT regression

No. of subjects = {res}{ralign 7:300}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:300}
{txt}No. of failures = {res}{ralign 7:207}
{txt}Time at risk    = {res}{ralign 7:127,744}
{col 57}{txt}{lalign 13:Wald chi2({res:5})} = {res}{ralign 6:64.04}
{txt}Log pseudolikelihood = {res}-280.49695{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0665496{col 26}{space 2}  .079323{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0889206{col 67}{space 3} .2220198
{txt}{space 8}age2 {c |}{col 14}{res}{space 2}-.0091573{col 26}{space 2} .0054042{col 37}{space 1}   -1.69{col 46}{space 3}0.090{col 54}{space 4}-.0197494{col 67}{space 3} .0014347
{txt}{space 9}rad {c |}{col 14}{res}{space 2}-.0304744{col 26}{space 2} .1575335{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.3392344{col 67}{space 3} .2782855
{txt}{space 7}chemo {c |}{col 14}{res}{space 2} .4473685{col 26}{space 2} .1372041{col 37}{space 1}    3.26{col 46}{space 3}0.001{col 54}{space 4} .1784533{col 67}{space 3} .7162837
{txt}{space 3}rad_chemo {c |}{col 14}{res}{space 2} .2797488{col 26}{space 2} .1875355{col 37}{space 1}    1.49{col 46}{space 3}0.136{col 54}{space 4} -.087814{col 67}{space 3} .6473115
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.811232{col 26}{space 2} .2803129{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 5.261829{col 67}{space 3} 6.360635
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}/lnsigma {c |}{col 14}{res}{space 2}-.3324743{col 26}{space 2} .0923369{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.5134513{col 67}{space 3}-.1514973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma {c |}{col 14}{res}{space 2} .7171471{col 26}{space 2} .0662191{col 54}{space 4} .5984267{col 67}{space 3} .8594202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. stcurve, survival
{res}{txt}
{com}. estat ic

{txt}Akaike's information criterion and Bayesian information criterion

{hline 13}{c TT}{hline 63}
       Model {c |}          N   ll(null)  ll(model)      df        AIC        BIC
{hline 13}{c +}{hline 63}
{ralign 12:.}{col 14}{c |}{res}{col 16}       300{col 28}-309.5887{col 39}-280.4969{col 50}     7{col 58} 574.9939{col 69} 600.9204
{txt}{hline 13}{c BT}{hline 63}
{p 0 6 0 77}Note: BIC uses N = number of observations. See {helpb bic_note:{bind:[R] BIC note}}.{p_end}

{com}. 
. sts graph, survival

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}days
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}G:\Mi unidad\JM\Facultad de Ciencias Económicas (FCE)\Maestría en Econometría\6. Microeconometría I\Examen\Datos\Examen Final.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Mar 2025, 00:49:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}