{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}G:\Mi unidad\JM\Facultad de Ciencias Económicas (FCE)\Maestría en Econometría\7. Econometría de Datos de Panel\Examen\Datos\Examen Final.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Jun 2024, 17:30:08
{txt}
{com}. 
. 
. global seed=2205
{txt}
{com}. 
. 
. *##############################################################################*
. *********** 1. PROPIEDADES DE MUESTRA FINITA EN PANELES NO BALANCEADOS *********
. *##############################################################################*
. 
. 
. global beta=1
{txt}
{com}. global gamma1=1
{txt}
{com}. global gamma2=1
{txt}
{com}. global reps=1000
{txt}
{com}. 
. global models="A B C"
{txt}
{com}. global params="beta gamma1 gamma2"
{txt}
{com}. global samples="20 40 100"
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 1 *
. ********************************************************************************
. 
. 
. *PROGRAMA*
. 
. program define simulation1, rclass
{txt}  1{com}. 
.         *Seteo*
.         drop _all
{txt}  2{com}.         local N=$N
{txt}  3{com}.         local T=$T
{txt}  4{com}.         local NT=`N'*`T'
{txt}  5{com}.         set obs `NT'
{txt}  6{com}.         egen id=seq(), from(1) to(`N') block(`T')
{txt}  7{com}.         egen t=seq(), from(1) to(`T')
{txt}  8{com}.         xtset id t
{txt}  9{com}. 
.         *Variables generales*
.         generate w=rnormal()
{txt} 10{com}.         generate z=rnormal()
{txt} 11{com}.         generate x=w
{txt} 12{com}.         generate epsilon=rnormal()
{txt} 13{com}.         generate psi1=rnormal()
{txt} 14{com}.         generate u=0.6*epsilon+0.8*psi1
{txt} 15{com}.         forvalues i=2(1)4 {c -(}
{txt} 16{com}.                 generate psi`i'=.
{txt} 17{com}.                 forvalues id=1(1)`N' {c -(}
{txt} 18{com}.                         local aux=rnormal()
{txt} 19{com}.                         replace psi`i'=`aux' if (id==`id')
{txt} 20{com}.                 {c )-}
{txt} 21{com}.         {c )-}
{txt} 22{com}. 
.         *Variables de efectos fijos de los modelos (A, B, C)*
.         foreach model of global models {c -(}
{txt} 23{com}.                 generate alpha_`model'=.
{txt} 24{com}.                 generate c_`model'=.
{txt} 25{com}.         {c )-}
{txt} 26{com}.         replace alpha_A=psi2+psi4
{txt} 27{com}.         replace c_A=psi3+psi4
{txt} 28{com}.         replace alpha_B=psi2+(z+z[_n+1])/2 if (t==1)
{txt} 29{com}.         replace alpha_B=psi2+(z[_n-1]+z)/2 if (t==2)
{txt} 30{com}.         replace c_B=psi3+(x+x[_n+1])/2 if (t==1)
{txt} 31{com}.         replace c_B=psi3+(x[_n-1]+x)/2 if (t==2)
{txt} 32{com}.         replace alpha_C=psi2+(z+z[_n+1])/2+psi4 if (t==1)
{txt} 33{com}.         replace alpha_C=psi2+(z[_n-1]+z)/2+psi4 if (t==2)
{txt} 34{com}.         replace c_C=psi3+(x+x[_n+1])/2+psi4 if (t==1)
{txt} 35{com}.         replace c_C=psi3+(x[_n-1]+x)/2+psi4 if (t==2)
{txt} 36{com}.         if (`T'>2) {c -(}
{txt} 37{com}.                 foreach model of newlist B C {c -(}
{txt} 38{com}.                         replace alpha_`model'=alpha_`model'[_n-1] if (t>2)
{txt} 39{com}.                         replace c_`model'=c_`model'[_n-1] if (t>2)
{txt} 40{com}.                 {c )-}
{txt} 41{com}.         {c )-}
{txt} 42{com}. 
.         *Variables dependientes de los modelos (A, B, C)*
.         foreach model of global models {c -(}
{txt} 43{com}.                 generate y_star_`model'=${c -(}beta{c )-}*x+c_`model'+u
{txt} 44{com}.                 generate s_star_`model'=${c -(}gamma1{c )-}*w+${c -(}gamma2{c )-}*z+alpha_`model'+epsilon
{txt} 45{com}.                 generate s_`model'_obs=(s_star_`model'>0)
{txt} 46{com}.                 generate y_`model'=y_star_`model'*s_`model'_obs
{txt} 47{com}.                 generate s_`model'=s_star_`model'*s_`model'_obs
{txt} 48{com}.         {c )-}
{txt} 49{com}. 
.         *Variables para estimar los modelos (A, B, C) por Wooldridge (1995) bajo el enfoque de Mundlak (1978) -----> Se utiliza este enfoque*
.         foreach var of varlist x w z {c -(}
{txt} 50{com}.                 egen mean_`var'=mean(`var'), by(id)             
{txt} 51{com}.         {c )-}
{txt} 52{com}. 
.         *Variables para estimar los modelos (A, B, C) por Wooldridge (1995) bajo el enfoque de Chamberlain (1978) -----> No se utiliza este enfoque*
.         forvalues t=1(1)`T' {c -(}
{txt} 53{com}.                 foreach var of varlist x w z {c -(}
{txt} 54{com}.                         generate `var'`t'=.             
{txt} 55{com}.                 {c )-}
{txt} 56{com}.                 forvalues id=1(1)`N' {c -(}
{txt} 57{com}.                         foreach var of varlist x w z {c -(}
{txt} 58{com}.                                 summarize `var' if (id==`id' & t==`t')
{txt} 59{com}.                                 replace `var'`t'=r(mean) if (id==`id')
{txt} 60{com}.                         {c )-}
{txt} 61{com}.                 {c )-}
{txt} 62{com}.         {c )-}
{txt} 63{com}. 
.         *Estimación de modelos (A, B, C) por FE -----> A fines comparativos*
.         foreach model of global models {c -(}
{txt} 64{com}.                 xtreg y_`model' x, fe vce(cluster id)
{txt} 65{com}.                 xtreg s_`model' w z, fe vce(cluster id)
{txt} 66{com}.         {c )-}
{txt} 67{com}. 
.         *Estimación de modelos (A, B, C) por Wooldridge (1995) bajo el enfoque de Mundlak (1978) -----> Se utiliza este enfoque (se retornan sus valores)*
.         foreach model of global models {c -(}
{txt} 68{com}.                 *Ecuación de interés*
.                 probit s_`model'_obs x mean_x
{txt} 69{com}.                 predict yhat_mundlak_`model', xb
{txt} 70{com}.                 generate lambda_y_mundlak_`model'=normalden(yhat_mundlak_`model')/normal(yhat_mundlak_`model')
{txt} 71{com}.                 regress y_`model' x mean_x i.t#c.lambda_y_mundlak_`model', robust
{txt} 72{com}.                 return scalar beta_model`model'=e(b)[1,1]
{txt} 73{com}.                 *Ecuación de selección*
.                 probit s_`model'_obs w z mean_w mean_z
{txt} 74{com}.                 predict shat_mundlak_`model', xb
{txt} 75{com}.                 generate lambda_s_mundlak_`model'=normalden(shat_mundlak_`model')/normal(shat_mundlak_`model')
{txt} 76{com}.                 regress s_`model' w z mean_w mean_z i.t#c.lambda_s_mundlak_`model', robust
{txt} 77{com}.                 return scalar gamma1_model`model'=e(b)[1,1]
{txt} 78{com}.                 return scalar gamma2_model`model'=e(b)[1,2]
{txt} 79{com}.         {c )-}
{txt} 80{com}. 
.         *Estimación de modelos (A, B, C) por Wooldridge (1995) bajo el enfoque de Chamberlain (1980) -----> No se utiliza este enfoque (no se retornan sus valores)*
.         foreach model of global models {c -(}
{txt} 81{com}.                 *Ecuación de interés*
.                 probit s_`model'_obs x mean_x
{txt} 82{com}.                 predict yhat_chamberlain_`model', xb
{txt} 83{com}.                 generate lambda_y_chamberlain_`model'=normalden(yhat_chamberlain_`model')/normal(yhat_chamberlain_`model')
{txt} 84{com}.                 regress y_`model' x mean_x i.t#c.lambda_y_chamberlain_`model', robust
{txt} 85{com}.                 return scalar beta_model`model'=e(b)[1,1]
{txt} 86{com}.                 *Ecuación de selección*
.                 probit s_`model'_obs w z mean_w mean_z
{txt} 87{com}.                 predict shat_chamberlain_`model', xb
{txt} 88{com}.                 generate lambda_s_chamberlain_`model'=normalden(shat_chamberlain_`model')/normal(shat_chamberlain_`model')
{txt} 89{com}.                 regress s_`model' w z mean_w mean_z i.t#c.lambda_s_chamberlain_`model', robust
{txt} 90{com}.                 return scalar gamma1_model`model'=e(b)[1,1]
{txt} 91{com}.                 return scalar gamma2_model`model'=e(b)[1,2]
{txt} 92{com}.         {c )-}
{txt} 93{com}. 
. end
{txt}
{com}. 
. *SIMULACIONES*
. 
. local cols: word count $samples
{txt}
{com}. 
. matrix define   results1 = J(45,`cols',.)
{txt}
{com}. matrix rownames results1 = "sesgo_medio_beta_modelA"    "sesgo_mediano_beta_modelA"   "de_beta_modelA"   "rmse_beta_modelA"   "amd_beta_modelA"         ///
>                                                    "sesgo_medio_gamma1_modelA"  "sesgo_mediano_gamma1_modelA" "de_gamma1_modelA" "rmse_gamma1_modelA" "amd_gamma1_modelA"       ///
>                                                    "sesgo_medio_gamma2_modelA"  "sesgo_mediano_gamma2_modelA" "de_gamma2_modelA" "rmse_gamma2_modelA" "amd_gamma2_modelA"       ///
>                                                    "sesgo_medio_beta_modelB"    "sesgo_mediano_beta_modelB"   "de_beta_modelB"   "rmse_beta_modelB"   "amd_beta_modelB"         ///
>                                                    "sesgo_medio_gamma1_modelB"  "sesgo_mediano_gamma1_modelB" "de_gamma1_modelB" "rmse_gamma1_modelB" "amd_gamma1_modelB"       ///
>                                                    "sesgo_medio_gamma2_modelB"  "sesgo_mediano_gamma2_modelB" "de_gamma2_modelB" "rmse_gamma2_modelB" "amd_gamma2_modelB"       ///
>                                                    "sesgo_medio_beta_modelC"    "sesgo_mediano_beta_modelC"   "de_beta_modelC"   "rmse_beta_modelC"   "amd_beta_modelC"         ///
>                                                    "sesgo_medio_gamma1_modelC"  "sesgo_mediano_gamma1_modelC" "de_gamma1_modelC" "rmse_gamma1_modelC" "amd_gamma1_modelC"       ///
>                                                    "sesgo_medio_gamma2_modelC"  "sesgo_mediano_gamma2_modelC" "de_gamma2_modelC" "rmse_gamma2_modelC" "amd_gamma2_modelC"
{txt}
{com}. matrix colnames results1 = "N_20" "N_40" "N_100"
{txt}
{com}. 
. local i=1
{txt}
{com}. quietly foreach N of global samples {c -(}
{txt}Simulación con tamaño de muestra N={res}20
{txt}Simulación con tamaño de muestra N={res}40
{txt}Simulación con tamaño de muestra N={res}100
{txt}
{com}. 
. *RESULTADOS FINALES*
. 
. drop _all
{txt}
{com}. matrix list results1
{res}
{txt}results1[45,3]
                    N_20        N_40       N_100
sesgo_medi~A {res}  .74220364   .94599501   .99853808
{txt}sesgo_medi~A {res}  .47689646    .7824713   .93212539
{txt}de_beta_mo~A {res}  3.1819254   1.7424082   .97073027
{txt}rmse_beta_~A {res}   3.265791   1.9818822   1.3922835
{txt}amd_beta_m~A {res}  1.9371672   1.4128249   1.1109562
{txt}sesgo_medi~A {res}  .12375428   .23850084   .33167349
{txt}sesgo_medi~A {res}    .001926   .14980304   .29680008
{txt}de_gamma1_~A {res}  .88622872   .64258693   .40912978
{txt}rmse_gamma~A {res}  .89438866   .68511874   .52652359
{txt}amd_gamma1~A {res}  .63049994   .49607184   .40580561
{txt}sesgo_medi~A {res}  .11504658   .26075384   .34730739
{txt}sesgo_medi~A {res} -.04744816    .1637848   .29602271
{txt}de_gamma2_~A {res}  1.0032178   .67037878   .42228204
{txt}rmse_gamma~A {res}  1.0092944   .71899295   .54659511
{txt}amd_gamma2~A {res}    .640205   .51484076   .42076022
{txt}sesgo_medi~B {res}  1.6131954     1.85393    2.078772
{txt}sesgo_medi~B {res}  1.2220745   1.6886482   2.0128814
{txt}de_beta_mo~B {res}    3.35776   2.1825896   1.0770742
{txt}rmse_beta_~B {res}  3.7236645    2.862864   2.3409874
{txt}amd_beta_m~B {res}  2.4005521   2.1641554   2.0989168
{txt}sesgo_medi~B {res}  .03818519   .17654432   .22083209
{txt}sesgo_medi~B {res} -.03210586   .13187218   .19964916
{txt}de_gamma1_~B {res}  .53371223   .39392705   .24509635
{txt}rmse_gamma~B {res}  .53481025   .43149883   .32981656
{txt}amd_gamma1~B {res}   .4065692   .31698057   .25857154
{txt}sesgo_medi~B {res}  .05256386   .18409873   .22437147
{txt}sesgo_medi~B {res} -.02720758    .1359365    .2159785
{txt}de_gamma2_~B {res}  .56400722   .40033064    .2580963
{txt}rmse_gamma~B {res}  .56617047   .44045056   .34189127
{txt}amd_gamma2~B {res}  .41969171   .32697033   .27194499
{txt}sesgo_medi~C {res}  1.4320387   1.7974611   2.0349348
{txt}sesgo_medi~C {res}  1.0347147    1.650396   1.9575183
{txt}de_beta_mo~C {res}  5.6828438   2.6102273   1.3612778
{txt}rmse_beta_~C {res}   5.857743   3.1681761   2.4478937
{txt}amd_beta_m~C {res}  2.8504485   2.2946203   2.0887903
{txt}sesgo_medi~C {res}  .09848988   .21722087   .27425425
{txt}sesgo_medi~C {res}  .00431734   .14851397   .24167955
{txt}de_gamma1_~C {res}  .73142721   .48724846   .32040586
{txt}rmse_gamma~C {res}  .73766594    .5332528   .42163094
{txt}amd_gamma1~C {res}  .50962373   .39020925   .32365632
{txt}sesgo_medi~C {res}  .07601398   .23196125   .28311883
{txt}sesgo_medi~C {res} -.05481565   .16506565    .2610386
{txt}de_gamma2_~C {res}  .74133548   .51832869    .3283628
{txt}rmse_gamma~C {res}  .74485357   .56762838    .4334404
{txt}amd_gamma2~C {res}  .51233864   .40929042   .33615197
{reset}
{com}. matrix define results1_t=results1'
{txt}
{com}. svmat results1_t, names(col)
{txt}number of observations will be reset to 3
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 3.
{p_end}

{com}. 
. local i=1
{txt}
{com}. generate N=.
{txt}(3 missing values generated)

{com}. foreach N of global samples {c -(}
{txt}  2{com}.         replace N=`N' in `i'
{txt}  3{com}.         local i=`i'+1
{txt}  4{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. order N, first
{txt}
{com}. save "results1_matriz", replace
{txt}{p 0 4 2}
file {bf}
results1_matriz.dta{rm}
saved
{p_end}

{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 2 *
. ********************************************************************************
. 
. 
. *SIMULACIÓN (S=1)*
. 
. quietly foreach N of global samples {c -(}
{txt}Simulación (S=1) con tamaño de muestra N={res}20
{txt}Simulación (S=1) con tamaño de muestra N={res}40
{txt}Simulación (S=1) con tamaño de muestra N={res}100
{txt}
{com}. 
. 
. *INTERVALOS DE CONFIANZA DE 95% A PARTIR DE BOOTSTRAPPING*
. 
. 
. local n=1
{txt}
{com}. quietly foreach N of global samples {c -(}
{txt}Intervalos de confianza de 95% a partir de bootstrapping con tamaño de muestra N={res}20
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}Intervalos de confianza de 95% a partir de bootstrapping con tamaño de muestra N={res}40
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}Intervalos de confianza de 95% a partir de bootstrapping con tamaño de muestra N={res}100
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}
{com}. 
. *Resultados finales*
. 
. drop _all
{txt}
{com}. matrix list intconf95_boot
{res}
{txt}intconf95_boot[9,6]
    modelA_inf  modelA_sup  modelB_inf  modelB_sup  modelC_inf  modelC_sup
r1 {res}  1.6535446   5.3012288   .21780375   2.0575889   .81551638   1.3772825
{txt}r2 {res}  1.0638757   2.7047769   .87662119   1.6044336    2.241968   3.7615576
{txt}r3 {res}  1.0348734   2.3958006   .94116795   1.6051363   1.8648947   2.9555838
{txt}r4 {res}  6.0320137   7.9818618   3.3462564   5.0012982   2.5220248    6.037276
{txt}r5 {res}  1.6099753   2.4107362   1.5756884   2.2992986   1.2034408   1.9686817
{txt}r6 {res}  1.9675536   2.8055981   2.0141172   2.7287102   1.6778141    2.549032
{txt}r7 {res}  5.6498084   6.3360634   5.3346326   6.0067263   6.2895269   7.0702341
{txt}r8 {res}  1.6568824   2.0417849   1.7005792   2.0925393   1.8300663   2.2599708
{txt}r9 {res}  1.6988078    2.079008   1.6090939   1.9815832   1.6426938   2.0304027
{reset}
{com}. svmat intconf95_boot, names(col)
{txt}number of observations will be reset to 9
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 9.
{p_end}

{com}. 
. generate N=.
{txt}(9 missing values generated)

{com}. replace N=20 in 1/3
{txt}(3 real changes made)

{com}. replace N=40 in 4/6
{txt}(3 real changes made)

{com}. replace N=100 in 7/9
{txt}(3 real changes made)

{com}. 
. generate param=""
{txt}(9 missing values generated)

{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         if (`i'==1 | `i'==4 | `i'==7) replace param="beta" in `i'
{txt}  3{com}.         if (`i'==2 | `i'==5 | `i'==8) replace param="gamma1" in `i'
{txt}  4{com}.         if (`i'==3 | `i'==6 | `i'==9) replace param="gamma2" in `i'
{txt}  5{com}. {c )-}
{txt}variable {bf}{res}param{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str4{sf}
{txt}(1 real change made)
variable {bf}{res}param{sf}{txt} was {bf}{res}str4{sf}{txt} now {bf}{res}str6{sf}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. order N param, first
{txt}
{com}. save "results_boot_intconf95", replace
{txt}{p 0 4 2}
file {bf}
results_boot_intconf95.dta{rm}
saved
{p_end}

{com}. 
. 
. *INTERVALOS DE CONFIANZA A PARTIR DE LA MATRIZ DE VARIANZAS Y COVARIANZAS ASINTÓTICA*
. 
. 
. local n=1
{txt}
{com}. quietly foreach N of global samples {c -(}
{txt}Intervalos de confianza de 95% a partir de la matriz de varianzas y covarianzas asintóticas con tamaño de muestra N={res}20
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}Intervalos de confianza de 95% a partir de la matriz de varianzas y covarianzas asintóticas con tamaño de muestra N={res}40
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}Intervalos de confianza de 95% a partir de la matriz de varianzas y covarianzas asintóticas con tamaño de muestra N={res}100
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 886 887 888 889 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 949 950 951 952 953 954 955 956 957 958 959 960 961 962 963 964 965 966 967 968 969 970 971 972 973 974 975 976 977 978 979 980 981 982 983 984 985 986 987 988 989 990 991 992 993 994 995 996 997 998 999 1000 

{txt}
{com}. 
. *Resultados finales*
. 
. drop _all
{txt}
{com}. matrix list intconf95_var
{res}
{txt}intconf95_var[9,6]
    modelA_inf  modelA_sup  modelB_inf  modelB_sup  modelC_inf  modelC_sup
r1 {res} -1.3814705   4.4735584  -1.1447706   2.9282589  -1.9651218   3.3851252
{txt}r2 {res}   .4109693   1.6147739   .53044018   1.5440751   .80310836   2.7635837
{txt}r3 {res}  .37286624    1.848801    .6066961    1.617398   .82555744   2.2771218
{txt}r4 {res}  .86564711   4.3217359   .05242506   3.5786326   .14283185     4.05599
{txt}r5 {res}  .71098351   1.8719847   .86713025   1.4674848   .61890939   1.6420571
{txt}r6 {res}  .77054563   2.1082891   .99274546   1.8049605   .69753608   1.9861857
{txt}r7 {res}  1.5609039    3.181792   1.5987944   2.9618351   1.5626906   3.5489967
{txt}r8 {res}  .95273864   1.6110189   .99435493   1.6960626    1.045826   1.8078989
{txt}r9 {res}  1.0047017   1.7317509   .97577727   1.6399965   1.0152771   1.7473067
{reset}
{com}. svmat intconf95_var, names(col)
{txt}number of observations will be reset to 9
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 9.
{p_end}

{com}. 
. generate N=.
{txt}(9 missing values generated)

{com}. replace N=20 in 1/3
{txt}(3 real changes made)

{com}. replace N=40 in 4/6
{txt}(3 real changes made)

{com}. replace N=100 in 7/9
{txt}(3 real changes made)

{com}. 
. generate param=""
{txt}(9 missing values generated)

{com}. forvalues i=1(1)9 {c -(}
{txt}  2{com}.         if (`i'==1 | `i'==4 | `i'==7) replace param="beta" in `i'
{txt}  3{com}.         if (`i'==2 | `i'==5 | `i'==8) replace param="gamma1" in `i'
{txt}  4{com}.         if (`i'==3 | `i'==6 | `i'==9) replace param="gamma2" in `i'
{txt}  5{com}. {c )-}
{txt}variable {bf}{res}param{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str4{sf}
{txt}(1 real change made)
variable {bf}{res}param{sf}{txt} was {bf}{res}str4{sf}{txt} now {bf}{res}str6{sf}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. order N param, first
{txt}
{com}. save "results_var_intconf95", replace
{txt}{p 0 4 2}
file {bf}
results_var_intconf95.dta{rm}
saved
{p_end}

{com}. 
. 
. *##############################################################################*
. ************** 2. PROPIEDADES DE MUESTRA FINITA EN PANELES DINÁMICOS ***********
. *##############################################################################*
. 
. 
. global reps=1000
{txt}
{com}. 
. *PROGRAMA*
. 
. program define simulation2, rclass
{txt}  1{com}. 
.         *Seteo*
.         drop _all
{txt}  2{com}.         local N=$N
{txt}  3{com}.         local T=${c -(}T{c )-}+10
{txt}  4{com}.         local NT=`N'*`T'
{txt}  5{com}.         set obs `NT'
{txt}  6{com}.         egen id=seq(), from(1) to(`N') block(`T')
{txt}  7{com}.         egen t=seq(), from(1) to(`T')
{txt}  8{com}.         xtset id t
{txt}  9{com}. 
.         *Variables*
.         generate c=.
{txt} 10{com}.         forvalues id=1(1)`N' {c -(}
{txt} 11{com}.                 local aux=rnormal()
{txt} 12{com}.                 replace c=`aux' if (id==`id')
{txt} 13{com}.         {c )-}
{txt} 14{com}.         generate u=rnormal()
{txt} 15{com}.         generate v=rnormal(0,0.9^(1/2))
{txt} 16{com}.         generate x=0
{txt} 17{com}.         replace x=0.8*x[_n-1]+v if t>=2
{txt} 18{com}.         generate y=0
{txt} 19{com}.         replace y=${c -(}alpha{c )-}*y[_n-1]+${c -(}beta{c )-}*x+c+u if t>=2
{txt} 20{com}.         generate yL1=L.y
{txt} 21{com}.         generate yL2=L.yL1
{txt} 22{com}.         generate yD1=y-y[_n-1]
{txt} 23{com}.         generate yL1D1=yL1-yL1[_n-1]
{txt} 24{com}.         generate xD1=x-x[_n-1]
{txt} 25{com}.         keep if (t>10)
{txt} 26{com}.         replace t=t-10
{txt} 27{com}.         sort id t
{txt} 28{com}. 
.         *LSDV*
.         regress y yL1 x i.id, robust
{txt} 29{com}.         return scalar alpha_lsdv=e(b)[1,1]
{txt} 30{com}.         test yL1=${c -(}alpha{c )-}
{txt} 31{com}.         return scalar pvalue_alpha_lsdv=r(p)
{txt} 32{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 33{com}.                 return scalar beta_lsdv=e(b)[1,2]
{txt} 34{com}.                 test x=${c -(}beta{c )-}
{txt} 35{com}.                 return scalar pvalue_beta_lsdv=r(p)
{txt} 36{com}.         {c )-}
{txt} 37{com}. 
.         *AB GMM1*
.         xtabond2 y yL1 x, gmmstyle(L.y) ivstyle(x) robust noleveleq
{txt} 38{com}.         return scalar alpha_ab_gmm1=e(b)[1,1]
{txt} 39{com}.         test yL1=${c -(}alpha{c )-}
{txt} 40{com}.         return scalar pvalue_alpha_ab_gmm1=r(p)
{txt} 41{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 42{com}.                 return scalar beta_ab_gmm1=e(b)[1,2]
{txt} 43{com}.                 test x=${c -(}beta{c )-}
{txt} 44{com}.                 return scalar pvalue_beta_ab_gmm1=r(p)
{txt} 45{com}.         {c )-}
{txt} 46{com}. 
.         *AB GMM2*
.         xtabond2 y yL1 x, gmmstyle(L.y) ivstyle(x) twostep robust noleveleq
{txt} 47{com}.         return scalar alpha_ab_gmm2=e(b)[1,1]
{txt} 48{com}.         test yL1=${c -(}alpha{c )-}
{txt} 49{com}.         return scalar pvalue_alpha_ab_gmm2=r(p)
{txt} 50{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 51{com}.                 return scalar beta_ab_gmm2=e(b)[1,2]
{txt} 52{com}.                 test x=${c -(}beta{c )-}
{txt} 53{com}.                 return scalar pvalue_beta_ab_gmm2=r(p)
{txt} 54{com}.         {c )-}
{txt} 55{com}. 
.         *BB GMM1*
.         xtabond2 y yL1 x, gmmstyle(L.y) ivstyle(x, equation(level)) robust
{txt} 56{com}.         return scalar alpha_bb_gmm1=e(b)[1,1]
{txt} 57{com}.         test yL1=${c -(}alpha{c )-}
{txt} 58{com}.         return scalar pvalue_alpha_bb_gmm1=r(p)
{txt} 59{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 60{com}.                 return scalar beta_bb_gmm1=e(b)[1,2]
{txt} 61{com}.                 test x=${c -(}beta{c )-}
{txt} 62{com}.                 return scalar pvalue_beta_bb_gmm1=r(p)
{txt} 63{com}.         {c )-}
{txt} 64{com}. 
.         *AH*
.         ivregress 2sls yD1 (yL1D1=yL2) xD1, noconstant robust
{txt} 65{com}.         return scalar alpha_ah=e(b)[1,1]
{txt} 66{com}.         test yL1D1=${c -(}alpha{c )-}
{txt} 67{com}.         return scalar pvalue_alpha_ah=r(p)
{txt} 68{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 69{com}.                 return scalar beta_ah=e(b)[1,2]
{txt} 70{com}.                 test xD1=${c -(}beta{c )-}
{txt} 71{com}.                 return scalar pvalue_beta_ah=r(p)
{txt} 72{com}.         {c )-}
{txt} 73{com}. 
.         *KIVIET*
.         xtlsdvc y x, initial(ah) bias(2)
{txt} 74{com}.         return scalar alpha_kiviet=e(b)[1,1]
{txt} 75{com}.         scalar alpha_lsdvc=e(b)[1,1]
{txt} 76{com}.         scalar beta_lsdvc=e(b)[1,2]
{txt} 77{com}.         scalar NT=e(N)
{txt} 78{com}.         scalar T=e(Tbar)
{txt} 79{com}.         scalar N=e(N_g)
{txt} 80{com}.         scalar K=colsof(e(b))
{txt} 81{com}.         egen mean_y=mean(y), by(id)
{txt} 82{com}.         egen mean_yL1=mean(yL1), by(id)
{txt} 83{com}.         egen mean_x=mean(x), by(id)
{txt} 84{com}.         generate within_y=y-mean_y
{txt} 85{com}.         generate within_yL1=yL1-mean_yL1
{txt} 86{com}.         generate within_x=yL1-mean_x
{txt} 87{com}.         generate e=within_y-alpha_lsdvc*within_yL1-beta_lsdvc*within_x
{txt} 88{com}.         matrix accum ZtZ=within_yL1 within_x, noconstant
{txt} 89{com}.         matrix accum ete=e, noconstant
{txt} 90{com}.         matrix define s2=ete/(NT-N-T-K+1)
{txt} 91{com}.         matrix define V=s2*invsym(ZtZ)
{txt} 92{com}.         scalar se_alpha_lsdvc=sqrt(V[1,1])
{txt} 93{com}.         scalar tstat_alpha=(alpha_lsdvc-${c -(}alpha{c )-})/se_alpha_lsdvc
{txt} 94{com}.         scalar pvalue_alpha=2*ttail(NT-K,abs(tstat_alpha))
{txt} 95{com}.         return scalar pvalue_alpha_kiviet=pvalue_alpha
{txt} 96{com}.         if (${c -(}ej{c )-}==6) {c -(}
{txt} 97{com}.                 return scalar beta_kiviet=e(b)[1,2]
{txt} 98{com}.                 scalar se_beta_lsdvc=sqrt(V[2,2])
{txt} 99{com}.                 scalar tstat_beta=(beta_lsdvc-${c -(}beta{c )-})/se_beta_lsdvc
{txt}100{com}.                 scalar pvalue_beta=2*ttail(NT-K,abs(tstat_beta))
{txt}101{com}.                 return scalar pvalue_beta_kiviet=pvalue_beta
{txt}102{com}.         {c )-}
{txt}103{com}. 
. end
{txt}
{com}. 
. *SIMULACIONES*
. 
. local models="lsdv ab_gmm1 ab_gmm2 bb_gmm1 ah kiviet"
{txt}
{com}. local exercises="1 2 3 4 5 6 7"
{txt}
{com}. local cols: word count `exercises'
{txt}
{com}. 
. matrix define   params=[0.5,0,30,10\0.5,0,50,10\0.8,0,30,20\0.92,0,30,20\0.5,0,50,30\0.8,1,100,7\0.8,0,100,4]
{txt}
{com}. matrix rownames params="ej1" "ej2" "ej3" "ej4" "ej5" "ej6" "ej7"
{txt}
{com}. matrix colnames params="alpha" "beta" "N" "T"
{txt}
{com}. matrix list params
{res}
{txt}params[7,4]
     alpha   beta      N      T
ej1 {res}    .5      0     30     10
{txt}ej2 {res}    .5      0     50     10
{txt}ej3 {res}    .8      0     30     20
{txt}ej4 {res}   .92      0     30     20
{txt}ej5 {res}    .5      0     50     30
{txt}ej6 {res}    .8      1    100      7
{txt}ej7 {res}    .8      0    100      4
{reset}
{com}. 
. matrix define   results2 = J(48,`cols',.)
{txt}
{com}. matrix rownames results2 = "media_alpha_lsdv"    "de_alpha_lsdv"        "rmse_alpha_lsdv"        "tam_test_alpha_lsdv"          ///
>                                                    "media_alpha_ab_gmm1" "de_alpha_ab_gmm1" "rmse_alpha_ab_gmm1" "tam_test_alpha_ab_gmm1"       ///
>                                                    "media_alpha_ab_gmm2" "de_alpha_ab_gmm2" "rmse_alpha_ab_gmm2" "tam_test_alpha_ab_gmm2"       ///
>                                                    "media_alpha_bb_gmm1" "de_alpha_bb_gmm1" "rmse_alpha_bb_gmm1" "tam_test_alpha_bb_gmm1"       ///
>                                                    "media_alpha_ah"              "de_alpha_ah"          "rmse_alpha_ah"          "tam_test_alpha_ah"            ///
>                                                    "media_alpha_kiviet"  "de_alpha_kiviet"  "rmse_alpha_kiviet2" "tam_test_alpha_kiviet"        ///
>                                                    "media_beta_lsdv"     "de_beta_lsdv"         "rmse_beta_lsdv"         "tam_test_beta_lsdv"           ///
>                                                    "media_beta_ab_gmm1"  "de_beta_ab_gmm1"      "rmse_beta_ab_gmm1"  "tam_test_beta_ab_gmm1"    ///
>                                                    "media_beta_ab_gmm2"  "de_beta_ab_gmm2"      "rmse_beta_ab_gmm2"  "tam_test_beta_ab_gmm2"    ///
>                                                    "media_beta_bb_gmm1"  "de_beta_bb_gmm1"      "rmse_beta_bb_gmm1"  "tam_test_beta_bb_gmm1"    ///
>                                                    "media_beta_ah"               "de_beta_ah"           "rmse_beta_ah"           "tam_test_beta_ah"                     ///
>                                                    "media_beta_kiviet"   "de_beta_kiviet"       "rmse_beta_kiviet"       "tam_test_beta_kiviet"
{txt}
{com}. matrix colnames results2 = "ej1" "ej2" "ej3" "ej4" "ej5" "ej6" "ej7"
{txt}
{com}. 
. quietly foreach ej of local exercises {c -(}
{txt}Simulación con parámetros de ejercicio {res}1
{txt}Simulación con parámetros de ejercicio {res}2
{txt}Simulación con parámetros de ejercicio {res}3
{txt}Simulación con parámetros de ejercicio {res}4
{txt}Simulación con parámetros de ejercicio {res}5
{txt}Simulación con parámetros de ejercicio {res}6
{txt}Simulación con parámetros de ejercicio {res}7
{txt}
{com}. 
. *RESULTADOS FINALES*
. 
. drop _all
{txt}
{com}. matrix list results2
{res}
{txt}results2[48,7]
                    ej1        ej2        ej3        ej4        ej5        ej6        ej7
media_alph~v {res} .33312299  .33650002  .69092022  .84421561  .44636057  .72783059  .28694187
{txt}de_alpha_l~v {res} .05759818  .04339802  .03354796  .02410425  .02360246  .01876085  .05682751
{txt}rmse_alpha~v {res} .17652809  .16915598  .11411722  .07952174  .05859785  .07456568  .51619258
{txt}tam_test_a~v {res}      62.8       87.3       84.4       87.7       38.6       92.7        100
{txt}media_alph~1 {res} .39954385  .43265706  .66645008  .84111552  .46015554  .76825178  .20473562
{txt}de_alpha_a~1 {res} .10027277  .08380169  .06009771  .04524618  .02923364  .07282057  1.0251284
{txt}rmse_alpha~1 {res} .14190141  .10747452  .14643669  .09092816  .04940984  .07940707  1.1849797
{txt}tam_test_a~1 {res}       6.7        3.7       41.8       29.9       11.1         .7        8.5
{txt}media_alph~2 {res} .39662797  .43013519  .62993965  .84192748  .42318017  .76645576  .18467731
{txt}de_alpha_a~2 {res} .10361901  .09063019  .08804819  .05295759   .0593368  .07880994  1.0435557
{txt}rmse_alpha~2 {res} .14632819  .11439715  .19148173  .09432402  .09704958  .08561549  1.2110084
{txt}tam_test_a~2 {res}         4        3.1        9.5         10        1.1         .8       12.1
{txt}media_alph~1 {res} .68687548  .64112471  .96133931  1.0109221  .76369786  .85351059  .89462721
{txt}de_alpha_b~1 {res} .09109805  .07660921   .0162676  .00488891  .04042491  .04213382  .09159332
{txt}rmse_alpha~1 {res} .20787737  .16055929  .16215654  .09105335  .26677537  .06809454  .13166342
{txt}tam_test_a~1 {res}      54.3       41.4        100        100        100         22         30
{txt}media_alph~h {res} .50447166  .50324122  .87277212  .92041579  .50154071  .99520077  .97411911
{txt} de_alpha_ah {res} .13475593  .10202581  1.5688434  .08719152  .04921859  7.1623334  27.976371
{txt}rmse_alpha~h {res} .13476275  .10202628  1.5697466   .0871489   .0492181  7.1614122  27.962922
{txt}tam_test_a~h {res}         0          0          0          0          0          0          0
{txt}media_alph~t {res} .49233357  .49381213  .77925225   .9048812  .49880848  .80969698  .40349524
{txt}de_alpha_k~t {res} .07822353   .0607467  .04423323  .02982278  .02569034  .05406844  .19977267
{txt}rmse_alpha~2 {res} .07855938  .06103083  .04883739  .03342285  .02570513   .0549045  .44394283
{txt}tam_test_a~t {res}       2.5        2.8        7.7        6.5         .5          0       77.1
{txt}media_beta~v {res}         .          .          .          .          .   1.019895          .
{txt}de_beta_lsdv {res}         .          .          .          .          .  .04002314          .
{txt}rmse_beta_~v {res}         .          .          .          .          .  .04467729          .
{txt}tam_test_b~v {res}         .          .          .          .          .        2.2          .
{txt}media_beta~1 {res}         .          .          .          .          .  .99456613          .
{txt}de_beta_ab~1 {res}         .          .          .          .          .  .05856521          .
{txt}rmse_beta_~1 {res}         .          .          .          .          .  .05878759          .
{txt}tam_test_b~1 {res}         .          .          .          .          .        1.5          .
{txt}media_beta~2 {res}         .          .          .          .          .  .98197292          .
{txt}de_beta_ab~2 {res}         .          .          .          .          .  .06227972          .
{txt}rmse_beta_~2 {res}         .          .          .          .          .  .06480632          .
{txt}tam_test_b~2 {res}         .          .          .          .          .        1.2          .
{txt}media_beta~1 {res}         .          .          .          .          .  .88044556          .
{txt}de_beta_bb~1 {res}         .          .          .          .          .  .09339241          .
{txt}rmse_beta_~1 {res}         .          .          .          .          .  .15167954          .
{txt}tam_test_b~1 {res}         .          .          .          .          .         17          .
{txt}media_beta~h {res}         .          .          .          .          .  1.0656044          .
{txt}  de_beta_ah {res}         .          .          .          .          .  2.3270181          .
{txt}rmse_beta_ah {res}         .          .          .          .          .  2.3267794          .
{txt}tam_test_b~h {res}         .          .          .          .          .          0          .
{txt}media_beta~t {res}         .          .          .          .          .  1.0106136          .
{txt}de_beta_ki~t {res}         .          .          .          .          .  .05494028          .
{txt}rmse_beta_~t {res}         .          .          .          .          .   .0559291          .
{txt}tam_test_b~t {res}         .          .          .          .          .        2.2          .
{reset}
{com}. matrix define results2_t=results2'
{txt}
{com}. svmat results2_t, names(col)
{txt}number of observations will be reset to 7
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 7.
{p_end}

{com}. 
. local i=1
{txt}
{com}. generate ej=.
{txt}(7 missing values generated)

{com}. foreach ej of local exercises {c -(}
{txt}  2{com}.         replace ej=`ej' in `i'
{txt}  3{com}.         local i=`i'+1
{txt}  4{com}. {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

{com}. 
. order ej, first
{txt}
{com}. save "results2_matriz", replace
{txt}{p 0 4 2}
file {bf}
results2_matriz.dta{rm}
saved
{p_end}

{com}. 
. 
. *##############################################################################*
. *************** 3. ELASTICIDAD PRECIO DE DEMANDA DE LOS CIGARRILLOS ************
. *##############################################################################*
. 
. 
. use "cigs", clear
{txt}
{com}. describe

{txt}Contains data from {res}cigs.dta
{txt} Observations:{res}         1,380                  
{txt}    Variables:{res}            12                  20 May 2024 11:12
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:state          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:year           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:price          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:pop            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:pop16          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cpi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ndi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sales          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:pimin          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:lnprice        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:lnventas       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:obs            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}state  year
{txt}
{com}. 
. xtset state year
{res}
{col 1}{txt:Panel variable: }{res:state}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:63}}{txt: to }{res:{bind:92}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtdescribe

   {txt}state:  {res}1{txt}, {res}3{txt}, ..., {res}51                                     {txt}n ={res}         46
    {txt}year:  {res}63, 64, ..., 92                                   {txt}T ={res}         30
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}30 periods
           {txt}(state*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}    30      30      30        30        30      30      30

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 30}
{res}       46    100.00  100.00{txt} {c |}  {res}111111111111111111111111111111
{txt} {hline 27}{c +}{c -}{c -}{hline 30}
{res}       46    100.00        {txt} {c |}  {res}XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
{txt}
{com}. 
. local vars="ln_price ndi cpi pop16"
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 1 *
. ********************************************************************************
. 
. 
. generate ln_sales=ln(sales)
{txt}
{com}. generate ln_price=ln(price)
{txt}
{com}. 
. regress ln_sales `vars', robust

{txt}Linear regression                               Number of obs     = {res}     1,380
                                                {txt}F(4, 1375)        =  {res}    76.11
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2196
                                                {txt}Root MSE          =    {res}  .1987

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_price {c |}{col 14}{res}{space 2}-.8385905{col 26}{space 2} .0522926{col 37}{space 1}  -16.04{col 46}{space 3}0.000{col 54}{space 4}-.9411723{col 67}{space 3}-.7360086
{txt}{space 9}ndi {c |}{col 14}{res}{space 2} .0000319{col 26}{space 2} 4.77e-06{col 37}{space 1}    6.69{col 46}{space 3}0.000{col 54}{space 4} .0000225{col 67}{space 3} .0000412
{txt}{space 9}cpi {c |}{col 14}{res}{space 2} .0075624{col 26}{space 2} .0007855{col 37}{space 1}    9.63{col 46}{space 3}0.000{col 54}{space 4} .0060216{col 67}{space 3} .0091032
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2}-2.53e-06{col 26}{space 2} 1.43e-06{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4}-5.33e-06{col 67}{space 3} 2.65e-07
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.410038{col 26}{space 2} .1602936{col 37}{space 1}   46.23{col 46}{space 3}0.000{col 54}{space 4} 7.095591{col 67}{space 3} 7.724484
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estimates store est_pols
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 2 *
. ********************************************************************************
. 
. 
. xtreg ln_sales `vars', fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     1,380
{txt}Group variable: {res}state{txt}{col 49}Number of groups{col 67}={col 69}{res}        46

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.4163{col 63}{txt}min{col 67}={col 69}{res}        30
{txt}     Between = {res}0.0194{col 63}{txt}avg{col 67}={col 69}{res}      30.0
{txt}     Overall = {res}0.0491{col 63}{txt}max{col 67}={col 69}{res}        30

{txt}{col 49}F({res}4{txt},{res}1330{txt}){col 67}={col 70}{res}   237.09
{txt}corr(u_i, Xb) = {res}-0.2658{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_price {c |}{col 14}{res}{space 2}-.3984733{col 26}{space 2} .0328031{col 37}{space 1}  -12.15{col 46}{space 3}0.000{col 54}{space 4}-.4628247{col 67}{space 3}-.3341219
{txt}{space 9}ndi {c |}{col 14}{res}{space 2}-.0000481{col 26}{space 2} 3.17e-06{col 37}{space 1}  -15.19{col 46}{space 3}0.000{col 54}{space 4}-.0000543{col 67}{space 3}-.0000419
{txt}{space 9}cpi {c |}{col 14}{res}{space 2} .0105834{col 26}{space 2} .0005235{col 37}{space 1}   20.22{col 46}{space 3}0.000{col 54}{space 4} .0095565{col 67}{space 3} .0116103
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2} 7.77e-06{col 26}{space 2} 4.25e-06{col 37}{space 1}    1.83{col 46}{space 3}0.068{col 54}{space 4}-5.72e-07{col 67}{space 3} .0000161
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.967983{col 26}{space 2} .0983383{col 37}{space 1}   60.69{col 46}{space 3}0.000{col 54}{space 4} 5.775068{col 67}{space 3} 6.160898
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .20556957
     {txt}sigma_e {c |} {res} .09935482
         {txt}rho {c |} {res}    .81064{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}45{txt}, {res}1330{txt}) = {res}92.66{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. estimates store est_fe
{txt}
{com}. matrix define b_fe=e(b)
{txt}
{com}. matrix define V_fe=e(V)
{txt}
{com}. 
. xtreg ln_sales `vars', re
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     1,380
{txt}Group variable: {res}state                           {txt}Number of groups  = {res}        46

{txt}R-squared:                                      Obs per group:
     Within  = {res}0.4160                                         {txt}min = {res}        30
{txt}     Between = {res}0.0137                                         {txt}avg = {res}      30.0
{txt}     Overall = {res}0.0554                                         {txt}max = {res}        30

                                                {txt}Wald chi2({res}4{txt})      =  {res}   912.21
{txt}corr(u_i, X) = {res}0{txt} (assumed)                      Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_price {c |}{col 14}{res}{space 2}-.4111023{col 26}{space 2} .0330405{col 37}{space 1}  -12.44{col 46}{space 3}0.000{col 54}{space 4}-.4758604{col 67}{space 3}-.3463442
{txt}{space 9}ndi {c |}{col 14}{res}{space 2}-.0000454{col 26}{space 2} 3.17e-06{col 37}{space 1}  -14.31{col 46}{space 3}0.000{col 54}{space 4}-.0000516{col 67}{space 3}-.0000392
{txt}{space 9}cpi {c |}{col 14}{res}{space 2} .0104635{col 26}{space 2}  .000527{col 37}{space 1}   19.85{col 46}{space 3}0.000{col 54}{space 4} .0094305{col 67}{space 3} .0114965
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2} 6.33e-06{col 26}{space 2} 3.59e-06{col 37}{space 1}    1.76{col 46}{space 3}0.078{col 54}{space 4}-7.09e-07{col 67}{space 3} .0000134
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.012843{col 26}{space 2} .1015345{col 37}{space 1}   59.22{col 46}{space 3}0.000{col 54}{space 4} 5.813839{col 67}{space 3} 6.211847
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .1526963
     {txt}sigma_e {c |} {res} .09935482
         {txt}rho {c |} {res} .70255765{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. estimates store est_re
{txt}
{com}. matrix define b_re=e(b)
{txt}
{com}. matrix define V_re=e(V)
{txt}
{com}. 
. hausman est_fe est_re

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:3}) does not equal the number of coefficients being tested ({result:4}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}   est_fe   {col 30}   est_re   {col 46}Difference{col 63}Std. err.
{hline 13}{c +}{hline 64}
{space 4}ln_price {c |}{res}{col 18}-.3984733{col 31}-.4111023{col 47}  .012629{col 63}        .
{txt}{space 9}ndi {c |}{res}{col 18}-.0000481{col 31}-.0000454{col 47}-2.67e-06{col 63}        .
{txt}{space 9}cpi {c |}{res}{col 18} .0105834{col 31} .0104635{col 47}   .00012{col 63}        .
{txt}{space 7}pop16 {c |}{res}{col 18} 7.77e-06{col 31} 6.33e-06{col 47} 1.44e-06{col 63} 2.28e-06
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = Consistent under H0 and Ha; obtained from {bf:xtreg}.}
{ralign 78:B = Inconsistent under Ha, efficient under H0; obtained from {bf:xtreg}.}

Test of H0: Difference in coefficients not systematic

{ralign 7:chi2({res:3})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 8} = {res:-114.55}

{p 0 9 0 50}Warning: chi2 < 0 ==> model
fitted on these data fails to meet the asymptotic
assumptions of the Hausman test;
see {helpb suest##|_new:suest} for a 
generalized test.{p_end}

{com}. 
. matrix define V=V_fe-V_re
{txt}
{com}. matrix list V
{res}
{txt}symmetric V[5,5]
            ln_price         ndi         cpi       pop16       _cons
ln_price {res} -.00001563
{txt}     ndi {res}  2.274e-10  -4.941e-14
{txt}     cpi {res}  2.247e-07   4.039e-12  -3.774e-09
{txt}   pop16 {res} -1.083e-09  -1.231e-13  -2.763e-11   5.184e-12
{txt}   _cons {res}  .00004886  -4.341e-10  -5.718e-07  -1.010e-08  -.00063883
{reset}
{com}. matrix eigenvalues r c=V
{txt}
{com}. matrix list r                                           /* Efectivamente, la matriz V no es positiva definida */
{res}
{txt}r[1,5]
        ln_price         ndi         cpi       pop16       _cons
real {res} -.00064263  -.00001183  -5.133e-10   9.923e-12  -7.412e-15
{reset}
{com}. matrix list c
{res}
{txt}c[1,5]
         ln_price       ndi       cpi     pop16     _cons
complex {res}        0         0         0         0         0
{reset}
{com}. 
. matselrc V VV, row(1 2 4) col(1 2 4)
{txt}
{com}. matrix list VV
{res}
{txt}symmetric VV[3,3]
            ln_price         ndi       pop16
ln_price {res} -.00001563
{txt}     ndi {res}  2.274e-10  -4.941e-14
{txt}   pop16 {res} -1.083e-09  -1.231e-13   5.184e-12
{reset}
{com}. matrix eigenvalues r c=VV
{txt}
{com}. matrix list r                                           /* Excluyendo las variables que varían sólo a través del tiempo (cpi), el problema persiste (VV no es positiva definida) */
{res}
{txt}r[1,3]
        ln_price         ndi       pop16
real {res} -.00001563   5.263e-12  -4.973e-14
{reset}
{com}. matrix list c
{res}
{txt}c[1,3]
         ln_price       ndi     pop16
complex {res}        0         0         0
{reset}
{com}. 
. hausman est_fe est_re, sigmamore        /* Se utilizan versiones más robustas de este test, ya que la matriz V (y VV) no es positiva definida */

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:3}) does not equal the number of coefficients being tested ({result:4}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}   est_fe   {col 30}   est_re   {col 46}Difference{col 63}Std. err.
{hline 13}{c +}{hline 64}
{space 4}ln_price {c |}{res}{col 18}-.3984733{col 31}-.4111023{col 47}  .012629{col 63} .0033814
{txt}{space 9}ndi {c |}{res}{col 18}-.0000481{col 31}-.0000454{col 47}-2.67e-06{col 63} 4.50e-07
{txt}{space 9}cpi {c |}{res}{col 18} .0105834{col 31} .0104635{col 47}   .00012{col 63} .0000558
{txt}{space 7}pop16 {c |}{res}{col 18} 7.77e-06{col 31} 6.33e-06{col 47} 1.44e-06{col 63} 2.37e-06
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = Consistent under H0 and Ha; obtained from {bf:xtreg}.}
{ralign 78:B = Inconsistent under Ha, efficient under H0; obtained from {bf:xtreg}.}

Test of H0: Difference in coefficients not systematic

{ralign 11:chi2({res:3})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{ralign 11:} = {res:{ralign 6:36.66}}
{ralign 11:Prob > chi2} = {res:{ralign 6:0.0000}}

{com}. hausman est_fe est_re, sigmaless        /* En ambos casos, se rechaza la hipótesis nula */

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:3}) does not equal the number of coefficients being tested ({result:4}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}   est_fe   {col 30}   est_re   {col 46}Difference{col 63}Std. err.
{hline 13}{c +}{hline 64}
{space 4}ln_price {c |}{res}{col 18}-.3984733{col 31}-.4111023{col 47}  .012629{col 63} .0033396
{txt}{space 9}ndi {c |}{res}{col 18}-.0000481{col 31}-.0000454{col 47}-2.67e-06{col 63} 4.45e-07
{txt}{space 9}cpi {c |}{res}{col 18} .0105834{col 31} .0104635{col 47}   .00012{col 63} .0000551
{txt}{space 7}pop16 {c |}{res}{col 18} 7.77e-06{col 31} 6.33e-06{col 47} 1.44e-06{col 63} 2.35e-06
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = Consistent under H0 and Ha; obtained from {bf:xtreg}.}
{ralign 78:B = Inconsistent under Ha, efficient under H0; obtained from {bf:xtreg}.}

Test of H0: Difference in coefficients not systematic

{ralign 11:chi2({res:3})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{ralign 11:} = {res:{ralign 6:37.58}}
{ralign 11:Prob > chi2} = {res:{ralign 6:0.0000}}

{com}. 
. xtreg ln_sales `vars', fe robust
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     1,380
{txt}Group variable: {res}state{txt}{col 49}Number of groups{col 67}={col 69}{res}        46

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.4163{col 63}{txt}min{col 67}={col 69}{res}        30
{txt}     Between = {res}0.0194{col 63}{txt}avg{col 67}={col 69}{res}      30.0
{txt}     Overall = {res}0.0491{col 63}{txt}max{col 67}={col 69}{res}        30

{txt}{col 49}F({res}4{txt},{res}45{txt}){col 67}={col 70}{res}    22.51
{txt}corr(u_i, Xb) = {res}-0.2658{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. err. adjusted for {res:46} clusters in {res:state})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_price {c |}{col 14}{res}{space 2}-.3984733{col 26}{space 2} .0598727{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.5190632{col 67}{space 3}-.2778834
{txt}{space 9}ndi {c |}{col 14}{res}{space 2}-.0000481{col 26}{space 2} .0000101{col 37}{space 1}   -4.74{col 46}{space 3}0.000{col 54}{space 4}-.0000685{col 67}{space 3}-.0000277
{txt}{space 9}cpi {c |}{col 14}{res}{space 2} .0105834{col 26}{space 2} .0013546{col 37}{space 1}    7.81{col 46}{space 3}0.000{col 54}{space 4} .0078551{col 67}{space 3} .0133118
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2} 7.77e-06{col 26}{space 2} .0000178{col 37}{space 1}    0.44{col 46}{space 3}0.664{col 54}{space 4} -.000028{col 67}{space 3} .0000436
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.967983{col 26}{space 2} .1848623{col 37}{space 1}   32.28{col 46}{space 3}0.000{col 54}{space 4} 5.595651{col 67}{space 3} 6.340315
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .20556957
     {txt}sigma_e {c |} {res} .09935482
         {txt}rho {c |} {res}    .81064{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. estimates store est_fe
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 3 *
. ********************************************************************************
. 
. 
. ivregress 2sls D.ln_sales (D.(L.ln_sales)=L2.ln_sales) D.(`vars'), noconstant robust
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}     1,288
{txt}{col 1}{col 51}Wald chi2({res}5{txt}){col 67}= {res}         .
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}         .
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} .21724

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  D.ln_sales{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_sales {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} 4.956136{col 26}{space 2} 3.604764{col 37}{space 1}    1.37{col 46}{space 3}0.169{col 54}{space 4}-2.109071{col 67}{space 3} 12.02134
{txt}{space 12} {c |}
{space 4}ln_price {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} -.176714{col 26}{space 2} .1431834{col 37}{space 1}   -1.23{col 46}{space 3}0.217{col 54}{space 4}-.4573483{col 67}{space 3} .1039204
{txt}{space 12} {c |}
{space 9}ndi {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} .0000923{col 26}{space 2}  .000067{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4} -.000039{col 67}{space 3} .0002236
{txt}{space 12} {c |}
{space 9}cpi {c |}
{space 9}D1. {c |}{col 14}{res}{space 2}-.0009513{col 26}{space 2} .0026053{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4}-.0060575{col 67}{space 3} .0041549
{txt}{space 12} {c |}
{space 7}pop16 {c |}
{space 9}D1. {c |}{col 14}{res}{space 2} 7.10e-06{col 26}{space 2} .0000204{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4}-.0000329{col 67}{space 3} .0000471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 50}Instrumented: {res:LD.ln_sales}{p_end}
{p 0 14 50}{space 1}Instruments: {res:D.ln_price D.ndi D.cpi D.pop16 L2.ln_sales}{p_end}

{com}. estimates store est_iv
{txt}
{com}. 
. 
. ********************************************************************************
.                                                                 * EJERCICIO 4 *
. ********************************************************************************
. 
. 
. xtabond2 ln_sales L.ln_sales `vars', gmmstyle(L.ln_sales, collapse) ivstyle(`vars') robust noleveleq
{res}{txt}Favoring space over speed. To switch, type or click on {stata "mata: mata set matafavor speed, perm"}.
{res}Warning: Two-step estimated covariance matrix of moments is singular.
{res}  Using a generalized inverse to calculate robust weighting matrix for Hansen test.
{res}  Difference-in-Sargan/Hansen statistics may be negative.

{txt}Dynamic panel-data estimation, one-step difference GMM
{hline 78}
Group variable: {res}state{txt}{col 49}Number of obs      = {res}     1288
{txt}Time variable : {res}year{txt}{col 49}Number of groups   = {res}       46
{txt}Number of instruments = {res}32{col 49}{txt}Obs per group: min = {res}       28
{txt}Wald chi2({res}0{txt}){col 15}= {res}        .{col 64}{txt}avg = {res}    28.00
{txt}Prob > chi2{col 15}={res}         .{col 64}{txt}max = {res}       28
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_sales {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .9975072{col 26}{space 2} .0460666{col 37}{space 1}   21.65{col 46}{space 3}0.000{col 54}{space 4} .9072184{col 67}{space 3} 1.087796
{txt}{space 12} {c |}
{space 4}ln_price {c |}{col 14}{res}{space 2}-.0935868{col 26}{space 2} .0323942{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.1570782{col 67}{space 3}-.0300953
{txt}{space 9}ndi {c |}{col 14}{res}{space 2}  .000016{col 26}{space 2} 3.63e-06{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4} 8.91e-06{col 67}{space 3} .0000231
{txt}{space 9}cpi {c |}{col 14}{res}{space 2}-.0016501{col 26}{space 2} .0003375{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0023117{col 67}{space 3}-.0009886
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2} .0000646{col 26}{space 2}  .000038{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-9.75e-06{col 67}{space 3}  .000139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Instruments for first differences equation
{col 3}Standard
{col 5}D.(ln_price ndi cpi pop16)
{col 3}GMM-type (missing=0, separate instruments for each period unless collapsed)
{col 5}L(1/29).L.ln_sales collapsed
{hline 78}
Arellano-Bond test for AR(1) in first differences:{col 52}z = {res} -5.04{txt}  Pr > z = {res} 0.000
{txt}Arellano-Bond test for AR(2) in first differences:{col 52}z = {res}  2.09{txt}  Pr > z = {res} 0.037
{txt}{hline 78}
Sargan test of overid. restrictions: chi2({res}27{txt}){col 49}={res} 255.58{txt}{col 59}Prob > chi2 = {res} 0.000
{txt}  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2({res}27{txt}){col 49}={res}  40.47{txt}{col 59}Prob > chi2 = {res} 0.046
{txt}  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  iv(ln_price ndi cpi pop16)
    Hansen test excluding group:{col 38}chi2({res}23{txt}){col 49}={res}  39.20{txt}{col 59}Prob > chi2 = {res} 0.019
{txt}    Difference (null H = exogenous):{col 38}chi2({res}4{txt}){col 49}={res}   1.27{txt}{col 59}Prob > chi2 = {res} 0.866

{txt}
{com}. estimates store est_gmm_os
{txt}
{com}. xtabond2 ln_sales L.ln_sales `vars', gmmstyle(L.ln_sales, collapse) ivstyle(`vars') twostep robust noleveleq
{res}{txt}Favoring space over speed. To switch, type or click on {stata "mata: mata set matafavor speed, perm"}.
{res}Warning: Two-step estimated covariance matrix of moments is singular.
{res}  Using a generalized inverse to calculate optimal weighting matrix for two-step estimation.
{res}  Difference-in-Sargan/Hansen statistics may be negative.

{txt}Dynamic panel-data estimation, two-step difference GMM
{hline 78}
Group variable: {res}state{txt}{col 49}Number of obs      = {res}     1288
{txt}Time variable : {res}year{txt}{col 49}Number of groups   = {res}       46
{txt}Number of instruments = {res}32{col 49}{txt}Obs per group: min = {res}       28
{txt}Wald chi2({res}0{txt}){col 15}= {res}        .{col 64}{txt}avg = {res}    28.00
{txt}Prob > chi2{col 15}={res}         .{col 64}{txt}max = {res}       28
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}   Corrected
{col 1}    ln_sales{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ln_sales {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .946648{col 26}{space 2} .0786545{col 37}{space 1}   12.04{col 46}{space 3}0.000{col 54}{space 4}  .792488{col 67}{space 3} 1.100808
{txt}{space 12} {c |}
{space 4}ln_price {c |}{col 14}{res}{space 2} -.112763{col 26}{space 2} .0423575{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-.1957822{col 67}{space 3}-.0297438
{txt}{space 9}ndi {c |}{col 14}{res}{space 2} .0000137{col 26}{space 2} 5.07e-06{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} 3.73e-06{col 67}{space 3} .0000236
{txt}{space 9}cpi {c |}{col 14}{res}{space 2}-.0014292{col 26}{space 2} .0004688{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.0023481{col 67}{space 3}-.0005103
{txt}{space 7}pop16 {c |}{col 14}{res}{space 2}  .000102{col 26}{space 2} .0000635{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.0000225{col 67}{space 3} .0002264
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Instruments for first differences equation
{col 3}Standard
{col 5}D.(ln_price ndi cpi pop16)
{col 3}GMM-type (missing=0, separate instruments for each period unless collapsed)
{col 5}L(1/29).L.ln_sales collapsed
{hline 78}
Arellano-Bond test for AR(1) in first differences:{col 52}z = {res} -4.74{txt}  Pr > z = {res} 0.000
{txt}Arellano-Bond test for AR(2) in first differences:{col 52}z = {res}  2.21{txt}  Pr > z = {res} 0.027
{txt}{hline 78}
Sargan test of overid. restrictions: chi2({res}27{txt}){col 49}={res} 255.58{txt}{col 59}Prob > chi2 = {res} 0.000
{txt}  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2({res}27{txt}){col 49}={res}  40.47{txt}{col 59}Prob > chi2 = {res} 0.046
{txt}  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  iv(ln_price ndi cpi pop16)
    Hansen test excluding group:{col 38}chi2({res}23{txt}){col 49}={res}  39.20{txt}{col 59}Prob > chi2 = {res} 0.019
{txt}    Difference (null H = exogenous):{col 38}chi2({res}4{txt}){col 49}={res}   1.27{txt}{col 59}Prob > chi2 = {res} 0.866

{txt}
{com}. estimates store est_gmm_ts
{txt}
{com}. 
. esttab est_pols est_fe est_iv est_gmm_os est_gmm_ts, se star(* 0.10 ** 0.05 *** 0.01) stats(N r2) mtitles("POLS" "FE" "IV" "GMM (One-Step)" "GMM (Two-Step)")
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                     POLS              FE              IV    GMM (One-S~)    GMM (Two-S~)   
{txt}{hline 92}
{txt}ln_price    {res}       -0.839***       -0.398***                      -0.0936***       -0.113***{txt}
            {res} {ralign 12:{txt:(}0.0523{txt:)}}    {ralign 12:{txt:(}0.0599{txt:)}}                    {ralign 12:{txt:(}0.0324{txt:)}}    {ralign 12:{txt:(}0.0424{txt:)}}   {txt}

{txt}ndi         {res}    0.0000319***   -0.0000481***                    0.0000160***    0.0000137***{txt}
            {res} {ralign 12:{txt:(}0.00000477{txt:)}}    {ralign 12:{txt:(}0.0000101{txt:)}}                    {ralign 12:{txt:(}0.00000363{txt:)}}    {ralign 12:{txt:(}0.00000507{txt:)}}   {txt}

{txt}cpi         {res}      0.00756***       0.0106***                     -0.00165***     -0.00143***{txt}
            {res} {ralign 12:{txt:(}0.000785{txt:)}}    {ralign 12:{txt:(}0.00135{txt:)}}                    {ralign 12:{txt:(}0.000338{txt:)}}    {ralign 12:{txt:(}0.000469{txt:)}}   {txt}

{txt}pop16       {res}  -0.00000253*     0.00000777                       0.0000646*       0.000102   {txt}
            {res} {ralign 12:{txt:(}0.00000143{txt:)}}    {ralign 12:{txt:(}0.0000178{txt:)}}                    {ralign 12:{txt:(}0.0000380{txt:)}}    {ralign 12:{txt:(}0.0000635{txt:)}}   {txt}

{txt}LD.ln_sales {res}                                        4.956                                   {txt}
            {res}                                 {ralign 12:{txt:(}3.605{txt:)}}                                   {txt}

{txt}L.ln_sales  {res}                                                        0.998***        0.947***{txt}
            {res}                                                 {ralign 12:{txt:(}0.0461{txt:)}}    {ralign 12:{txt:(}0.0787{txt:)}}   {txt}

{txt}D.ln_price  {res}                                       -0.177                                   {txt}
            {res}                                 {ralign 12:{txt:(}0.143{txt:)}}                                   {txt}

{txt}D.ndi       {res}                                    0.0000923                                   {txt}
            {res}                                 {ralign 12:{txt:(}0.0000670{txt:)}}                                   {txt}

{txt}D.cpi       {res}                                    -0.000951                                   {txt}
            {res}                                 {ralign 12:{txt:(}0.00261{txt:)}}                                   {txt}

{txt}D.pop16     {res}                                   0.00000710                                   {txt}
            {res}                                 {ralign 12:{txt:(}0.0000204{txt:)}}                                   {txt}

{txt}_cons       {res}        7.410***        5.968***                                                {txt}
            {res} {ralign 12:{txt:(}0.160{txt:)}}    {ralign 12:{txt:(}0.185{txt:)}}                                                   {txt}
{txt}{hline 92}
{txt}N           {res}         1380            1380            1288            1288            1288   {txt}
{txt}r2          {res}        0.220           0.416                                                   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}G:\Mi unidad\JM\Facultad de Ciencias Económicas (FCE)\Maestría en Econometría\7. Econometría de Datos de Panel\Examen\Datos\Examen Final.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Jun 2024, 01:31:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}